{"unique_id": "16755_wow_train", "id": "16755", "turns": [{"utterance": "The New York Times is an American Newspaper I just cant get behind. Its so one sided. ", "response": "I disagree.  They are one of the best newspapers in the country.  They report the facts"}, {"utterance": "As a native New Yorker even though they have been around since 1851 I'd still rather get my news other places. It's fake news!", "response": "Reporting the facts is not fake news!  People need to do more research and not just blindly believe what Trump says.  he lies a lot"}, {"utterance": "I'm left wing so I don't get behind trump. But the New York times is the 18th biggest new paper in the world. They have to play to the masses. ", "response": "True but it is not like they are reporting fake news.  They are just reporting the facts about corruption in Washington.  They would go out of business if they lie"}, {"utterance": "The New York Times is known as the Gray Lady because they don't see real issues only things in the gray zone. Which is all fake news. ", "response": "What is an example of that?  I have never seen them post anything fake"}, {"utterance": "Everything they report on is propaganda that is pushed by Bloomberg. In face in 2016 they did an article on Fake news and admitted they have to stretch the truth sometimes. ", "response": "I would love to see that URL.  It is facts not propaganda.  It is not like Breitbert"}], "annotations": [{"turn": 0, "annotation": [{"error_type": "E5", "comment": "special case: the system corrects the user", "user_correction": "C1", "user_reaction": "UR3"}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["like i said before im not one to read an actual newspaper but i do like reading opinion and political articles.", " the new york times is an american newspaper i just cant get behind."], "confidence": 0.615, "turn": 0}]}