{"unique_id": "82_wow_train", "id": "82", "turns": [{"utterance": "My husband has a beard and he shaved it off the other day - I'm not sure I like it, as he's just finally been able to grow a full one.", "response": "They have been a style for a long time! I wish I could grow a full beard, I can't do it haha."}, {"utterance": "Some people think that it's a trait back from the time when humans had hair all over there faces and body like gorillas - getting back to our roots I guess LOL!", "response": "Wow! I don't believe that, but I can see how people get that interpretation. They have a lot more hair."}, {"utterance": "And then you have some religions that say it's essential for males to have full beards and mandate it, like Sikhism", "response": "Right! I don't know much about Sikhism. I know a lot of the Old Testament people had beards though!"}, {"utterance": "Very true - it seems in todays' age that there are still places that see it as savage and uncivilized to have a beard, even stereotyping men as dangerous.", "response": "Right! I think a majority of the population stereotypes people with beards. It seems like they have become very popular in the 21st century though!"}, {"utterance": "It seems around here most people see it as bestowing virtues on the man, such as wisdom and strength.  It's very accepted where I live.", "response": "Fascinating. I feel like beards are also associate with people of age and life experiences."}], "corrections": [{"phrase": ["i think when people shape their beards in different ways is really interesting as well!", " my husband has a beard and he shaved it off the other day - i'm not sure i like it, as he's just finally been able to grow a full one."], "confidence": 0.503, "turn": 0}], "annotations": [{"turn": 0, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}]}