{"unique_id": "6702_wow_train", "id": "6702", "turns": [{"utterance": "Hey there! I play guitar, the 3 stringed fretted instrument. Have you ever played?", "response": "I have not unfortunately, but it is for sure a instrument I want to learn. Do you play anything else?"}, {"utterance": "No I don't I've dedicated all my creative energy to learning about the guitar. Mine projects sound acoustically and is made of wood. Although I have at times played an electric guitar with an amplifier.", "response": "That is cool! Which do you life better, acoustic or electric?"}, {"utterance": "Definitely acoustic. I find it's very nice to play a traditional style instrument. It reminds me of the older guitars throughout history that were made of wood and the string made of gut. Guitars belong to a family of instruments called chordophones.", "response": "Acoustic guitars definitely have a more soothing traditional sound to them as well as comforting. I do not know much about the family of instruments but what others are included in chordophones?"}, {"utterance": "It would include all stringed instruments that produce sound by vibrating the strings. Like the banjo, harps, things like that!", "response": "Ooo the harp is another instrument that is interesting to me! Just a simple instrument with beautiful sounds. Any others interest you?"}, {"utterance": "Hm... right now my passion is the acoustic guitar. I love the tone amplified by the hollow body of the acoustic guitar. It's like heaven!", "response": "Can't argue that! How long have you been playing for?"}], "annotations": [{"turn": 3, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["i dont believe a piano is a stringed instrument.", " like the banjo, harps, things like that!"], "confidence": 0.501, "turn": 3}]}