{"target": " Your train departs London Liverpool Street Saturday at 13:39 and arrives in Cambridge at 15:07. Can I help connect you to anything else in our city today?", "user_reaction_type": "Ignore and Continue", "user_reaction": " Great. Thank you so much.", "error_type": "Ignore Question", "error_text": " Booking was successful, the total fee is 13.28 GBP payable at the station . Reference number is : LMZE8AMH .", "context": "<user>  I am planning a trip in Cambridge <system>  I can help book a train to get you here. <user>  Ok I will book it for you <system>  How can I help you today? Are you needing train information or is there something else I can do for you? <user>  I need an expensive place to stay that's 2 stars. <system>  I show two hotels in the north, 1 is expensive and 1 is moderate. I also show 1 expensive 2 star hotel in the east. Which area do you prefer? <user>  Do any of them have free parking? <system>  express by holiday inn cambridge has free parking. That looks to be the only option available. <user>  Great, thanks! Which area is it in? <system>  Its on the East side. Would you like me to book you a room there? <user>  No, thanks. I just need to now the postcode. <system>  Okay the postcode is cb13lh. <user>  Thank you. I also need to book a train to Cambridge. <system>  Where are you departing from and on what day? <user>  i am departing from london liverpool street <system>  On what day would you like to travel? <user>  Saturday, please. I'm thinking just a short vacation over the weekend. <system>  There are 5 trains on Saturday headed to Cambridge, what time are you wanting to leave? <user>  What options do I have? <system>  the first leaves at 5:39 and the latest leaves at 23:39 <user>  I need at a train that leaves after 12:30 <system>  Ok I have one leaving at 13:39. Shall I book it ? <user>  Yes, Can you please book that thank you. <system>  How many tickets will you need for the train?<user>  I just need one ticket. Can you tell me what time it arrives? <system>", "id": 275, "id_original": "PMUL3558.json"}