{"unique_id": "21_00105_sgd_train", "id": "21_00105", "turns": [{"utterance": "I'm taking a vacation to Paris soon. Can you see if there are any one-way flights available?", "response": "At what time and from what location will you be leaving?"}, {"utterance": "I got my destination wrong. I'm actually visiting Washington. I'll be leaving from Chicago on Tuesday next week. What airline is used doesn't matter.", "response": "How about American Airlines for your flight? It leaves at 8:10 am, has 0 stops, and a ticket for it costs $128."}, {"utterance": "What other flights are available?", "response": "Another one you could go on is Southwest Airlines. That flight leaves at 7:25 am, has 0 stops, and a ticket for it costs $119."}, {"utterance": "What airport will the flight depart from? Can I get a refund on the ticket?", "response": "The flight will depart from O'Hare International Airport. Sadly, you cannot get a refund for your ticket."}, {"utterance": "That flight sounds great.", "response": "Would you like to purchase a ticket right now?"}, {"utterance": "No, I don't want to purchase a ticket just yet. Let's see what other flights there are. Can you find me a round trip flight?", "response": "At what time will you return?"}, {"utterance": "I aim to return on the 7th of this month.", "response": "I found 1 flight that could suit your needs, from Southwest Airlines. It leaves at 7:25 am and returns at 3:50 pm. A ticket for it costs $166."}, {"utterance": "When will the onward flight arrive? Can I get a refund on the ticket?", "response": "The onward flight arrives at 10:23 am, but alas, you can't get a refund on your ticket."}, {"utterance": "That flight is fine with me.", "response": "Should I purchase tickets right now?"}, {"utterance": "No, I'm fine.", "response": "Are there any other matters in which I can help you?"}, {"utterance": "That's all for now. Glad you were able to lend a hand.", "response": "It's my pleasure to be of help. Have a wonderful day."}], "annotations": [{"turn": 5, "annotation": [{"error_type": "", "comment": "not a correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " no, i don't want to purchase a ticket just yet."], "confidence": 0.703, "turn": 5}]}