{"unique_id": "56_00096_sgd_train", "id": "56_00096", "turns": [{"utterance": "I have a plan on short trip for which I want to search for an one-way flight. Can you help to search for the one?", "response": "Yes, I want to know the start and end place of your trip starting date so that I can short list the search as per your taste."}, {"utterance": "I am planning to visit New York City for which I need a flight from LAX on Sunday this week.", "response": "Found 5 results that suit your requirement. What about an outbound flight from Alaska Airlines which leaves at 9:30 am and it has 0 stops? For your information the cost of ticket is $236."}, {"utterance": "What is the name the Airport to which the flight will arrive and also check whether the ticket is refundable or not?", "response": "Sorry, it is not possible for the refund of ticket there and the destination Airport is JFK International Airport."}, {"utterance": "Do you have anything else in your list?", "response": "Yes another one outbound flight in American Airlines which leaves at 6:20 pm and it has 0 stops. The cost of ticket is $196. Is that convenient to you?"}, {"utterance": "That is perfect. I want to book the tickets in that flight under Economy class. Can you help to book it for me?", "response": "Yes, I need your confirmation to book 1 Economy class ticket in the flight from American Airlines which leaves from Los Angeles on March 3rd and goes to New York."}, {"utterance": "That is okay to proceed further and also let me know the Airport to which the flight will arrive.", "response": "The destination Air port is JFK International Airport. I have confirmed your tickets successfully."}, {"utterance": "What is the name of origin Airport?", "response": "It is LAX International Airport from the the flight will leave."}, {"utterance": "Thank you for your help to find the flight and also help me to book 1 room in a hotel which will allow pets with me.", "response": "What about 1 Hotel Brooklyn Bridge with rating 4.5."}, {"utterance": "That is okay and that's all for now. Thanks.", "response": "Have a nice day."}], "annotations": [{"turn": 4, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["actually, i apologize no need to book, i was just gathering information.", " can you help to book it for me?"], "confidence": 0.723, "turn": 4}]}