{"unique_id": "81_00107_sgd_train", "id": "81_00107", "turns": [{"utterance": "I am search for some nice hotels to stay for a while and I need your help in this regard.", "response": "Do you have any particular place to search for the hotel?"}, {"utterance": "Yes, search the suitable one for me in Los Angeles.", "response": "Got 10 results and what about your opinion on the best one which is Ac Hotel By Marriott Beverly Hills with 2 stars?"}, {"utterance": "Yes, that is great and I want the same.", "response": "Shall I proceed further in this or you need some other help from me?"}, {"utterance": "We will discuss about this hotel later and yes now I want to search for a bus to go there. Can you find the one for me?", "response": "Yes, please confirm the date as March 3rd on which you are planning to leave and let me know from which place do you want to leave, so that I can search the bus accordingly."}, {"utterance": "I need the bus from Long Beach, CA on this Saturday.", "response": "What about a bus departs at 6:40 am which has 0 transfers and ticket cost at $12?"}, {"utterance": "Search for something else please.", "response": "Another one at 7:40 am with cost $9 and has 0 transfers. How do you think about it?"}, {"utterance": "That is perfect and I need the same. Now, we go back to booking of the hotel that you have selected for me.", "response": "Shall I book the room from March 2nd and up to which date you want the rooms?."}, {"utterance": "Please book it from March 6th for 2 days.", "response": "Need your confirmation to book 1 room at Ac Hotel By Marriott Beverly Hills for 2 days from March 6th in Los Angeles."}, {"utterance": "Just make a few changes as number of rooms as 2 and check-in date as the 7th.", "response": "Okay, please confirm to book 2 rooms from March 7th."}, {"utterance": "That is perfect and proceed further. Also get me their contact number and address for my reference.", "response": "Their contact number is +1 323-852-7000 and their address is 6399 Wilshire Boulevard. I have booked the rooms successfully in that hotel."}, {"utterance": "Thanks for these information. Now I need one more favor from you. Please search for some nice songs especially by In This Moment in the album Blood.", "response": "How about a song name Adrenalize by In this Moment in the album Blood?."}, {"utterance": "I need more details about this song to confirm. I want to know the year in which this song was released and the genre of this song.", "response": "I is a Metalcore type of song and the same was released in the year 2012. Hope this information is useful to select this song."}, {"utterance": "Yes, I like it very much.", "response": "Do you want to play this song now?"}, {"utterance": "Yes, do it for me.", "response": "Please confirm to play this song Adrenalize on TV."}, {"utterance": "Yes, proceed the same.", "response": "Song started playing now and you can enjoy the same."}, {"utterance": "Thank you for this help and that's all I want now.", "response": "Have a nice day."}], "annotations": [{"turn": 7, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " please book it from march 6th for 2 days."], "confidence": 0.61, "turn": 7}]}