{"unique_id": "8_00044_sgd_train", "id": "8_00044", "turns": [{"utterance": "I have some free time this weekend and I am looking for some interesting events to go to. Can you find me any interesting events I could attend?", "response": "Is there a particular city you would like me to search for events in. Do you have a preference on the category of events."}, {"utterance": "I am interested in events around New York. I enjoy going to sports games.", "response": "I found 10 events that you would enjoy. The Mets VS Braves are playing at Citi Field on March 13th at 6 pm."}, {"utterance": "Please share some more information with me. Where is the venue located?", "response": "This is a baseball game. The address is 123-01 Roosevelt Avenue"}, {"utterance": "This is perfect! Can you find some other events for me? I will be in Toronto, Ontario. Please look for events happening near Toronto on Friday next week.", "response": "There is a Blue Jays VS Braves game. They are playing at the Rogers Centre next Friday at 8 pm."}, {"utterance": "This is perfect! Can you find some other events for me? I would like to have multiple options.", "response": "There is a Blue Jays Vs Indians game. They are playing at the Rogers Centre next Friday at 7:30 pm."}, {"utterance": "This is perfect! Please reserve 2 tickets to the Blue Jays vs. Indians game for me", "response": "Please confirm the following details: You are reserving 2 tickets for the Blue Jays Vs Indians event. This reservation is for next Friday in Toronto."}, {"utterance": "Incorrect. I would like to reserve four tickets.", "response": "Please confirm the following details: You are reserving 4 tickets for the Blue Jays vs. Indians event in Toronto."}, {"utterance": "Yes, this is the correct information. May you provide me the address of the venue?", "response": "Your reservation is confirmed Enjoy the game! The address is 1 Blue Jays Way."}, {"utterance": "Thank you so much for your help! That is all I need.", "response": "Have a great day."}], "annotations": [{"turn": 6, "annotation": [{"error_type": "", "comment": "no correction (even if the utterance contains the term \"incorrect\", the user changes his mind)", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i would like to reserve four tickets."], "confidence": 0.554, "turn": 6}]}