{"unique_id": "MUL2651.json_multiwoz_train", "id": "MUL2651.json", "turns": [{"utterance": "I will be in Cambridge and am looking for some places to go in the centre while I visit.", "response": "I'd be happy to help you pick one! There are over 40 attractions in city centre; what type of activity are you interested in?"}, {"utterance": "I don't really care. Can you suggest something?", "response": "How about a museum? Or we have some terrific colleges you could visit. There's always the theatre as well."}, {"utterance": "How about a theatre? Can you give me the post code and phone number for one, please?", "response": "The Cambridge Arts Theatre is located at 6 saint edward's passage in postcode cb23pj. Their phone number is 01223503333."}, {"utterance": "Thank you! Can you help me find a hotel to stay in? I need it to have free wifi.", "response": "Just about every lodging in town has internet (it's 2017, after all!). Do you have a certain area or price range in mind?"}, {"utterance": "It needs to be in the same area as theatre and have free parking. I dont care about the price.", "response": "Okay its address is located at 6 saint edward's passage and its postal code is cb23pj."}, {"utterance": "Can you book it for me? Just for one person starting on Wednesday for 5 nights.", "response": "I'm sorry, none of the hotels in the centre are free on those dates. Would you like to try a different number of days?"}, {"utterance": "Can you try for just 2 nights then?", "response": "Your booking at the Alexander bed and breakfast was successful, the reference number is L60GOSEU ."}, {"utterance": "Can I please book a taxi to get to the hotel?", "response": "Sure. What time would you like to be picked up from Cambridge Arts Theatre?"}, {"utterance": "I'd actually like to be picked up from Alexander bed and breakfast by 15:30.", "response": "I have booked a black BMW to pick you up. The contact number is 07334398349."}, {"utterance": "That's all for today. Thanks for your help!", "response": "Thank you Goodbye"}], "annotations": [{"turn": 4, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["i dont care about price.", " i dont care about the price."], "confidence": 0.97, "turn": 4}]}