{"unique_id": "PMUL0022.json_multiwoz_train", "id": "PMUL0022.json", "turns": [{"utterance": "I have a hotel that I really want to stay at today.", "response": "Can you tell me the name of the hotel please and then we can talk about booking a room?"}, {"utterance": "It is the Huntingdon Marriott Hotel", "response": "When will you be staying there?"}, {"utterance": "I'm not sure. Do they have internet?", "response": "Yes, they have internet available."}, {"utterance": "What type of hotel is it? And what is the post code?", "response": "Its an expensive hotel."}, {"utterance": "Can I get the postcode please?", "response": "Okay, the postal code is: PE296FL. Can I assist with anything else?"}, {"utterance": "I also would like to eat in the center of town.", "response": "There is a lot of restaurants in the town centre. What type of food are you looking for? What is your price range for the restaurant?"}, {"utterance": "Don't really have a food preference but would prefer something expensive.", "response": "There are 33 expensive restaurants in the centre. Are you sure you have no preference for food type?"}, {"utterance": "None, it is my first time in the town and I like every food, I will go with what you recommend.", "response": "Okay. Well, I've heard great things about the Cambridge Chop House. It's a British restaurant. Would you like me to book that for you?"}, {"utterance": "Yes can you book it for 3 people on Wednesday at 17:30?", "response": "Your booking was successful. Here is your reference number, CUZ69HSD ."}, {"utterance": "Thanks, now can you book me a taxi? I want to be picked up from my hotel and taken to the restaurant by 17:30. Please give me car type/contact number", "response": "Your taxi has been booked. The car type is a blue Toyota and the contact number is 07594906784. Is there anything else I can help you with?"}, {"utterance": "That's all I need for now. Thanks for all your help!", "response": "You are quite welcome! Enjoy your stay!"}], "annotations": [{"turn": 1, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["are you sure that there are no hotels on the west side of town?", " it is the huntingdon marriott hotel"], "confidence": 0.55, "turn": 1}]}