{"unique_id": "PMUL0316.json_multiwoz_train", "id": "PMUL0316.json", "turns": [{"utterance": "I'd like to find a restaurant that offers Asian Oriental cuisine, in the centre, if possible.", "response": "Definitely! I have places from cheap to expensive, though my favorite is Yippee Noodle Bar, which is moderately-priced."}, {"utterance": "I would like Yippee.", "response": "I'd be happy to make a reservation for you. What day/time will you be dining, and how many are in your party?"}, {"utterance": "Monday, 19:00, for 6 people.", "response": "I have successfully reserved a table for your party of 6 at the Yippee Noodle Bar for Monday at 19:00. Your reference number is XSQHK9YG"}, {"utterance": "Great, I also need a hotel room if you can help me find something.", "response": "Sure. We have several places ready to book. Which part of town would you like?"}, {"utterance": "The west please.", "response": "There are 4 in that area do you have a price range or type of hotel you prefer?"}, {"utterance": "The hotel doesn't need to include internet. It should be in the same area as the restaurant.", "response": "I have 5 different options for you. They vary in price range. Did you have a certain price range in mind?"}, {"utterance": "The price does not matter. Please make a recommendation and book it for the same group of people and 4 nights starting from the same day.", "response": "OK, you are booked in Cityroomz as requested, the reference number is A1ZBLCZ3, any further questions?"}, {"utterance": "no and thank you for your help", "response": "Ok, have a great day!"}], "corrections": [{"phrase": ["i dont care about price.", " the price does not matter."], "confidence": 0.782, "turn": 6}], "annotations": [{"turn": 6, "annotation": [{"error_type": null, "comment": "just a response to a systems question", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}]}