{"unique_id": "PMUL0322.json_multiwoz_train", "id": "PMUL0322.json", "turns": [{"utterance": "I am planning a trip to Cambridge and am looking for a hotel.", "response": "There are at least 9 hotels in the area. What price range would you like?"}, {"utterance": "Moderate price range. And a 4 star rating, please.", "response": "I'm sorry, we don't have any hotel rooms that meet those requirements."}, {"utterance": "I need a place with wifi.", "response": "I have 2 hotels in the moderate price range with free wifi and 2 star ratings in the north location, would you like one of those?"}, {"utterance": "yes and book it for me and I need postcode", "response": "would you like the ashley hotel, cityroomz, or lovell lodge?"}, {"utterance": "Ashely hotel will be fine thank you", "response": "The postcode for the Ashley hotel is cb41er, can you give me some more information to book your room?"}, {"utterance": "it has wifi and free parking,there is no info on the room", "response": "Okay the Ashley Hotel and the Lovell Lodge match your preferences."}, {"utterance": "Which one is better?", "response": "Well, both have a two star rating and are in the same price range, so I think they'd be about the same, quality-wise."}, {"utterance": "Please pick on and make reservations for 8 people for 3 nights starting on Thursday.", "response": "Your reservation for 8 people at Ashley Hotel this Thursday for 4 days 3 nights was successful. Your Reference number is : NZP6RTB5 ."}, {"utterance": "Thanks now I need a cab to and from both places", "response": "Which place will be you departing from and and do you have to leave or arrive by a certain time?"}, {"utterance": "I need to be at the restaurant by 1:00.", "response": "What is the other place?"}, {"utterance": "I need to be picked up at the hotel, please.", "response": "I'm sorry, what restaurant do you need to be picked up from?"}, {"utterance": "It appears that I forgot to book a restaurant reservation. I need something in the south in the same price range as the hotel, please.", "response": "I have 9 restaurants in the south. What price range would you like?"}, {"utterance": "Priced moderately please.", "response": "I have only one in the moderate price range serving modern European food. Would you like a booking there?"}, {"utterance": "I dont want to book it quite yet. Could you get me the phone number, postcode, and address?", "response": "Restaurant alimentum is located at 152 - 154 Hills Road, postcode cb28pb. Their phone number is 01223413000. May I help with something else?"}, {"utterance": "Can you help me find a taxi?", "response": "I have a yellow Honda scheduled to pick you up at the hotel at 1:00. The contact number is 07039029314. Can I help with anything else?"}, {"utterance": "No that is all I need today. Thanks for the help.", "response": "Thank you very much for calling the Cambridge TownInfo centre, have a nice day."}], "annotations": [{"turn": 13, "annotation": [{"error_type": null, "comment": "the system asks the user if he wants a booking, user denies", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i dont want to book it quite yet."], "confidence": 0.855, "turn": 13}]}