{"unique_id": "PMUL0439.json_multiwoz_train", "id": "PMUL0439.json", "turns": [{"utterance": "I need a place to stay located in the west of town.", "response": "Ok, I have 4 results for restaurants in the west area,what is your price range?"}, {"utterance": "Actually, I'm more concerned with a place to stay and I'd like it to be in the west please.", "response": "I have many choices in the west. Do you have a price range or amenities preference?"}, {"utterance": "If it could be a 4 star hotel with free wifi, that would be perfect.", "response": "The huntingdon Marriott hotel is a good option."}, {"utterance": "Can you book it for me for Thursday I'm staying 5 nights. Only one person is staying.", "response": "You have a reservation starting on Thursday at the Huntingdon Marriott Hotel for 5 nights. Your reference number is X4HZQE2D . Is there anything else I can help you with?"}, {"utterance": "I need a restaurant called the bedouin for the same group of people at 14:15 and I would need the reference number.", "response": "I have bedouin here. Which day would you like to dine?"}, {"utterance": "I want to book it for 1 on 14:15 on Thursday.", "response": "I'm not showing it is available for that time. Would you like me to try again or try a different time?"}, {"utterance": "Can you try for Tuesday?", "response": "Your table was booked for Tuesday, at 14:15. The restaurant will hold it for 15 minutes. Your reference number is B9DBXB04 . Is there anything else I can assist you with?"}, {"utterance": "That is all for now. Thank you for all your help.", "response": "Thank you for using our services."}], "annotations": [{"turn": 0, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["are you sure that there are no hotels on the west side of town?", " i need a place to stay located in the west of town."], "confidence": 0.579, "turn": 0}]}