{"unique_id": "PMUL0490.json_multiwoz_train", "id": "PMUL0490.json", "turns": [{"utterance": "I'm looking for lodgings on the east side, in the expensive price range.", "response": "The Express by Holiday Inn is located at 15-17 Norman Way int he Coldhams Business Park which is located in the east."}, {"utterance": "it doesn't need a free parking. Can you book a room for me?", "response": "Yes, how many people and what day would you like to book?"}, {"utterance": "I do not need to book.", "response": "Is there anything else I may help you with today?"}, {"utterance": "I just need to know the how many stars it has, the phone number there, and if they have WiFi.", "response": "Sure, it has two stars, includes wifi, and the phone number is 01223866800. Can I help you with any thing else today?"}, {"utterance": "I am also trying to find a Venetian restaurant. Are there any in town?", "response": "Yes, we have thanh binh on the West side. Would you like a reservation?"}, {"utterance": "Please book it for me.", "response": "Yes I will book it for you and get a reference number ?"}, {"utterance": "Can you make a reservation for Monday at 19:30 for 8 people?", "response": "Absolutely. Anything else I can assist you with?"}, {"utterance": "Um I think you're getting ahead of yourself? I'm still waiting on that reference number for the booking you said you'd complete....", "response": "Unfortunately I can't get that booking for you. Is there anything else I can do for you?"}, {"utterance": "Oh...alright...well I guess not then. You weren't very helpful but whatever bye", "response": "I am sorry for the delay. Also, there are no Venetian restaurants. Did you want a Vietnamese restaurant instead?"}], "annotations": [{"turn": 2, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i do not need to book."], "confidence": 0.625, "turn": 2}]}