{"unique_id": "PMUL1490.json_multiwoz_train", "id": "PMUL1490.json", "turns": [{"utterance": "I'm just looking for a cool place to go later.", "response": "Which area do you want to go to?"}, {"utterance": "I would like to visit a college, what would the entrance fee be?", "response": "Almost all of them are free. Christ's college is famous and free. What part of town do you prefer?"}, {"utterance": "I don't prefer a part of town. I need to find a train to get there. Can you help me with that too?", "response": "Yes, when would you like to travel?"}, {"utterance": "I would like to leave on tuesday.", "response": "Christ's college is located in Centre. Where will you be departing from on Tuesday and what time?"}, {"utterance": "hold the phone. what is the entrance fee for christ's college?", "response": "Christ's College is free admission."}, {"utterance": "Great I also need a train departing from birmingham new street and arriving by 18:15", "response": "I'm sorry there are no trains that fit that criteria. Would you be able to arrive any later?"}, {"utterance": "Are you sure? Can you please check again for a Wednesday train from Birmingham New Street to Cambridge, arriving by 18:15?", "response": "I am sorry I cannot find anything for those specifications"}, {"utterance": "I find it hard to beleive there are no trains arriving by 18:15. It doesn't need to arrive AT 18:15 just before that. Please check again.", "response": "TR2286 leaves birmingham new street at 14:40 and arrives in Cambridge at 17:23. The price is 75.10 pounds and takes 163 minutes. May I book this for you?"}, {"utterance": "Yes please, just one ticket.", "response": "Booking was successful, the total fee is 75.09 GBP payable at the station . Reference number is : JWJXOOQU ."}, {"utterance": "Thank you that is all I needed today.", "response": "I'm sorry for the confusion earlier, I hope you have a lovely time here."}], "corrections": [{"phrase": ["check again.", " please check again."], "confidence": 0.904, "turn": 6}], "annotations": [{"turn": 6, "annotation": [{"error_type": "E3", "comment": "the user does not believe the system and later explicitly says that he does not need to arrive exaclty on the time specified, but just before that", "user_correction": "C1", "user_reaction": "UR5"}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}]}