{"unique_id": "MUL1246.json_multiwoz_train", "id": "MUL1246.json", "turns": [{"utterance": "Can you help me find a 4 star expensive hotel please?", "response": "I found two that fit your description; huntingdon marriott hotel and university arms hotel."}, {"utterance": "OK iLL GO WITH THE FIRST CHOICE THE huntingdon marriott hotel", "response": "That's a great hotel. Would you like me to make you a reservation?"}, {"utterance": "Yes please for 7 people for 4 nights starting thursday and I need the reference number.", "response": "I've got you booked with reference number L7WTALJT ."}, {"utterance": "Thank you. I am also looking for a Chinese restaurant in the same area as the Huntingdon Marriott Hotel.", "response": "There are no chinese restaurants in that area,any other type of food I can check with?"}, {"utterance": "Are there any Chinese restaurants within a short distance outside the area which are in the same price range as the hotel?", "response": "I would recommend the Ugly Duckling in the center of town. That's an expensive Chinese restaurant right in the middle of everything."}, {"utterance": "Excellent, can I get the address of the Ugly Duckling?", "response": "Of course! The address is 12 St. Johns Street City Centre and the postcode is cb21tw. Would you like me to make a reservation for you?"}, {"utterance": "No, but I would like to book a taxi between the restaurant and hotel. I've like to leave the restaurant by 17:30.", "response": "I was able to book your taxi. Be looking out for a yellow BMW. If you need to reach them, please call 07101227577. Is there anything else I can help with?"}, {"utterance": "No, I do not think so. Thank you for your help!", "response": "You're very welcome!"}], "annotations": [{"turn": 7, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["no i dont think so.", " no", " i do not think so."], "confidence": 0.945, "turn": 7}]}