{"unique_id": "PMUL1703.json_multiwoz_train", "id": "PMUL1703.json", "turns": [{"utterance": "I'd like some help finding a train leaving peterborough on tuesday.", "response": "Absolutely, do you want to leave or arrive by a certain time?"}, {"utterance": "Leave after 10:15, please.", "response": "Unfortunately, there are no trains that leave after 10:15."}, {"utterance": "Okay what are the available train times?", "response": "i have booked you one leaving at 10.19."}, {"utterance": "OK, is it going to Cambridge? Can I have the reference number please?", "response": "there seems to be a break down in communication. Please restate the departure and arrival locations and the day and time."}, {"utterance": "I need a train from Peterborough to Cambridge on Tuesday, leaving after 10:15.", "response": "I have train TR1674 leaving at 10:48 and arriving at 11:38. Would you like to book tickets?"}, {"utterance": "I need to book for one person, I will need the reference number. Also, I need to book a hotel called Caroline Bed and Breakfast, I need the address.", "response": "Okay. Your train booking was successful. You'll owe 16.5 which can be paid at the station. The reference number is X58GNQ74 ."}, {"utterance": "Can you look up a hotel called Carolina bed and breakfast?", "response": "I have it right here"}, {"utterance": "Well, thats great. That means you should be able to give me the address", "response": "The address is 138 perne road. Would you like to book a room?"}, {"utterance": "No, I just need the address. Thank you.", "response": "it is 138 perne road."}, {"utterance": "Have a nice day.", "response": "Thank you, have a wonderful day. Let us know if we can help in any way."}], "annotations": [{"turn": 6, "annotation": [{"error_type": "E2", "comment": "the user additionally asked for details on a hotel", "user_correction": "C1", "user_reaction": "UR3"}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["are you sure that there are no hotels on the west side of town?", " can you look up a hotel called carolina bed and breakfast?"], "confidence": 0.554, "turn": 6}]}