{"unique_id": "PMUL1906.json_multiwoz_train", "id": "PMUL1906.json", "turns": [{"utterance": "Is there a train I can take to cambridge that leaves after 18:00?", "response": "Absolutely. Where are you coming from?"}, {"utterance": "I'm departing from birmingham new street.", "response": "I have train TR8903 that leaves at 18:40 and will arrive in Cambridge at 21:23. Would that interest you?"}, {"utterance": "Yes please book me for one ticket.", "response": "Booking was successful, the total fee is 75.09 GBP payable at the station . Reference number is : KHBLJGHN . Is there anything else I can do to assit you today?"}, {"utterance": "Also looking for a guesthouse in the cheap price range.", "response": "Are you going to stay in a specific area of town?"}, {"utterance": "The area of town is not important, but I would like a hotel with free parking and four stars.", "response": "I have the allenbell would you like information on that?"}, {"utterance": "Yes please. Can you tell me anything about it- How big are the rooms? Do they offer suites?", "response": "I don't have that information in front of me I can give their phone number"}, {"utterance": "Yes, I need the phone number please!", "response": "01223210353 is the phone number"}, {"utterance": "Could you go ahead and book me the guesthouse?", "response": "What day would you like the reservation to be on?"}, {"utterance": "I am not looking to book just yet, actually. Just please find information on guesthouse in the cheap price range.", "response": "I have several to choose from is there an area you'd prefer?"}, {"utterance": "It needs 4 stars please.", "response": "Ok! I highly suggest the Leverton House. What information are you looking for?"}, {"utterance": "I just need their phone number please.", "response": "Sure, the phone number is 01223292094. Can I be of further assistance?"}, {"utterance": "No thank you that is all I needed.", "response": "You are welcome, have a good day."}], "annotations": [{"turn": 8, "annotation": [{"error_type": null, "comment": "the system asks the used whether he wants a booking; the user denies", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i am not looking to book just yet", " actually."], "confidence": 0.866, "turn": 8}]}