{"unique_id": "MUL1464.json_multiwoz_train", "id": "MUL1464.json", "turns": [{"utterance": "I'm looking for an indonesian restaurant that's moderate in price.", "response": "There are no Indonesian restaurants in the moderate price range would you like me to search for something else?"}, {"utterance": "Are you sure? I thought there was one located in the centre of town.", "response": "Unfortunately I do not see any indonesian restaurants. Maybe you would like asain instead?"}, {"utterance": "Asian oriental food sounds good. What options do you have available?", "response": "I have a few, what price range do you prefer?"}, {"utterance": "Im not really worried about price. Which do you suggest that is located in the centre?", "response": "Th Kymmoy is expensive but very nice."}, {"utterance": "I think I would like to be in the moderate price range please.", "response": "The yippee noddle bar is in the moderate price range. Would you like to book a table?"}, {"utterance": "Actually, can you give me the phone number for Yippee Noodle Bar instead?", "response": "Absolutely. Their phone number is 01223518111. Is there anything else I can help you with?"}, {"utterance": "I am also looking for a train. The train should arrive by 16:15 and should leave on Friday.", "response": "I'm sure we can find your perfect train for you. What are your departure and arrival locations?"}, {"utterance": "I want to go to norwich from cambridge.", "response": "The first train from Cambridge to Norwich leaves at 05:36, and there are trains every hour thereafter. The duration of the trip is 79 minutes. Which departure time works best for you?"}, {"utterance": "Can you suggest one? I would like to arrive in Norwich about 4:15 PM.", "response": "I would recommend TR8314, which will get you there at 15:55. Would you like me to book your ticket?"}, {"utterance": "Yes, one ticket please.", "response": "Booking was successful, the total fee is 17.6 GBP payable at the station ."}, {"utterance": "When does the TR8314 leave?", "response": "It will leave at 14:36"}, {"utterance": "Great! Thanks for all your help.", "response": "Is there anything else I can help you with today?"}, {"utterance": "No, that is all. Thanks, goodbye.", "response": "You're welcome! Have a great day!"}], "annotations": [{"turn": 3, "annotation": [{"error_type": null, "comment": "just a response to a systems question", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["i dont care about price.", " im not really worried about price."], "confidence": 0.725, "turn": 3}]}