{"unique_id": "PMUL3474.json_multiwoz_train", "id": "PMUL3474.json", "turns": [{"utterance": "I'm actually looking for an expensive restaurant that serves Indian food", "response": "curry garden is a nice place to dine. Do you want to book ?"}, {"utterance": "Is that in the west area. I really would like to be in the west.", "response": "Here is one in the west. Will this work for you maharajah tandoori restaurant."}, {"utterance": "Great. I would like that. Can you book us for 8 people on Thursday at 16:45?", "response": "Done! Your reference number is 2AYFR5LL . Do you need help with anything else?"}, {"utterance": "I'm also looking for a hotel. I need free parking. It can be an expensive place.", "response": "There are quite a few hotels that meet that requirement. Do you have a preference on what part of town you'd like to be in?"}, {"utterance": "I really don't. Do you have any recommendations?", "response": "I will recommend the huntingdon marriot hotel to you. It is a 4 star hotel with free parking and wifi and has excellent reviews though expensive."}, {"utterance": "Does that include free wifi?", "response": "I cannot find the info on free wifi or not, I apologize."}, {"utterance": "It should be right there under internet...", "response": "My mistake. Yes, there is free internet. Would you like for me to book it for you?"}, {"utterance": "I dont want to book it just yet. Thanks for all your hard work.", "response": "Is there anything else I can help you with?"}, {"utterance": "No, that's good thank you for all of your help.", "response": "You're welcome. Have a nice day."}], "annotations": [{"turn": 7, "annotation": [{"error_type": null, "comment": "the system asks the user if he wants a booking, user denies", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i dont want to book it just yet."], "confidence": 0.856, "turn": 7}]}