{"unique_id": "PMUL4254.json_multiwoz_train", "id": "PMUL4254.json", "turns": [{"utterance": "I'd like a european food place in the west please.", "response": "Then you want the cambridge lodge restaurant. Would you like me to book you a table?"}, {"utterance": "Yes, please. I would like a table for 2 on Thursday at 20:00.", "response": "OK, I made your reservation. Do you want your reference number now?"}, {"utterance": "Yes, please. And then I will need you to help me find a place to stay.", "response": "Reference number is : IA42WAOZ . What type of place are you looking for, a hotel or a guestroom?"}, {"utterance": "Actually, either is fine. But I would like something moderately priced that offers free wifi.", "response": "I would recommend the Ashley Hotel, it is in the north, and moderately priced."}, {"utterance": "What amenities does the Ashley Hotel have? I need free parking, free wifi, and 4 stars.", "response": "It has free parking and wifi; however it is only a 2 star hotel. Would you like me to search for a different hotel?"}, {"utterance": "Yes please search for something that is four stars.", "response": "There are no 4 star hotels matching your criteria. I can however book you a 3-star or 2-star hotel if you want"}, {"utterance": "No, I would like for it to be 4 stars. Is there another area you can check?", "response": "I'm sorry there are no matches."}, {"utterance": "Okay, how about a 3 star?", "response": "I am sorry there are no 3 star hotels that match your criteria. There is however a few 3 star guesthouses. Would you like to book a guesthouse?"}, {"utterance": "I would have liked a hotel but if there is none then a guesthouse works for me", "response": "There are 3 star guesthouses in the south, north and west. Do you have a preference?"}, {"utterance": "I don't really have a preference. Can you recommend one?", "response": "Sure! I recommend the Hamilton Lodge. Would you like for me to book a room?"}, {"utterance": "I need their info. Address and phone number.", "response": "Their phone number is 01223365664 and their addres is 156 Chesterton Road, postcode CB4 1DA. Anything else I can help with?"}, {"utterance": "Yes, I need a taxi from the hotel to the restaurant, please. I need to get there by the reservation time.", "response": "You got the blue toyota enjoy the ride."}, {"utterance": "thnks alot. you have been of help", "response": "Glad to be of your service. Is there anything else?"}, {"utterance": "I just need the contact number for the taxi, please.", "response": "Booking completed! Booked car type : blue toyota Contact number : 07013802794 Can I help you with anything else today?"}, {"utterance": "No, that should be all for today.", "response": "thank you for choosing us"}, {"utterance": "I like you no problem.", "response": "Thanks for using our service today!"}], "annotations": [{"turn": 7, "annotation": [{"error_type": "E7", "comment": "the utterance previously said that there are 3-star hotels; now it says that there are none.", "user_correction": "C1", "user_reaction": "UR1"}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["id really like a 4 star.", "okay, how about a 3 star?"], "confidence": 0.825, "turn": 7}]}