{"unique_id": "PMUL4500.json_multiwoz_train", "id": "PMUL4500.json", "turns": [{"utterance": "Can you help me find somewhere to stay with free wifi?", "response": "Sure, most places offer that these days. Do you have an area of town you would like to stay in?"}, {"utterance": "We need the hotel to be in the north.", "response": "Okay and what is your price range?"}, {"utterance": "Price range doesn't matter to me. I'd like it to have a one star.", "response": "I'm so sorry, but we don't have a one star in that area. Would you like for me to check a different area?"}, {"utterance": "How about a 4 star rating?", "response": "The acorn guest house is a 4 star guesthouse with wifi. Would you like to make a reservation?"}, {"utterance": "sure, i need it for 3 nights starting wednesday.", "response": "Before I book how many people will be staying with you?"}, {"utterance": "Please book the hotel for 5 people.", "response": "Booking was successful. Reference number is : YYXR9VMX"}, {"utterance": "Thanks. I also need a restaurant in the same area.", "response": "There are several restaurants, what type of food and price range?"}, {"utterance": "Indian food would be great.", "response": "Okay, what is your price range? We have one in the moderate and one in the cheap range."}, {"utterance": "Can you please make a reservation at the moderately priced one?", "response": "The Nirala serves Indian cuisine at a moderate price, and is located in the north. How many in your party? What time would you like the table reserved?"}, {"utterance": "Ok great, can you book a table for 5 at 14:00 on Wednesday.", "response": "I will book that for you now."}, {"utterance": "Thanks, I will need the reference number.", "response": "Your reference number is QV1Z4XH7 . Can I help you with anything else?"}, {"utterance": "No, thank you for helping me with both bookings so quickly. Have a great day. Goodbye.", "response": "Thank you for allowing me to assist you with your travel."}], "annotations": [{"turn": 3, "annotation": [{"error_type": null, "comment": "just a response to a systems question", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["id really like a 4 star.", " how about a 4 star rating?"], "confidence": 0.792, "turn": 3}]}