{"unique_id": "MUL1679.json_multiwoz_train", "id": "MUL1679.json", "turns": [{"utterance": "I need some information. on a train to london liverpool street arriving by 13:00.", "response": "Yes I have 28 entries with that destination arriving at various times Monday thru Sunday"}, {"utterance": "I'm leaving on Sunday from Cambridge, is there anything available?", "response": "I have the TR7187 that will arrive at 01:27. Would you like me to book that for you?"}, {"utterance": "Yes, please book that for me.", "response": "For how many people?"}, {"utterance": "Hold on a moment. Can I first make a restaurant booking?", "response": "Yes, we can do that after we finish with your train booking. How many people do you need tickets for?"}, {"utterance": "I dont need to book it yet. What's the departure and travel times for the train?", "response": "TR7187 departs from Cambridge at 23:59 and arrives in London Liverpool Street at 01:27. Do you want me to book that for you or move on to restaurant assistance?"}, {"utterance": "I really dislike math, can you just let me know the trip duration if you have it in front of you?", "response": "Sure. The trip is 88 minutes. Would you like to book a seat?"}, {"utterance": "Yes, and then lets work on the restaurant.", "response": "How many tickets would you like?"}, {"utterance": "I don't want to book the train right now. Could you find me a restaurant in centre that serves swedish food?", "response": "There appear to be none in the area. Any other types of food you are interested in?"}, {"utterance": "Is there British food in the centre in the moderate price range?", "response": "There are four restaurants that serve british food. I recommend Cotto for you. Their address is 183 East Road City Centre"}, {"utterance": "What's the postcode with that?", "response": "The postcode is cb11bg. Can I help you with anything else?"}, {"utterance": "No thank you, that is everything.", "response": "Have a nice day!"}], "annotations": [{"turn": 4, "annotation": [{"error_type": null, "comment": "the system asks the user about if he wants a booking, the user denies", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i dont need to book it yet."], "confidence": 0.808, "turn": 4}]}