[{"MUL2130.json": ["USER: I'm looking to book lodging for a place to stay, it should be a guesthouse and have free wifi.", "SYSTEM: In what area would you prefer it to be?", "USER: I would like one in Caimbridge that is in the cheap price range.", "SYSTEM: I have 9 of them. If you don't have a certain area, I can recommend the el shaddai.", "USER: The El Shaddi is fine. Can I please have a room for 4 people, for 4 nights, starting from Monday?", "SYSTEM: Your rooms at the El Shaddai have been booked. Your reference number is JYUN4Q2R . Is there anything further I can assist you with today?", "USER: Yes, please help me find a train? I need to travel on Friday, and I need to arrive at my destination by 21:15, please.", "SYSTEM: What are your departure and destination cities?", "USER: I am leaving from Cambridge and going to Stansted Airport.", "SYSTEM: I have 16 trains to choose from. Do you have a price preference?", "USER: No, but if you can't decide, maybe pick the one that departs the latest and still gets us their by 21:15.", "SYSTEM: Ok the TR9595 leaves at 20:40, do you want a booking?", "USER: Yes, please book that train for 4 people.", "SYSTEM: Booking was successful, the total fee is 40.4 GBP payable at the station. Reference number is : M9UXW8S8 .", "USER: Wonderful. Thank you for your help today.", "SYSTEM: My pleasure. Enjoy your stay."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL1359.json": ["USER: Hi, I need a train that departs from bishops stortford and leaves on monday.", "SYSTEM: I have 10 trains available. What is your destination and preferred departure and arrival times?", "USER: My destination is cambridge and needs to arrive by 15:00.", "SYSTEM: I would recommend TR1827 which leaves Bishops Stortford at 13:29 and arrives in Cambridge by 1407.", "USER: What would the price range be for that?", "SYSTEM: The price is 10.10 pounds. Would you like me to book that train?", "USER: No but I need information on places to go in the centre of town.", "SYSTEM: We have a lot of things to do in the centre. Is there a particular type of attraction you're interested in?", "USER: Can you suggest something?", "SYSTEM: What about a museum? The regency gallery is amazing and it's free!", "USER: Sounds good. Can I get the phone number and postcode?", "SYSTEM: Sure the phone number is 01223365454 and the post code is cb11er. Is there anything else I can help you with today?", "USER: No, I think that this trip to Cambridge will make my wildest dreams come true. Thanks for helping me make it happen.", "SYSTEM: Wonderful! You're welcome, have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4399.json": ["USER: So I'm planning a trip to your lovely town and I need recommendations on an expensive place to eat on the West side.", "SYSTEM: There are a few choices. Do you have a cuisine preference?", "USER: I would like to try Indian food.", "SYSTEM: How about maharajah tandoori restaurant? They are located at 41518 Castle Street City Centre.", "USER: Get me the phone number and postcode please.", "SYSTEM: They are 01223358399 and cb30ah respectively. Do you need anything else?", "USER: Yes, I'm looking for a hotel called Hobson's House.", "SYSTEM: Hobson's House is a guesthouse in the west. It's moderately priced with free internet and parking. Would you like me to book it?", "USER: Yes please book for 7 people and 5 nights starting from wednesday. What is their address and phone number.", "SYSTEM: Yes the booking was successful and the reference number is 31L2HY44 .", "USER: Thank you goodbye", "SYSTEM: You are all booked at Hobsons House at 96 barton road. You're welcome."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR1", "turn": "9", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0702.json": ["USER: I am looking for a train that leaves on Saturday going to Cambridge.", "SYSTEM: Where are you departing from?", "USER: I am leaving Broxbourne and need to be in Cambridge by 10:30.", "SYSTEM: We have 4 such entries. Do you have a time you'd like to arrive by more specifically?", "USER: 10:30 is the time I want to arrive by. No later than that, please. I have prior obligations I need to meet.", "SYSTEM: I can book you on TR9384, leaving broxbourne at 8:32 and arriving in Cambridge at 9:32. How many people will you need tickets for?", "USER: Oh, that's all right. No need to reserve my ticket. But I do need the travel time, please.", "SYSTEM: Your travel time is 60 minutes. Is there anything else that I can do for you?", "USER: I'm also looking for a particular hotel - hobsons house. Can you help me with this?", "SYSTEM: Is there a particular room that you would be interested in staying? We currently have 1 guesthouse available.", "USER: What is the rate for that?", "SYSTEM: Unfortunately, I do not have that information, would you like the phone number for Hobsons House to check the rates?", "USER: No, I'm sure it's just fine. Could you book a stay for eight, starting that same day?", "SYSTEM: Are you wanting a stay for 8 days or 8 people?", "USER: 8 people for 5 nights please.", "SYSTEM: The reference number is THF8S490", "USER: Thank you for all of your help. That is all I need right now. Bye.", "SYSTEM: It was a pleasure assisting you. Have a wonderful day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E2", "user_correction": "C1", "user_reaction": "UR2", "turn": "5", "phrase": "10:30 is the time I want to arrive by. No later than that, please."}]}, {"MUL1491.json": ["USER: I need to take a train from cambridge, I need to arrive at my destination by 17:00/", "SYSTEM: Okay, what day did you have in mind?", "USER: I would like to leave on Saturday.", "SYSTEM: What station would you like to arrive at?", "USER: I need to get to Norwich please.", "SYSTEM: TR3823 will arrive at 16:55, would that work for you?", "USER: That cuts it a little close but it will do. I don't need it booked, though. Can you also find me a place to get some food?", "SYSTEM: I sure can! Do you have a specific area and type of food you are looking for?", "USER: I would like an indian restaurant in the centre, please.", "SYSTEM: I have many. is there a price range that you prefer?", "USER: Whichever ever one has 11:00 for two people on the same day available, that one would be fine.", "SYSTEM: I was able to book a table for 2 at Curry Garden on Saturday at 11:00. The reference number is 0ZBV3E4C . Is there anything else we can help you with?", "USER: No that will be all. Thanks for your help!", "SYSTEM: Have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL0109.json": ["USER: I'm looking for a restaurant called \"restaurant one seven\". Can you help me?", "SYSTEM: It is in the centre of town located at De Vere University Arms Regent Street City Centre", "USER: That is the one. Can you make a reservation for 6 on Friday please? 12:00 would be good.", "SYSTEM: I booked that for your for a party of 6 at noon on Friday. The reference number is : 6WSK0KXY . Is there anything else you need?", "USER: What is the price range of this restaurant?", "SYSTEM: it's a moderately priced restaurant.", "USER: I am also looking for a place to stay in the centre. It should be cheap.", "SYSTEM: Alexander Bed and Breakfast is a nice 4 star guesthouse. Can I book a room for you?", "USER: Do they have free wifi?", "SYSTEM: They do. Shall I book it?", "USER: Can you tell me if this a hotel or guesthouse and whether or not they have free parking please?", "SYSTEM: It is a guesthouse and they have parking. Would you like to book that?", "USER: Actually they will do but no need to book, I was just getting information.", "SYSTEM: Ok great, is there anything else I can do for you?", "USER: Is the parking free??", "SYSTEM: Yes. Parking at alexander bed and breakfast is free.", "USER: Okay, thank you for all the help.", "SYSTEM: anything else today?", "USER: that is it for today thanks for askin", "SYSTEM: Have a good afternoon. Bye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E4", "user_correction": "C1", "user_reaction": "UR1", "turn": "3", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL3558.json": ["USER: I am planning a trip in Cambridge", "SYSTEM: I can help book a train to get you here.", "USER: Ok I will book it for you", "SYSTEM: How can I help you today? Are you needing train information or is there something else I can do for you?", "USER: I need an expensive place to stay that's 2 stars.", "SYSTEM: I show two hotels in the north, 1 is expensive and 1 is moderate. I also show 1 expensive 2 star hotel in the east. Which area do you prefer?", "USER: Do any of them have free parking?", "SYSTEM: express by holiday inn cambridge has free parking. That looks to be the only option available.", "USER: Great, thanks! Which area is it in?", "SYSTEM: Its on the East side. Would you like me to book you a room there?", "USER: No, thanks. I just need to now the postcode.", "SYSTEM: Okay the postcode is cb13lh.", "USER: Thank you. I also need to book a train to Cambridge.", "SYSTEM: Where are you departing from and on what day?", "USER: i am departing from london liverpool street", "SYSTEM: On what day would you like to travel?", "USER: Saturday, please. I'm thinking just a short vacation over the weekend.", "SYSTEM: There are 5 trains on Saturday headed to Cambridge, what time are you wanting to leave?", "USER: What options do I have?", "SYSTEM: the first leaves at 5:39 and the latest leaves at 23:39", "USER: I need at a train that leaves after 12:30", "SYSTEM: Ok I have one leaving at 13:39. Shall I book it ?", "USER: Yes, Can you please book that thank you.", "SYSTEM: How many tickets will you need for the train?", "USER: I just need one ticket. Can you tell me what time it arrives?", "SYSTEM: Booking was successful, the total fee is 13.28 GBP payable at the station . Reference number is : LMZE8AMH .", "USER: Great. Thank you so much.", "SYSTEM: Your train departs London Liverpool Street Saturday at 13:39 and arrives in Cambridge at 15:07. Can I help connect you to anything else in our city today?", "USER: No. Thank you. That will be all for today. Goodbye", "SYSTEM: Thank you for using the Cambridge TownInfo centre. Goodbye"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR1", "turn": "25", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG02214.json": ["USER: I want to visit the museum of archaelogy and anthropology and need a taxi to take me", "SYSTEM: Sure! when would you like to arrive?", "USER: I need to arrive by 04:45.", "SYSTEM: Okay. Where are you departing from, please?", "USER: I am departing from The Missing Sock.", "SYSTEM: You are booked for a yellow Honda with the contact number 07575380490. Is there anything else?", "USER: No, that's everything. Thanks for your help.", "SYSTEM: Great! Have a nice day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4462.json": ["USER: Hello, I am looking for a restaurant in Cambridge. I believe it is called Golden Wok.", "SYSTEM: It is located at 191 Histon Road Chesterton", "USER: Can you book me a table for 11:00 on Friday?", "SYSTEM: Yes I can! Table for 1?", "USER: Actually, for 4, please.", "SYSTEM: Okay, your booking was successful! The reference number is MUFCMYFF . The table will be reserved for 15 minutes.", "USER: Great, can you also get me information or architecture in the area", "SYSTEM: Sure. There are several churches and an old schools attraction, all in the centre area. Do you have a preference?", "USER: What do you recommend?", "SYSTEM: old schools is lovely, they are on trinity lane and free admission", "USER: Can I get the postcode for that? I also need to book a taxi to the Golden Wok.", "SYSTEM: The postcode is cb21tt. Are you looking for a taxi from Old Schools to the Golden Wok?", "USER: Yes I do. I'd like to make sure I arrive at the restaurant by the booked time. Can you check?", "SYSTEM: What time do you want to leave?", "USER: Actually all you have to do is set the taxi so it arrives by the arrived time. Am I better off booking it myself?", "SYSTEM: I have booked you a taxi for Friday to arrive at Old Schools at 10:45. Is there anything else I may help you with?", "USER: I need the contact number and car type also.", "SYSTEM: it is a Lexus white in colour and contact number is 07381884388", "USER: Thanks for the service, good day.", "SYSTEM: You're welcome! Have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E3", "user_correction": "C1", "user_reaction": "UR2", "turn": "14", "phrase": ""}, {"error_type": "E3", "user_correction": "C1", "user_reaction": "UR2", "turn": "15", "phrase": "Actually all you have to do is set the taxi so it arrives by the arrived time."}]}, {"SNG01710.json": ["USER: I am trying to find a hotel called warkworth house", "SYSTEM: Call them at 01223363682", "USER: book it for 3 people and 5 nights starting from thursday.", "SYSTEM: Your booking was unsuccessful. Could you book another day or a shorter stay?", "USER: Let's try for Friday instead. And I need the reference number please.", "SYSTEM: Your booking was successful and your Reference number is : 0DW45IKS", "USER: Great, that's settled. Thank you for the assistance. Goodbye.", "SYSTEM: welcome back next time"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0691.json": ["USER: I'm looking for someplace to stay. I'd like something expensive, and I don't need parking.", "SYSTEM: I'm not showing anything in the expensive range without parking. There are five expensive hotels with parking. What area would you like to stay in?", "USER: The area doesn't really matter. But I would want a hotel that includes wifi for free.", "SYSTEM: How about the huntingdon marriott hotel, it is in the west in the expensive price range. It also has internet. Would you like to book?", "USER: Yes please I would like for you to book me a room at the huntingdon marriott hotel.", "SYSTEM: Which dates will you need the room?", "USER: I will need it for four nights for 5 people starting Wednesday.", "SYSTEM: Booking was successful at huntingdon marriott hotel starting Wednesday. Your feference number is : 5NVYGFM1 . Is there any further assistance needed?", "USER: Yes. I am also looking for a train departing cambridge and arrives by 10:45.", "SYSTEM: Where are you traveling to?", "USER: No where in particular", "SYSTEM: Ok, and what day would you want to leave?", "USER: Actually, I want to go to Birmingham New Street on Sunday, please.", "SYSTEM: I have two trains to birmingham new street. Would you like to arrive at 9:44 or 10:44?", "USER: I would like the one that arrives at 10:44 please. I will need 5 tickets.", "SYSTEM: I have successfully created a booking for 5 tickets! Your reference number is 080D4W62 . The fee is 300.39 GBP. Is there anything else I can assist you with today?", "USER: That's it! Thank you so much for your help!", "SYSTEM: You are all set. Thank you!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E10", "user_correction": "C1", "user_reaction": "UR1", "turn": "2", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG0893.json": ["USER: I'm looking for an expensive hotel in the south to stay in.", "SYSTEM: I have one hotel that meets that criteria. It has 3 stars and offers free wifi and parking. This would be the Lensfield Hotel. Can I book you a room?", "USER: Yes, please book me a room.", "SYSTEM: When will you be arriving and how many nights would you like to stay? How many people are in your party?", "USER: Can you book the hotel for 4 people, 3 nights on Thursday?", "SYSTEM: your booking was successful. your reference number is JCVMJBRZ .", "USER: Thanks for your help. That's all I needed.", "SYSTEM: Wonderful. Have a great day. Bye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL3662.json": ["USER: could you give me information about kings hedges learner pool.", "SYSTEM: Sure, it is a swimming pool located in the north. Want more information?", "USER: Yes, please. I need the postcode.", "SYSTEM: Sure, the postcode is CB42XH.", "USER: Thanks. Can you tell me a little bit about a restaurant called the Good Luck Chinese Food Takeaway?", "SYSTEM: The good luck chinese food takeaway is an expensive chinese restaurant located in the south area. I could make reservations if you would like?", "USER: Yes, please. I'd like a reservation for 2 at 18:00 on Friday.", "SYSTEM: Okay, the booking was successful. The table will be reserved for 15 minutes. Your reference number is : JBWY3KBQ .", "USER: thanks! that's all i need", "SYSTEM: Thanks for using our service!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL2199.json": ["USER: I need information for a train from cambridge to norwich.", "SYSTEM: There are several trains departing from Cambridge arriving in Norwich at a price of 17.60 pounds. What day are you looking to travel?", "USER: I am looking to travel on Sunday, and leave after 21:30", "SYSTEM: I have train TR7767 leaving at 21:36 and arriving by 22:55. Would that be something that would work for you?", "USER: Yes please book for 1 person and send the reference number.", "SYSTEM: Okay, I've done that for you. Your reference number is 0TDRHZKN .", "USER: Thank you. I also need a place to stay. Can you find me a three star guesthouse?", "SYSTEM: Sure, what area of town are you interested in?", "USER: In the centre I guess. I do need free parking.", "SYSTEM: I'm sorry, there aren't any 3 star guesthouses in the centre, would you like to try another level?", "USER: No, can you check for a 3 star guesthouse in the west?", "SYSTEM: Yes, there is the hobsons house. Shall I go ahead and book that for you?", "USER: Yes please. It will be for the same group of people for 3 nights starting on thursday.", "SYSTEM: Okay, your booking was successful. Your reference number is 9CNY4IOQ .", "USER: Thank you. Are there any colleges with free admission in the area? Or any other attractions that I may visit inbetween my meetings?", "SYSTEM: What area would you prefer it to be in?", "USER: Somewhere in the center that gives free parking. It's pretty important as that's where I'm interested in. If that does not exist, I'd like to be somewhere in the west.", "SYSTEM: I'm sorry, the attractions segment on my computer system seems to be down at the moment. Can I perhaps help with something else?", "USER: That is alright. Actually, that should be all I need today. Thank you for your help. Goodbye.", "SYSTEM: I hope you enjoy your stay. Have a nice day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4343.json": ["USER: Can you get me information on a restaurant called mahal of cambridge?", "SYSTEM: Sure it is a cheap Indian restaurant in the town centre. I hear it has great food.", "USER: Do you think they would be able to make reservations for a party of 7?", "SYSTEM: I can help you with that. When would you like to make the reservation for?", "USER: 17:45 for a table of 7 for the restaurant stated above. Thank you!", "SYSTEM: What day would you like that reservation for?", "USER: Oh, Tuesday please. And if you could give me a reference number, that'd be great.", "SYSTEM: I have successfully booked your table! Your reference number is WOQ10J3G . Anything else I can help you with today?", "USER: I would also like the address of a museum in the centre of town", "SYSTEM: Primavera is a museum in the center of town. Their address is 10 king s parade. What else can I help with?", "USER: Oh, I made a mistake. I really need that table for 16:15, not 17:45. Can you change it, do you thing?", "SYSTEM: Yes, I already changed it for you. Your new reference number is BTMSNGCD .", "USER: Thank you for making that change. Can you recommend a museum in the centre?", "SYSTEM: We have 11 museums in the Centre, my personal favorite is the Castle Galleries at Unit su43, Grande arcade, Saint Andrews street. There is no entrance fee there.", "USER: That sounds great. I will plan to stop at that museum.", "SYSTEM: Great! Have a great time. Is there anything else you need?", "USER: No that is it. Thank you.", "SYSTEM: You are welcome. Enjoy your time in Cambridge. Goodbye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL1352.json": ["USER: I'm looking for a train to Cambridge, please.", "SYSTEM: Sure, where are you departing from?", "USER: I am departing from ely and want to leave on saturday. It should arrive by 20:45.", "SYSTEM: The earliest leaves out of Ely at 05:35 and arrives in Cambridge at 05:52. Would you like to reserve a seat, or do you prefer to check for a later time?", "USER: A later time, definitely. Don't want to kick around town that long.", "SYSTEM: The last train of the day, TR4288, will arrive in Cambridge at 19:52. Would that fit your schedule better?", "USER: Yes please book that for 4 people and provide the reference number please.", "SYSTEM: No problem. Your reference number is JB5YODGE . Is there something else I can help you with?", "USER: Yes, can you recommend a place to go in town, maybe a museum?", "SYSTEM: I found 23 museums all across town. Is there a particular area you're interested in so I can narrow down the search?", "USER: Yes, I'd like to stay in the centre of town.", "SYSTEM: Okay, there are 11 different options. I recommend Castle Galleries. Would you like information on this museum?", "USER: Yes, can i just have the address?", "SYSTEM: it is in unit su43, grande arcade, saint andrews street.", "USER: Thanks, that's all I needed!", "SYSTEM: You're welcome, have a great day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL1318.json": ["USER: I need some help booking a train to stansted airport.", "SYSTEM: What day and time will you be traveling on?", "USER: I will be leaving on a wednesday and want to arrive by 16:15", "SYSTEM: I have many trains available. What is your departure site and preferred time of arrival?", "USER: I would like to leave Stansted Airport to go to Cambridge and arrive by 16:15.", "SYSTEM: I have train TR2488 that leaves at 15:24 and arrives in Cambridge at 15:52. Would that work for you?", "USER: Yes please make a booking for 8 people.", "SYSTEM: Booking was successful, the total fee is 80.8 GBP payable at the station . Your reference number is M2771E7T . Do you need anything else?", "USER: Yes, can you tell me the entrance fee for the Cambridge Museum of Technology?", "SYSTEM: the entrance fee is 5 pounds"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E2", "user_correction": "C1", "user_reaction": "UR2", "turn": "4", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0341.json": ["USER: Are there any Modern European restaurants in the centre?", "SYSTEM: There are 4 available. Do you want to specify a price range?", "USER: Yes, I would like something in the expensive price range, please.", "SYSTEM: Darrys cookhouse and wine shop is the only expensive modern european restaurant. Do you want me to book it for you?", "USER: That would be great. Could you book me a table for 4 on monday at 19:45?", "SYSTEM: Your reservation is set, your reference number is EOMCTSEA", "USER: Great, thank you. Can you also help me find a train departing from bishops stortford for the same day?", "SYSTEM: Sure thing! Is there a particular time you'd like to leave or arrive by?", "USER: I would like to arrive in Cambridge by 15:00, please.", "SYSTEM: Okay, there are 5 trains arriving before 15:00, did you have a departure time in mind?", "USER: I think I'll go with whichever one is latest. Can I have the price and departure time for that train, please?", "SYSTEM: Sure, the train arriving at 14:07 will depart bishops stortford at 13:29. Total travel time is 38 minutes.", "USER: Okay thanks can you please give me the price?", "SYSTEM: The fare is 10.10 GBP. Can I be of any further assistance today?", "USER: That will be all. Thanks!", "SYSTEM: Thank you for choosing us. Goodbye!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR2", "turn": "11", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL3946.json": ["USER: I want to find a train leaving Cambridge and going to Bishops Stortford. Can you help me?", "SYSTEM: Yes I can what time are you wanting to leave by?", "USER: We need it to leave after 17:00 on Sunday.", "SYSTEM: I have train TR6742 that leaves at 17:29 and will have you in Bishops Stortford by 18:07. Will that work for you?", "USER: Yes could you book one ticket for me and give me the reference number?", "SYSTEM: Reference number is : BVD5QP16 . Is there anything else?", "USER: Perfect, thanks! Yes, actually there is one more thing. Please get me information on the huntingdon marriott hotel", "SYSTEM: It is located in the west,is expensive and has 4 stars.", "USER: Can you tell me if they have free parking?", "SYSTEM: they do have free parking.", "USER: I think that is all I need. Thank you.", "SYSTEM: You're very welcome! Have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL2064.json": ["USER: I need a room in cambridge please", "SYSTEM: Okay, do you have an area or price range you're looking for?", "USER: expensive guesthouse. it should have free parking and wifi", "SYSTEM: Unfortunately there are not guesthouses that meet your criteria. Would you like to look for something in the moderate price range or a hotel instead?", "USER: How about any guesthouses available?", "SYSTEM: I do not have any expensive guesthouses with wifi and parking. I do have some moderate or cheap ones.", "USER: Hmm, well how about checking for a hotel instead that is expensive with free parking and wifi?", "SYSTEM: I didn't find any that matched that criteria.", "USER: How about a hotel?", "SYSTEM: I have a few hotels that meet your needs. How about the Gonville Hotel? It is in the centre of town.", "USER: Yes that sounds like a good fit for me. Please book it for me.", "SYSTEM: I have booked you at the gonville hotel for 1 night however we will need to know for how long and how many people. Thank you.", "USER: It's just one night for 4 people.", "SYSTEM: And what night will you be staying at the hotel, please?", "USER: Actually, come to think of it I will go ahead and book the room later. Can you help me find a train going to Broxbourne?", "SYSTEM: Of course. What day will you be travelling?", "USER: I would prefer to leave around 9:30 on Monday morning.", "SYSTEM: We have 14 trains leaving around 09:30 on Monday to Broxbourne. Was there a certain time you wanted to arrive by?", "USER: I need a train for 4 people to broxbourne, arriving by 3 pm", "SYSTEM: The TR1319 fits your criteria. Would you like me to book passage for you on this train?", "USER: I will need it for four people.", "SYSTEM: Booking was successful, the total fee is 71.59 GBP payable at the station . Reference number is : UYNXZ4W5 . Do you need anything else?", "USER: No. That will be all I need. Thanks. Take care. Bye.", "SYSTEM: Okay, great! I'm so glad I could help you. Have a wonderful visit!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E2", "user_correction": "C1", "user_reaction": "UR1", "turn": "7", "phrase": "Hmm, well how about checking for a hotel instead"}]}, {"MUL2063.json": ["USER: Hello I'm looking for a cheap hotel that includes wifi.", "SYSTEM: I actually have just one located in the west that is cheap. It is the Cambridge Belfry. They are 4-star rated and offer free parking and wifi. Can I book you?", "USER: Great. I just needed to know one would be available if I decide to make the trip. You've been a great help. Thanks. Bye.", "SYSTEM: Thank you for contacting Cambridge TownInfo centre. I hope you have a pleasant trip! Goodbye!", "USER: Hold on, let me go ahead and book the hotel for 7 people starting on Tuesday for 5 nights. Please send me the reference number once reservation is made.", "SYSTEM: I have reserved the Cambridge Belfry for 7 people for 5 nights beginning Tuesday. Your reference number is G29ZSC5D . Can I help with anything else?", "USER: I would also like to see if I could catch a train from leicester to cambridge.", "SYSTEM: I show 133 possible trains. What day were you looking for?", "USER: I want to arrive Tuesday by 19:00, is that possible.", "SYSTEM: Train TR5297 looks like a good fit. Would you like me to book it for you?", "USER: No thank you. Could you give me it's departure time?", "SYSTEM: 05:09 is its departure time. Could I help you with anything else?", "USER: That is all for now. Thanks", "SYSTEM: Just in case you want to arrive closer to 19:00, TR3370 leaves Leicester at 17:09 and arrives in Cambridge by 18:54. Please let me know if you need anything else.", "USER: I sure will, thanks again!", "SYSTEM: No problem. Have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E5", "user_correction": "C1", "user_reaction": "UR3", "turn": "9", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4326.json": ["USER: I can't wait to see some of the local attractions when I get there. I'm looking for some places to go in town.", "SYSTEM: What types of attractions are you interested in? We have everything from art galleries to zoos!", "USER: Hello. I'm excited to visit Cambridge. Can you give me addresses and phone numbers of different types of attractions in the centre of town?", "SYSTEM: What type of attractions are you looking for?", "USER: Well, something in the center... can you recommend anything?", "SYSTEM: there are lots of architecture in the centre of town how may I be of assistance?", "USER: Something you think is the best. Please give me some info on your favorite place.", "SYSTEM: Old Schools is nice. Would you like more info on it?", "USER: Where is that located?", "SYSTEM: It is in the centre of town.", "USER: Can I have the address and phone number, please?", "SYSTEM: It is located on Trinity Lane and the phone number is 01223332320. The exact address isn't listed. Is there anything else I can help with today?", "USER: Yes, I also need a place to stay in the same area as the attraction with free parking. It should be cheaply priced and 0 stars.", "SYSTEM: Well the el shaddai fits your needs. It isn't the best guesthouse in town but it will get the job done. Would you like to book it?", "USER: No, i dont need it booked. But i do need to know if it has free internet, the phone number, and the post code.", "SYSTEM: Yes it is free internet, the phone number is 01223327978, and the postcode is cb11eg. Is their anything else I can help you with?", "USER: Yes, I'll need to book a taxi to commute between Old Schools and the hotel. I'd like to leave be picked up at Old Schools by 8:15.", "SYSTEM: Ok. A blue skoda will pick you up at 08:15. The contact number is 07568386559.", "USER: You were a great help! Thank you.", "SYSTEM: You're welcome! Can I help you with anything else?", "USER: No that is it for now. Bye.", "SYSTEM: I hope your trip is fun. Good day.", "USER: thanks again for helping", "SYSTEM: Thank you for letting me help you today."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR2", "turn": "5", "phrase": "Well, something in the center..."}]}, {"MUL0821.json": ["USER: I'm looking for a restaurant in the city centre.", "SYSTEM: There are 69 results for restaurants in city centre. Could you be more specific on what type of food you're hungry for, or price range you'd like?", "USER: I would like a restaurant that serves British food.", "SYSTEM: There are 7 British restaurants in the centre. Do you have a preferred price range?", "USER: No I do not, can you please find me the highest rated restaurant?", "SYSTEM: I do not have access to restaurant ratings, however three of the restaurants serving British food are considered expensive. Would you like their information?", "USER: Just one please, and only the address is necessary. I'd also like a place to go in town, a museum is good, it should be in the centre", "SYSTEM: The address for Fitzbillies is 51 Trumpington Street City Centre.", "USER: Okay, thanks. And a museum?", "SYSTEM: there are approximately 11 museums in the centre of town, all with free entrance. My personal recommendation would be the Whipple Museum of the History of Science.", "USER: Sounds good. What's the address and phone number of the Whipple?", "SYSTEM: It is located at free school lane and their phone number is 01223330906", "USER: Alright, great. I also need a taxi to get between the restaurant and the museum. I want to leave the restaurant by 23:45.", "SYSTEM: I was able to arrange your taxi service. Your vehicle will be a Black BMW, and the company's contact number is 07015861608. Anything else I can help with?", "USER: No that will be all, thank you.", "SYSTEM: We are happy to help. Thank you for using our service."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR2", "turn": "8", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG0368.json": ["USER: I'd like a train to Cambridge that arrives by 19:30.", "SYSTEM: Where are you departing from?", "USER: I'm departing from Ely.", "SYSTEM: Do you have a day you would like to travel?", "USER: Yes, Wednesday. I also need the departure time and price, please.", "SYSTEM: The latest train arrives at 17:52 on a Wednesday, departs at 17:35 and the cost of the ticket is 4.40 pounds.", "USER: Okay that is all I need to know for now.", "SYSTEM: Okay. Let us know if we can be of further assistance."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL1613.json": ["USER: I need the schedule of the the Train going to Ely on Tuesday.", "SYSTEM: What time do you need to leave?", "USER: My leave time is flexible. I just need to arrive by 14:30.", "SYSTEM: Where will you be departing from?", "USER: I will be departing from Cambridge.", "SYSTEM: Train TR3420 leaves at 13:50 and gets to Ely at 14:07, 17 minute trip. Do you need tickets?", "USER: Yes, I do need tickets.", "SYSTEM: How many tickets do you need?", "USER: Well, I can do the booking myself. Can you help me find a hotel instead?", "SYSTEM: Absolutely! What area would you like to stay in and what is your price range?", "USER: It doesn't matter as long as it is 3 stars. It doesn't need to include internet.", "SYSTEM: alpha-milton guest house is 3 stars and does not have internet.", "USER: Could I please book it for 5 people for 3 nights starting from Saturday?", "SYSTEM: Your booking was successful and your reference number is WKLNVDKN", "USER: Great, that is all I need. Thank you for your help.", "SYSTEM: enjoy your stay in Cambridge!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL2282.json": ["USER: Hello! I am looking for a place to stay. I would like to stay in the moderate price range with a rating of 2 stars, if possible.", "SYSTEM: I have two options that are in the north area. How many people would you like to reserve a room for?", "USER: I don't know for sure yet. Does either include free wifi and parking?", "SYSTEM: They both have free internet and parking and are both in the moderate price range.", "USER: Okay, I need to book one of them for 1 person starting Tuesday for 2 nights. Please send me the reference number once the reservation is booked.", "SYSTEM: I made you a reservation at the ashley hotel your reference number is NC5XPXND .", "USER: Thank you. Also, I'm looking to book a train from Cambridge to Norwich? Can you help me with that?", "SYSTEM: What is your departure day and time?", "USER: I am leaving on Thursday and need to arrive in norwich by 16:15.", "SYSTEM: Train TR5190 leaves Cambridge at 14:36 and arrives in Norwich at 15:55. Would you like me to book it for you?", "USER: No thank you. Can you confirm the travel time for that commute?", "SYSTEM: Absolutely. The total travel time is 79 minutes. Is there anything else I can help you with?", "USER: What is the departure time?", "SYSTEM: The departure time is 14:36 from Cambridge.", "USER: Thanks. That is all I need for now. Goodbye.", "SYSTEM: Your welcome. Have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG02133.json": ["USER: Can you find me a taxi to jesus green outdoor pool? I need to be there by 02:15.", "SYSTEM: You are booked. Your car is a black BMW and contact number is 07771693374", "USER: Ok Thanks that's all I need!", "SYSTEM: One more question. Where do you need to be picked up from?", "USER: I need to be up from Williams Art and Antiques.", "SYSTEM: A black volkswagen will be picking you up. Their contact number is 07117431009.", "USER: Great, thanks for your help.", "SYSTEM: You're welcome! Is there anything else I can help you with?", "USER: That's all actually. Thanks and bye!", "SYSTEM: You're very welcome. Goodbye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4492.json": ["USER: Find me a train from Cambridge that arrives by 20:30", "SYSTEM: Sure, where are you traveling to, and which day?", "USER: I need to leave on sunday and I am headed to london liverpool street.", "SYSTEM: I have TR7713 that arrives by 19:27. Does that work for you?", "USER: Yes, can you book it for 3 people please?", "SYSTEM: Booking was successful, the total fee is 39.83 GBP payable at the station . Reference number is : XG11A6BS . Can I help you with anything else today?", "USER: Yes, I need a place to eat. I want to try some british food, prefer the west side of town.", "SYSTEM: I would suggest this place travellers rest.", "USER: Can i have the address, phone number, and postcode, please?", "SYSTEM: They are at Huntingdon Road City Centre, postcide cb30df, phone is 01223276182, can I assist with anything else?", "USER: Nope. That is all I needed! Thanks.", "SYSTEM: My pleasure, have a wonderful trip."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL2507.json": ["USER: Yes, can you provide me with information on the attraction Gallery at Twelve and High Street?", "SYSTEM: I sure can. They are a museum located in the eat. They offer free admission. They are located at Fulbourn, postcode cb15dh. Their phone number is 01223295264. Is there anything else?", "USER: can you tell me how much the entrance fee is?", "SYSTEM: There is no entrance fee. It is free admission into the museum. Can I help you with anything else today? Maybe a taxi to the museum?", "USER: No, but I am looking for a place to stay that is cheap.", "SYSTEM: I can recommend three guesthouses, all four star, in the east. May I book a room for you and your family?", "USER: I need something that includes free wifi as well.", "SYSTEM: I'd like to suggest allenbell. Is there anything else I could help you with?", "USER: What is their star rating? And do they offer free wifi?", "SYSTEM: They have a star rating of 4 and they do offer free wifi. Would you like me to book that for you?", "USER: No, but could I get the address and phone number, please?", "SYSTEM: 01223210353 is the phone number. The address is 517a coldham lane. Is there anything else I could help you with?", "USER: No, thank you.That is all for now.", "SYSTEM: You're welcome, have a good day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E4", "user_correction": "C1", "user_reaction": "UR1", "turn": "1", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL2486.json": ["USER: I'm looking for a boat to go to in town.", "SYSTEM: Boating is so relaxing. We have 4 different boating venues in town. Did you have a preference on the area you would like?", "USER: No, your recommendation will suffice.", "SYSTEM: I would recommend riverboat georgina in the north area. They are located at cambridge passenger cruisers, jubilee house and can be reached at 01223902091", "USER: Thank you , I am also looking for a restaurant that serves indian in the centre area.", "SYSTEM: there is the curry garden located at 106 Regent Street City Centre. Will that work for you?", "USER: Yes, I need it for Saturday at 14:45, for three.", "SYSTEM: Sorry, the restaurant is all booked for that time. Would you like to try a different time?", "USER: Can you please check for 13:45?", "SYSTEM: I have you booked at 13:45 on Saturday. Your reference number is RERXDPMF . Can I help you with anything else?", "USER: Nope! That should do it, thanks!", "SYSTEM: Enjoy your meal!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0082.json": ["USER: Hello, I looking for a restaurant called Golden House", "SYSTEM: The Golden House is a Chinese restaurant at 12 Lensfield Road City Centre. Would you like their phone number?", "USER: I would like to know the food type and price range of the restaurant please.", "SYSTEM: The golden house serves Chinese cuisine and the price range is cheap. Would you like me to place a reservation for you?", "USER: Please let me think about it, in the meantime, can you tell me what guesthouses include free parking?", "SYSTEM: There are 21 guesthouses that include free parking, did you have an area or price range in mind?", "USER: Yes. I would like it to be in the moderate price range. Also, I'd prefer free wifi.", "SYSTEM: I have 12 guesthouses that are moderately priced and include free wifi. Is there an area that you prefer to stay in?", "USER: No, any one of them will do. Please choose one for me and book a room for 8 people for 5 nights for Tuesday. Thanks.", "SYSTEM: OK, you're booked at the acorn guest house, 82 arbury road, for 5 nights starting Tuesday. Your reference number is F2CK0QDQ . Is there anything else?", "USER: No, that is all. Thank you very much.", "SYSTEM: Thank you for using our service. Have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG0993.json": ["USER: I'm looking for a cheap place to stay with free wifi.", "SYSTEM: We have 10 possibilities for you. Do you have any additional preferences?", "USER: Yes, I am looking for a hotel with a 2 star rating.", "SYSTEM: I don't have anything with two stars, free wifi, and in the cheap range. Would you like to try a different number of stars?", "USER: Let's try something in the moderate price range with two stars and free wifi please.", "SYSTEM: I have two options in the moderate price range. The Ashley House and Lovell Lodge. Would you like to try one of these?", "USER: Lets try the Ashley House please.", "SYSTEM: When will your stay be?", "USER: We'll arrive on Wednesday and stay 3 nights. There will be 2 of us.", "SYSTEM: I've made your reservation, and the reference number is 5NA21JWO . What else can I help you with?", "USER: That is all I need for now. Thank you for finding the hotel.", "SYSTEM: You're very welcome. Thanks for contacting the Cambridge TownInfo Centre. I hope you have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL0690.json": ["USER: Do you have any recommendations for restaurants in Cambridge?", "SYSTEM: There are 110 restaurants in Cambridge, is there a specific cuisine you're looking for?", "USER: I'm sorry, it is actually a train that I'm looking for. I need to depart from Cambridge on Saturday.", "SYSTEM: Well can you tell me yur destination please?", "USER: I need to go to leicester and leave from cambridge after 18:00. There are 8 of us, can you make a reservation and send me the reference number?", "SYSTEM: I booked you on the TR6034 that leaves Cambridge at 18:21 and arrives at 20:06. Your reference is NYXZ1SOR and the total fee of 241.92 is payable at the station", "USER: Perfect. I am also looking for a moderate priced restaurant in the east", "SYSTEM: There are two indian restaurants and one italian. Do either of these interest you?", "USER: I am interested in Italian.", "SYSTEM: the pizza hut fen ditton is located at Cambridge retail park newmarket road. Would you like me to book a reservation?", "USER: yeah i need a table for eight", "SYSTEM: What day and time would you like to eat at the pizza hut fen ditton?", "USER: Can you book it for me and get a reference number ?", "SYSTEM: What particular time would you like me to make your reservations for?", "USER: Please make the reservation for 8 people at 11:30 on Saturday please.", "SYSTEM: You are all set. Your reference number is FA6IDT91 .", "USER: thanks for your help today!", "SYSTEM: You are most certainly welcome. I hope you have an excellent day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG0715.json": ["USER: Is there an expensive African restaurant in town.", "SYSTEM: Yes, The Bedouin in the city centre is a good, expensive restaurant.", "USER: Excellent! I don't need a table right now, but if you could give me the address and phone number, that would be great.", "SYSTEM: It is located at 100 Mill Road City Centre and the phone number is 01223367660. Is there anything else I can help you with?", "USER: No thanks. That would be all for today. Have a nice day.", "SYSTEM: You're welcome, goodbye"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL3926.json": ["USER: Can you help me with train schedules?", "SYSTEM: I certainly can. What did you have in mind?", "USER: I am looking for trains that depart from cambridge and go to broxbourne.", "SYSTEM: We've got several trains going that route. Is there a particular day or time you need?", "USER: I need to go on Friday.", "SYSTEM: What time will you be departing from cambridge? Also what time do you need to arrive in broxbourne by?", "USER: I just need to arrive by 18:30, the departure time doesn't matter.", "SYSTEM: I have several that arrive before 18:30. I have one that arrives at 16:01, 17:01, and 18:01. They all leave an hour before arrival time and are 17.90 pounds.", "USER: Can you book the train that will arrive at 18:01 and I need 4 tickets.", "SYSTEM: Your booking was successful and the total fee is 71.59 GBP, which is payable at the station. Your reference number is D3L643YZ .", "USER: Thanks. I also need a guesthouse to stay in in the north.", "SYSTEM: How about the acorn guest house?", "USER: Does it offer free wifi? I'd also like it to have 4 stars.", "SYSTEM: Yes, it fits all those needs.", "USER: Great. Please book it for 2 nights starting on Wednesday.", "SYSTEM: How many people will be staying?", "USER: There will be a party of four.", "SYSTEM: Booking was successful. Reference number is : 8P7QUDHW .", "USER: thanks for helping.", "SYSTEM: You're welcome! Can I help you with anything else?", "USER: No that was all thank you so much.", "SYSTEM: excellent, have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0039.json": ["USER: Is there any hotel in the area with 4 stars and I can get for cheap price.", "SYSTEM: I found the Cambridge Belfry, a 4 star cheap hotel. Would you like to book?", "USER: I would just like to know first if this place includes free parking?", "SYSTEM: Yes it does include free parking.", "USER: OK, can I have their phone number? Oh, and they have free wifi, right?", "SYSTEM: Yes, they do offer free WiFi. The number is 01954714600", "USER: I'm also looking for a restaurant in the east that serves Indian food.", "SYSTEM: There are four restaurants that match your search. What price range would you like?", "USER: The price range doesn't matter. Can you give me a few names to choose from?", "SYSTEM: The choices are Curry Prince, Pipasha Restaurant, Rajmahal, and Sitar Tandoori. Would you like to book a table at one of these?", "USER: I don't need a table, but can I get the address, postcode and price range for Curry Prince?", "SYSTEM: Yes sure. The Curry Prince's telephone number is 01223566388. And their address and postcode are 451 Newmarket Road Fen Ditton cb58jj.", "USER: What is the price range for The Curry Prince?", "SYSTEM: The price range is moderate.", "USER: Thanks! Now, can I get a taxi from the Cambridge Belfry to the Curry Prince? I need to leave the hotel by 4:00.", "SYSTEM: I was able to book that taxi for you. You will be riding in a Blue Audi. Their number is 07768403851. Can I help you with something else?", "USER: That was everything I needed, Thanks for everything and please take care!", "SYSTEM: Happy to be of service, and thanks for using the Cambridge TownInfo centre. Have a wonderful day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR2", "turn": "12", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL1140.json": ["USER: I need a train going to london liverpool street.", "SYSTEM: Ok. And where will you be departing from?", "USER: I will be departing from Cambridge on Saturday.", "SYSTEM: What time would you like to leave?", "USER: I don't have a departure time but I want to arrive by 16:45.", "SYSTEM: How about TR2895? It leaves at 05:59.", "USER: That sounds great. Can you book 3 tickets for that train?", "SYSTEM: Your booking is complete. Your reference number is H5MDQ0XR .", "USER: looking for places to go in cetre part of town a type of concerthall and I need the adress", "SYSTEM: The Man on the Moon 2 Norfolk Street, cb12lf. Will there be anything else today?"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL3437.json": ["USER: i am looking for a place to stay. The hotel should include free wifi and should include free parking.", "SYSTEM: What about acorn house? It seems lovely", "USER: I need something cheap and in the centre of town.", "SYSTEM: In that case, you have two selections. The Alexander Bed and Breakfast is one. The other is El Shaddai. Were you looking for a particular star rating?", "USER: Could you book me a room at The Alexander Bed and Breakfast for 6 people and 2 nights starting from friday?", "SYSTEM: Yes, I just did. Would you like their phone number?", "USER: Can you please give me the confirmation number for my booking?", "SYSTEM: Your reservation has been made for Alexander Bed and Breakfast for 2 days starting Friday for 6 people Your reference number is 9ZK2B30Y . Is there anything else I can do?", "USER: I need the phone number for a museum as well. Any one will do.", "SYSTEM: broughton house gallery is also located in the centre of town. Their phone number is 01223314960. Is there anything else I can assist you with today?", "USER: Hmmm I'm not sure. I think that might be everything but let me think for a second.", "SYSTEM: Did you come up with anything?", "USER: i need to book a taxi to commute between the two places.", "SYSTEM: I have booked you a taxi leaving at 13:00. It will be a blue volvo and the contact number is 07695646111.", "USER: thanks so much for all of your help you have been great", "SYSTEM: You are welcome, glad to be of assistance. Enjoy your time in Cambridge. Bye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4439.json": ["USER: I would like to dine in an expensive Chinese restaurant tonight", "SYSTEM: I have several options for you. The yu garden is in the east area, I can book a reservation for you, how many people will be dining?", "USER: I don't know. I also want to know about an attraction called Churchill College.", "SYSTEM: Churchill College is in the west and it's free to enter. Did you need any specific information about this college?", "USER: I need the phone number please?", "SYSTEM: The phone number is 01223336233.", "USER: Thanks so much. Now, I guess I will need to find a cheap place to eat in the centre.", "SYSTEM: There are a number of inexpensive options in that area. I can give you some information if you let me know what type of food you'd like.", "USER: I would like asian oriental food.", "SYSTEM: I would recommend the Dojo Noodle Bar, located at 40210 Millers Yard City Centre.", "USER: That sounds great! Can I get a reservation for 8 people at 17:00 on Monday? I'll need a reference number to give everyone too.", "SYSTEM: Your booking was successful. Your reference number is PD3WTNI4 . Is there anything else I can do for you?", "USER: I'm good, you did great. Thank you!", "SYSTEM: Well thank you. It has been a pleasure to assist you today. Have a wonderful day. Goodbye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL2686.json": ["USER: Hi! Can you help me find some places to go on the south side of the city? I'm super bored!", "SYSTEM: I am happy to help. There are several types of places to go in the South. Parks, theatre, cinema, museum, nightclub. What sounds good to you?", "USER: I don't have a preference. Could you make a recommendation?", "SYSTEM: How about a nightclub or cinema? There's also a great museum.", "USER: Anything is fine whatever is most popular.", "SYSTEM: Sure, Cineworld Cinema will be great. What information do you need about this attraction?", "USER: Can I get the address, entrance fee and attraction type please?", "SYSTEM: The address is cambridge leisure park, clifton way. It is a cinema. I do not know the entrance fee, unfortunately.", "USER: I am also wanting some information on a hotel called the Kirkwood House. Can you tell me about them?", "SYSTEM: That is a guesthouse found in the North. It is in the moderate price range and is rated four stars. Do you need their contact details?", "USER: I need a booking there for five people staying three nights from Monday.", "SYSTEM: Excellent. You are all booked. Reference number is J0VGU1UX . Can I help with anything else?", "USER: Yes. I need a taxi to commute between the two places. I'd like to leave the park by 01:15.", "SYSTEM: You are booked with a taxi going from cineworld cinema to kirkwood house w/yellow skoda . Your contact number is 07191555645. Would you need anything else?", "USER: That should be all! Thank you for your help! Good bye.", "SYSTEM: Please call again. Goodbye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0287.json": ["USER: Hi, I am searching for a nice Thai restaurant in Cambridge Centre", "SYSTEM: The only Thai restaurant located in Centre Cambridge is Bangkok City. Would you like the address?", "USER: Yes please. Get me their phone number and postcode too.", "SYSTEM: Bangkok City's address is 24 Green Street City Centre, postcode cb23jx, phone number 01223354382. Can I help you with anything else?", "USER: Yes. I need to book a train for tuesday.", "SYSTEM: There are many trains that run on Tuesday, can you give me departure and arrival destinations to help narrow the search?", "USER: Yes. I would like to depart from Birmingham New Street and arrive in Cambridge by 14:45.", "SYSTEM: There are trains every hour at :40 after beginning at 5:40. What time would you like to leave?", "USER: I need to arrive by 14:45 any time is fine.", "SYSTEM: There is a train leaving birmingham new street at 11:40 and arriving in cambridge at 14:23. Does that work?", "USER: How much will the trip cost?", "SYSTEM: The price of that trip would be 75.10 pounds and the train id is TR9708. Would you like to book a ticket for that?", "USER: Not just yet. What was the travel time for that trip?", "SYSTEM: It's a long one - the total travel time on that train is 163 minutes. Did you need any further assistance today, perhaps a hotel or restaurant?", "USER: No, thank you.", "SYSTEM: You are welcome. Have a nice day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E2", "user_correction": "C1", "user_reaction": "UR2", "turn": "8", "phrase": ""}, {"error_type": "E2", "user_correction": "C1", "user_reaction": "UR2", "turn": "9", "phrase": "I need to arrive by 14:45 any time is fine."}]}, {"MUL1409.json": ["USER: I need to book a train for Monday going to Cambridge please.", "SYSTEM: There are quite a few trains that could suit your needs. Can you tell me where you would like to depart from?", "USER: I'll be at London's Kings Cross and wanting to leave after 11:45 am.", "SYSTEM: There is a train that leaves London Kings Cross at 13:17 and arrives in Cambridge at 14:08. Does that time work for you?", "USER: Yes, that sounds fine. Can you book me tickets for 8 people, please?", "SYSTEM: Your booking was successful. The total fee is 188.8 GBP payable at the station. The reference number is 2EGCVFWC", "USER: Thank you goodbye", "SYSTEM: Thank you and goodbye.", "USER: Before you go, could you help me find an expensive restaurant in the city centre?", "SYSTEM: Do you have a preference for the type of food?", "USER: Yes, I'd like some classic British cuisine.", "SYSTEM: Midsummer House Restaurant serves British food. Would you like me to book you a table?", "USER: Yes, that place sounds perfect. If I could book for 8 on the same day at 15:00 it would be great.", "SYSTEM: Booking was successful. The table will be reserved for 15 minutes. Reference number is : P0T1HLVC . Is there anything more I can do for you?", "USER: That will be all. Thanks for your time. Bye.", "SYSTEM: You're very welcome, enjoy your Cambridge visit!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4780.json": ["USER: I am looking for information in Cambridge", "SYSTEM: I can definitely help you. Are you interesting in lodging, transportation, entertainment or perhaps some place to eat?", "USER: Can you tell me about an attraction called Primavera?", "SYSTEM: Primavera is a free museum in the centre, their address is 10 king s parade. Is there anything else I can help you with today?", "USER: I'm also looking for information on trains departing from cambridge on thursday.", "SYSTEM: There are a lot of trains to choose from. Would you like to narrow it down by destination, departure time, or arrival time?", "USER: I would like to leave after 19:30 and arrive at london kings cross.", "SYSTEM: You are booked your ref number is o2uqs7k8", "USER: I actually didn't want to book yet, but that's ok. I just needed to know how much the ticket costs.", "SYSTEM: The price for TR0720 is 23.60 pounds. Can I help you with anything else today?", "USER: That is all, thank you!", "SYSTEM: I apologize for your early booking and hope you have a safe trip!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E3", "user_correction": "C1", "user_reaction": "UR3", "turn": "9", "phrase": "I actually didn't want to book yet"}]}, {"PMUL1113.json": ["USER: Hi, I want to visit a museum.", "SYSTEM: There are several museums in the Cambridge area. Is there a certain area of town you prefer?", "USER: Any area is fine. Perhaps the centre area if there is a good one there.", "SYSTEM: i recommend primavera. it is located 10 king s parade, cb21sj. do you need the phone number?", "USER: yes phone number and postcode,thank uyou", "SYSTEM: The phone number is 01223357708 and the postcode is cb21sj. Is there anything else you'd like me to do for you?", "USER: As a matter of fact yes. I need a train that leaves after 13:15 on Saturday", "SYSTEM: What will your destination be?", "USER: I will be coming from Kings Lynn to Cambridge.", "SYSTEM: TR9346 leaves at 14:11. Want to book?", "USER: Yes please book that for 8 people.", "SYSTEM: Ok, the booking was successful, the total fee is 62.72 GBP payable at the station . Reference number is : P1J7RWHQ . Can I help with anything else?", "USER: No, that will be all for today. Thanks for your help today. It's been appreciated.", "SYSTEM: You're welcome, have a great day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"SNG1143.json": ["USER: I'm looking for some entertainment in the center of town.", "SYSTEM: I am very sorry there are no results for entertainment in the centre area, would you like to try another area or different attraction?", "USER: How about a theatre?", "SYSTEM: There are 4 theatres located in the centre of town. How does Cambridge Arts Theatre sound?", "USER: That sounds good, what's the phone number?", "SYSTEM: The phone number for the cambridge arts theatre is 01223503333. Can I offer you any other information today?", "USER: Thank you, that's all I need right now. Bye.", "SYSTEM: You're very welcome. Goodbye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E7", "user_correction": "C1", "user_reaction": "UR3", "turn": "3", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL3066.json": ["USER: I want to find a moderately priced place to stay that has at least a 3-star rating", "SYSTEM: which side of town do you prefer?", "USER: Any area is okay as long as the hotel includes free parking. I don't need internet.", "SYSTEM: Bridge guest house has all that you need, would you like to book that?", "USER: yes please book it for 1", "SYSTEM: What day would you like ?", "USER: 3 days and get me phone number, postcode, and address please", "SYSTEM: I will need the day you plan on arriving.", "USER: Actually I am don't need to book a room just yet but can you provide the phone number, postcode, and address.", "SYSTEM: All right, sure. The postal code is cb28rj and the address is 151 Hills Road. Their phone number is 01223247942. Anything else?", "USER: I am also looking for a Molecular gastronomy place to eat, moderate price.", "SYSTEM: I'm very sorry there are no results for a molecular gastronomy restaurant. Would you like to try for another type of cuisine?", "USER: Oh, that's too bad. How about international food?", "SYSTEM: I'd recommend The Varsity Restaurant. Would you like to book a table?", "USER: Yes, but first I just want to make sure this is in the centre area of town.", "SYSTEM: The Varsity Restaurant is in City Centre, what time and date would you like your reservation?", "USER: I'd like it to be on Monday at 15:30. It will be for 3 people.", "SYSTEM: Ok. I was able to reserve a table. Your reference number is U3AQT6OR .", "USER: That's all I need, thanks so much for all of your help! Have a great day!", "SYSTEM: You're very welcome. Enjoy you stay. Good bye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL0638.json": ["USER: I need a train that leaves on wednesday after 12:30.", "SYSTEM: I'm happy to help! Could you let me know where you would like to depart from and what your destination is?", "USER: I am departing from birmingham new street and my destination is cambridge.", "SYSTEM: I have 12 trains that leave after 12:30 that day. Did you want to leave at about 13:40? That train arrives at 16:23 and costs 75.10 pounds a ticket.", "USER: Yes, thank you.", "SYSTEM: All set! Your reference number is 9P2D9ORJ .", "USER: I am also looking for a certain hotel in the area. It is called the Lovell Lodge. Do you have information on that?", "SYSTEM: Yes, I do. What would you like to know?", "USER: Could you see if they have rooms available for 7 people, for a 4 night stay?", "SYSTEM: When would you like to begin your stay?", "USER: I'd like you begin my stay on Wednesday.", "SYSTEM: Unfortunately, it doesn't look like there is availability for 7 people, for 4 nights, starting on Wednesday. Would you like to try another day or a shorter stay?", "USER: Ummm, I can swing just 2 nights if that is available.", "SYSTEM: Ok, we were able to book that for you, your confirmation code is 1HC1U1TN .", "USER: Thanks, that is all. Goodbye!", "SYSTEM: You're welcome. Enjoy your trip."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL0697.json": ["USER: I need an expensive restaurant in the centre of town.", "SYSTEM: There are many British restaurants in the area, is that okay?", "USER: That is fine, Ill go with what you recommend, can I get the place's phone number and address?", "SYSTEM: i recommend midsummer house restaurant phone number is 01223369299 and address is Midsummer Common, cb41ha", "USER: What type of food do they serve?", "SYSTEM: The restaurant serves British food. Would you like to make a reservation?", "USER: nah, but i need to catch a train", "SYSTEM: When and where will you be traveling?", "USER: I am going from Cambridge to London Kings Cross on Friday.", "SYSTEM: There are several trains, do you have a time preference?", "USER: The train should arrive by 09:15 if possible", "SYSTEM: TR8026 arrives at 07:51 and it is the latest. will that work for you?", "USER: Yes, what's the total travel time please?", "SYSTEM: Total travel time is 51 minutes. Can I help you with anything else?", "USER: Can you tell me what time the train will be departing?", "SYSTEM: TR8026 leaves the station at 07:00. Would you like me to go ahead and make reservations for you?", "USER: Not at this time, thank you.", "SYSTEM: Is there anything else I can help you with today?", "USER: No that will be all for now.", "SYSTEM: Thank you for calling and have a great day. Goodbye."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "2", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"MUL1463.json": ["USER: I need help finding a restaurant in Cambridge.", "SYSTEM: What type of food do you want? I have asian and african cuisine", "USER: I would actually like to find something that's serving modern European food, preferably in the centre.", "SYSTEM: I have four options. Do you want cheap, moderate, or expensively priced?", "USER: moderate please.", "SYSTEM: We have two options - de luca cucina and bar or riverside brasserie. Would you like me to book a reservation at either one?", "USER: Either one would be fine. Can you book it for 3 people at 19:00 on saturday?", "SYSTEM: Booking was unsuccessful. Would another date or time work?", "USER: Can you try to book me at 18:00?", "SYSTEM: I was able to successfully book you for 18:00. Your reference number is CAOHGDS4 .", "USER: Thanks! I also need a train to stevenage on Sunday. I need to get there by 10:45, if possible.", "SYSTEM: TR6488 leave at 09:21 and arrives 49 minutes later at 10:10, the cost is 10.24 pounds, shall I book you?", "USER: Yes, can I get 3 tickets on that train, with a reference number, please?", "SYSTEM: The train booking was successful. The total fee is 30.72 GBP and you pay that at the station. Your reference number is OPFJG9NC .", "USER: Thank you very much, that will be all.", "SYSTEM: Welcome. Have a lovely day."], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"PMUL4059.json": ["USER: i am looking for a place to stay. The hotel should include free wifi and should include free parking.", "SYSTEM: Sure, would you like a guesthouse or hotel?", "USER: A guesthouse, please. Are there any in the cheap price range?", "SYSTEM: Oh, yes, there are 9. I do recommend the Autumn House.", "USER: Great, could you give me their phone number and address please?", "SYSTEM: The Autumn House is located at 710 Newmarket Road, CB58RS and the phone number is 01223575122. Can I help with anything else?", "USER: Yes, I'm looking for a museum in the west.", "SYSTEM: How does the cafe jello gallery sound? Or kettles yard?", "USER: Could I get the area, phone number, and address of the Kettles yard?", "SYSTEM: Here is the address castle street and the phone number is 01223748100.", "USER: What is the area?", "SYSTEM: it is in the west of the city", "USER: What is the postcode?", "SYSTEM: The postcode for Kettle's Yard is cb30aq. Can I help you with anything else today?", "USER: no, that will be all. Thank you! goodbye.", "SYSTEM: You're welcome, have a great day!"], "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR2", "turn": "10", "phrase": ""}, {"error_type": "E2", "user_correction": "C1", "user_reaction": "UR2", "turn": "11", "phrase": "What is the area?"}]}]