[{"turns": " ['USER: I would like to buy three tickets to the Mariners vs Rangers in Seattle, WA.', 'SYSTEM: Is there a preferred date?', 'USER: I would like March 3rd.', 'SYSTEM: Please confirm Mariners vs Rangers for 3 people on March 3rd in Seattle.', 'USER: Yes, that is great. Where is the venue and event going on?', 'SYSTEM: The reservation is made for T-Mobile Park at 1250 1st Avenue South.', 'USER: I would like to find a round trip flight there.', 'SYSTEM: Would you like to return March 3rd and which date and city do you wish to travel from?', 'USER: I would be returning March 14th and be looking for flights from Portland, OR on March 3rd Economy class.', 'SYSTEM: I have 3 flights including one from American Airlines. Would you be interested in a flight taking off 6 am and returning 8:35 am for $85?', 'USER: Yes that would work.', 'SYSTEM: Can I assist you with anything else?', 'USER: No thank you for your help.', 'SYSTEM: Have a wonderful day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I want to hear some Country songs.', 'SYSTEM: I found 10. How about All on Me by Devin Dawson in Dark Horse?', 'USER: What other choices do you have?', 'SYSTEM: How about All The Girls Wanna Ride by Jawga Boyz in Kuntry?', 'USER: Do you have anything in the album California Sunrise?', 'SYSTEM: In the album California Sunrise, I have 2 songs. How about Head Over Boots by Jon Pardi?', 'USER: Yes, I want that song.', 'SYSTEM: Do you want to play it?', 'USER: Yes I want to hear it.', 'SYSTEM: Confirm Head Over Boots on the TV.', 'USER: Play it on the kitchen speaker.', 'SYSTEM: Confirm Head Over Boots on Kitchen speaker.', 'USER: Play it in my bedroom.', 'SYSTEM: Confirm Head Over Boots on bedroom speaker.', 'USER: Yes I confirm all.', 'SYSTEM: The song is starting.', 'USER: That is all I need today.', 'SYSTEM: Have a great day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Find round trip flights the 3rd of this month.', 'SYSTEM: Where to and from? Dates?', 'USER: 14th of March from San Fran to Chi-town.', 'SYSTEM: American Airlines flies at 3:20 pm returning 7:05 am for $193.', 'USER: Arriving?', 'SYSTEM: 10:07 pm.', 'USER: Something else, for 2.', 'SYSTEM: Delta Airlines leaves 10:05 pm and returns 10:40 am for $214.', 'USER: What else?', 'SYSTEM: Southwest Airlines leaves 5:50 pm and returns 11:35 am for $180.', 'USER: Food.', 'SYSTEM: Do you want seats?', 'USER: Yeah.', 'SYSTEM: Please confirm: San Francisco to Chicago on Southwest Airlines from March 3rd to March 14th, leave 5:50 pm return 11:35 am, for 2 in economy.', 'USER: Yep.', \"SYSTEM: You're set.\", 'USER: Thanks, look at pet friendly hotels.', 'SYSTEM: Ac Hotel by Marriott Chicago Downtown is rated 4.3.', 'USER: Address and number?', 'SYSTEM: 630 North Rush Street at +1 312-981-6600.', 'USER: Good. Book 1 room the 11th of March to the 12th.', 'SYSTEM: Please confirm: 1 room at Ac Hotel by Marriott Chicago Downtown in Chicago March 11th to March 12th.', 'USER: Good. Price?', \"SYSTEM: You're set. It's $232.\", 'USER: Local attractions?', 'SYSTEM: 360 Chicago is a tourist attraction.', 'USER: Kid friendly?', 'SYSTEM: Yes.', 'USER: Number and price?', \"SYSTEM: It's free and at 888-875-8439.\", 'USER: Good, ok bye.', 'SYSTEM: Bye!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I would like to find an event for this Saturday.', 'SYSTEM: In which city and what type of event?', 'USER: In Washington D.C. for Games.', \"SYSTEM: I found 5 events, there is DC United Vs Revolution and it's at Audi Field.\", 'USER: Do you have an event on the 11th of this month?', 'SYSTEM: There is Nationals Vs Braves at Nationals Park.', 'USER: When does the event start?', 'SYSTEM: The events starts at 7:30 pm.', 'USER: Can you find some other event?', \"SYSTEM: There is Nationals Vs Diamondbacks and it's at Nationals Park.\", 'USER: What type of event is this?', 'SYSTEM: This is a Baseball game.', 'USER: That sounds good, what other dates are for this event?', 'SYSTEM: There is 1 event on March 11th, Nationals Vs Diamondbacks at Nationals Park.', 'USER: When does it start and what is the location?', 'SYSTEM: The events starts at 5:30 pm at 1500 South Capitol Street Southeast.', 'USER: That is good, I want 1 ticket.', 'SYSTEM: 1 ticket for the Nationals Vs Diamondbacks at Nationals Park on March 11th in Washington D.C.', 'USER: I would like 2 tickets please.', 'SYSTEM: 2 tickets for the event on March 11th.', 'USER: Yes, that is perfect.', 'SYSTEM: Your tickets are purchased.', 'USER: Thank you for you assistance.', 'SYSTEM: Have a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": ": ['USER: I want 2 tickets to an event is San Fran.', 'SYSTEM: What type of event? Do you have a date in mind?', 'USER: I want to go to Allan Rayman on Tuesday next week.', 'SYSTEM: Please confirm, 2 tickets for Allan Rayman on March 5th in San Francisco.', 'USER: Yes, that is correct.', 'SYSTEM: Your reservation is complete.', \"USER: I want to find a Ramen place that serves alcohol to eat while I'm there. Make sure the cost is average priced.\", 'SYSTEM: 2G Japanese Brasserie is in San Francisco.', 'USER: Yes, that is perfect.', 'SYSTEM: Are you ready to make a reservation?', 'USER: Yes, make it for 12 pm.', 'SYSTEM: Please confirm, reservation for 2 at 2g Japanese Brasserie on March 5th at 12 pm in San Francisco.', 'USER: No, change it to 4:45 pm.', 'SYSTEM: Confirm, reservation at 4:45 pm at 2g Japanese Brasserie.', 'USER: Yes! Is there live music? What is the address?', 'SYSTEM: Sorry, your reservation was not made. Anything else?', 'USER: No, thanks for nothing.', 'SYSTEM: Have an ok day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I am in need of visiting a doctor, so I would like to have an appointment with Dr. Edward Lee.', 'SYSTEM: Which date do you want to make the appointment at?', 'USER: I would like for the appointment to be on 5th of this month.', 'SYSTEM: What time would suit your schedule?', 'USER: I would like to have the visit at afternoon 12:15.', 'SYSTEM: Can you please confirm that you will have a visit with Edward C Lee, MD at 12:15 pm and the appointment will be on next Tuesday.', \"USER: That's right. What address is the doctor located at?\", 'SYSTEM: I apologize but I was unable to make a reservation for the visit. The address of the location is 16130 Juan Hernandez Drive #108. What do you think about Edward C Lee, MD for next Tuesday at 12:30 pm.', 'USER: Alright, seems fine.', 'SYSTEM: The requested appointment has been reserved without errors.', 'USER: I appreciate it.', 'SYSTEM: Is there something else, I can help you with.', 'USER: Nothing for the moment. I appreciate it.', 'SYSTEM: Have a good time!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Can you help me to find something interesting to do', \"SYSTEM: What's your preferred City\", 'USER: Look in New York city', 'SYSTEM: What about type of events', 'USER: I like drama', 'SYSTEM: There are 10 events. Acting for teens is a nice and famous one at 520 8th Ave. - personal valet parking on March 4th at 6 pm', 'USER: That sounds good', 'SYSTEM: Do you like to get the tickets', 'USER: Not now get me a house there with rating 4.1 or higher', 'SYSTEM: There are 10 houses and a good house at 100 Greenwich street with 4.1 rating', 'USER: This is a nice one', 'SYSTEM: Is there anything should I help you with', 'USER: What about buses to there for 2 people with a direct bus leaving from philly', 'SYSTEM: When will you leave is it March 5th March 4th or any other dates', \"USER: It's on 3rd of march\", 'SYSTEM: There are 6 buses what about bus departs at 9 am and costs $25', 'USER: Sounds great', 'SYSTEM: Shall I get the tickets for the bus', 'USER: No not now maybe later I want to purchase tickets to the event you just found', 'SYSTEM: Details booking tickets for acting for teens in New York on March 4th and its for 2 tickets', 'USER: Yes correct where is the venue located and how much is cost', 'SYSTEM: Your reservation is confirmed unsuccessful have a nice time there the value is 520 8th Ave. - personal valet and costs $35', \"USER: Thanks a lot that's all for now\", 'SYSTEM: Have a nice day']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I feel like being spooked out. Can you help me find some scary movies?', 'SYSTEM: Where are you located?', 'USER: Please look for movies showing in Campbell.', 'SYSTEM: I found 1 movie I think you would like. How does The Curse of La Llorona sound?', \"USER: The Curse of La Llorona works good for me. What time is it showing? I'd like to go on the 9th.\", 'SYSTEM: I managed to find 1 showtime. It starts at 9:30 pm in Pruneyard Dine-In Cinemas.', \"USER: That's perfect, that's all I needed.\", 'SYSTEM: Enjoy the movie!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I want to find a 2 bedroom apartment.', 'SYSTEM: Where are you looking for this property?', 'USER: I want something in Fremont.', 'SYSTEM: I have 10 places for you. Americana Apartments is a nice one. Located at 4445 Stevenson Boulevard. It has 2 bedrooms and bathrooms. The rent would be $2,800 a month.', 'USER: Can you find me something with 2 bathrooms with pets allowed?', 'SYSTEM: How about this one? Boulevard at 40001 Fremont Boulevard. The property has 2 bedrooms and bathrooms and the rent is $2,750.', 'USER: Can you find another?', \"SYSTEM: Century Village Apartments is a nice place. It's address is 41299 Paseo Padre Parkway. The property has 2 bedrooms and bathrooms and the rent would be $2,700 per month.\", 'USER: Is it furnished though? What is the phone number?', 'SYSTEM: It is not furnished. The number is 510-651-1040.', 'USER: Yeah that sounds like the one.', 'SYSTEM: Do you want to visit it?', \"USER: No, not now. That'll be all now.\", 'SYSTEM: Have a nice day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I need to rent a home.', 'SYSTEM: Which city are you travelling to?', \"USER: I'm going to London.\", 'SYSTEM: I have 10 options. 1 Addington Street has 4.3 rating.', 'USER: What other options do you have with a 4.0 or higher rating?', 'SYSTEM: I have 9 options. 1 Baffin Way has a 4.0 rating.', 'USER: Do you have any other options?', 'SYSTEM: 1 Craven Hill Gardens has a 4.0 rating.', 'USER: That house sounds awesome.', 'SYSTEM: Should I book it for you?', 'USER: No. That will be all for now. Thank you.', \"SYSTEM: You're welcome. Please enjoy the rest of your day.\"]\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I am going from lax and going to san francisco and want delta airlines', 'SYSTEM: when will you go>', 'USER: the 10th of this month', 'SYSTEM: delta airlines 1 flight at 9:15 am and has 0 stops for $90', 'USER: where does it depart from?', 'SYSTEM: flight arrives 10:40 am and departs LAX international airport', 'USER: help me get a bus for four people leaving next wednesday', 'SYSTEM: bus leaves at 6:20 am and is $53 and has 0 transfers', 'USER: what is the bus station?', 'SYSTEM: union station is the station', 'USER: which bus station is it?', 'SYSTEM: it is salesforce transit center', 'USER: book flight you found', 'SYSTEM: Los angeles to san francisco with delta airlines and is leaving march 6th with 1 passenger and it is the economy class', 'USER: yes that is good', 'SYSTEM: one way ticker is good', 'USER: what airport does it arrive at?', 'SYSTEM: it is sfo international airport', 'USER: thanks a lot', 'SYSTEM: have a good one']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I want to know the weather in Phoenix, AZ.', 'SYSTEM: The average temperature in Phoenix, AZ for the day is expected to be 89 degrees Fahrenheit. Also there is a 15 percent chance that it will rain.', 'USER: Alright fine. I want you to find me a round trip flight to go there. I would like for the flight ticket to be an Economy class one.', 'SYSTEM: Can you tell me the day when you will be having your return flight? Will you be departing on March 1st?', 'USER: That suits me well. I will be returning on 4th of this month.', 'SYSTEM: Can you tell me from which city you will leave?', 'USER: I will be departing for my flight from SFO.', 'SYSTEM: Would you like flying with Delta Airlines, with the flight which leaves at 5:50 am and when it returns it leaves at 11:55 am. The price for this flight ticket is $118.', 'USER: Is there something else you can suggest?', 'SYSTEM: How would you consider flying with Southwest Airlines, with the flight which leaves at 6:15 pm, and when it returns it leaves at 6 am. The price for this flight ticket is $125.', 'USER: Are there some other flights which you can suggest? I am interested in buying three tickets, and I want to fly with the United Airlines.', 'SYSTEM: There is 1 flight which matches what you want. How would you consider to fly with United Airlines, with the outbound flight leaving at 2:15 pm, and with the return flight leaving at 11:50 pm? The price for this ticket is $135.', 'USER: Can you check if this is a redeye flight?', 'SYSTEM: From what I can see this is an overnight flight.', 'USER: Alright. I need to find a house where I can stay there.', 'SYSTEM: There are 10 houses which match what you want. A good house which I can suggest that has a rating of 4.6 is located at 10 East Thomas Road.', 'USER: Are there some other houses which you can recommend?', 'SYSTEM: Another good house with a 3.8 rating can be found at 10210 North 26th Drive.', 'USER: Can you find some other houses for me? More specifically I would like for the house to have a 4.5 rating or higher.', 'SYSTEM: There are 9 houses which you might like. A good house with a rating of 4.5 can be found at 132 South Central Avenue.', 'USER: Can you check if this house has laundry service?', 'SYSTEM: I can confirm that the house has laundry service.', 'USER: This house seems as what I want. That would be all.', 'SYSTEM: I enjoy helping you. Good bye!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": ": ['USER: I have a trip outside which needs a car on rent. Do you have any>', 'SYSTEM: Tell me about the place of pick up and drop off date.', 'USER: I need it till March 14th and wish to get it from San Fran.', 'SYSTEM: From which date do you want it? What is the time of pick up?', 'USER: Around 15:00 I am picking it up on the 12th.', 'SYSTEM: Your requirement meet with one Standard Altima car which is available at SFO International Airport on March 12th.', 'USER: How much will it cost?', 'SYSTEM: You need to pay $62.', 'USER: Good, apt one.', 'SYSTEM: Shall I book it for you ?', 'USER: Yes, do it please.', 'SYSTEM: Please confirm, you need a Standard car on March 12th at 3 pm from SFO International Airport. You will drop it off on March 14th.', 'USER: Fine, thats right.', 'SYSTEM: Its reserved for you.', 'USER: Is there any apartment suitable?', 'SYSTEM: Have you any idea about number of bed rooms needed?', 'USER: I need apartment with one bed room.', 'SYSTEM: Your demand equals with Carter Terrace at 530 Carter Street. It is with 1 bed room, and 1 bath. The rent would be $1,750 per month.', 'USER: That will be fine. Great help.', 'SYSTEM: Welcome, have a nice day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I want to find an apartment with two baths over in Concord.', 'SYSTEM: How many bedrooms would you like?', 'USER: I want two bedrooms.', \"SYSTEM: I found 8 places for you. There's a place on 1580 Clayton Road # 1 called Casa Pino Condos that has 2 bedrooms and 2 baths for $3,200 a month.\", 'USER: Is it furnished?', 'SYSTEM: Yes it is.', \"USER: What's their number?\", \"SYSTEM: It's 925-827-3700.\", 'USER: That looks good. I want to plan a visit there to see it.', 'SYSTEM: When would you like to do that?', 'USER: tomorrow works.', 'SYSTEM: So you want to schedule a viewing for Casa Pino Condos on March 2nd?', 'USER: Yup. Are pets allowed?', \"SYSTEM: It's been booked. Yes, pets are allowed.\", 'USER: Thanks so much.', 'SYSTEM: Is there anything else?', \"USER: I want to get a can there. I'm fine with shared rides.\", 'SYSTEM: How many people is the ride for?', 'USER: 3 people.', 'SYSTEM: You want a cab for 3 people to get to 1580 Clayton Road # 1?', 'USER: Yes, how long is the ride though? And how much will it cost?', \"SYSTEM: It's been booked and it's on the way. It'll cost $31.06 and it'll last about 19 minutes.\", 'USER: Thanks for that.', 'SYSTEM: Anything else you need help with?', \"USER: No, that's everything!\", 'SYSTEM: Have a great day!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I would like to find events and activities', 'SYSTEM: What kinds of activities and events are you looking for and in what location?', \"USER: I'm interested in Games in Chicago\", 'SYSTEM: There are 10 activities that match your preference. There is a Cubs Vs Brewers game in Wrigley Field', \"USER: Are there other activities? I'm specifically interested in Music\", 'SYSTEM: There are 5 events matching your request. One such event is Basta and it is taking place at Concord Music Hall', 'USER: What time does the show begin and can you also tell me the address for the venue?', 'SYSTEM: The show begins at 6 pm and the music hall is at 2047 North Milwaukee Avenue', \"USER: Great, that's perfect.\", 'SYSTEM: Would you like to purchase tickets for this show?', 'USER: No, thank you. I would like to check my balance for my checking account.', 'SYSTEM: Your current balance in your checking account is $24,425.78', 'USER: Can you also give me my savings account balance?', 'SYSTEM: Your savings account balance is $17,771.33', 'USER: Great, thank you for that.', 'SYSTEM: Would you like assistance with anything additional?', 'USER: No, that was all for me. Thanks!', 'SYSTEM: Enjoy your day!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Hello, could you help me search for a salon in the SFO area please?', 'SYSTEM: Sure, there are 10 salons you might like in the San Francisco area, one of which is called 1512 Barber Shop.', 'USER: May I know what is their average rating?', 'SYSTEM: Their average rating is 4.8.', 'USER: Wow, that sounds good!', 'SYSTEM: Would you like me to schedule an appointment with the salon?', 'USER: Sure, please schedule one at 3:30 pm please.', 'SYSTEM: Sure, and when will you be visiting the salon?', 'USER: I will visit them on the Thursday next week.', 'SYSTEM: Please confirm your appointment with 1512 Barber Shop at 3:30 pm on March 7th.', 'USER: Sure, that sounds fine with me.', 'SYSTEM: Your appointment has been made.', 'USER: Thank you, could you help me search for restaurants which serves up delicious Lobster in that area too?', \"SYSTEM: Would you like Akiko's Sushi Bar which is located in San Francisco?\", 'USER: May I know what is the price range of their food and if they do serve alcohol?', 'SYSTEM: The restaurant serves alcohol and their food is in the expensive price range.', 'USER: Are there any alternatives? Would prefer on which is moderate priced.', 'SYSTEM: Sure, there are 10 restaurants in the San Francisco area, one of which is Alamo Square Seafood Grill.', 'USER: I see, could you make a reservation for three people there at quarter past 1 in the afternoon?', 'SYSTEM: Sure, please confirm your reservation at Alamo Square Seafood Grill in San Francisco for 3 at 1:15 pm on March 7th.', 'USER: Sure, how can I contact them and do they serve liquor?', 'SYSTEM: Your reservation has been made and you can contact them at 415-440-2828. Unfortunately, they do not serve alcohol.', 'USER: I see, thank you for your help!', 'SYSTEM: Do you require further assistance?', 'USER: No, that is all I need, thank you!', 'SYSTEM: Sure, have an enjoyable meal!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I need to book an appointment at the salon.', 'SYSTEM: Okay, what time do you want the appointment to be?', 'USER: I need it to be at 14:30, and the salon I want to go to is Salon Valenti Hair Nails Skin.', 'SYSTEM: Alright, what day should I make the appointment for?', 'USER: I want to go on the 9th.', 'SYSTEM: Alright, tell me if this sounds right then. Your appointment will be for 2:30 pm on March 9th at Salon Valenti Hair Nails Skin.', 'USER: No actually I wanted the appointment for 1 in the afternoon.', \"SYSTEM: Alright I'll fix that, does 1 pm on March 9th sound right?\", \"USER: That's perfect. Is the salon unisex?\", \"SYSTEM: Alright then I've confirmed the appointment, and yes the salon is unixes.\", 'USER: Great, what is their phone number?', 'SYSTEM: The number is 510-498-1090.', \"USER: Thanks, that's gonna be it.\", 'SYSTEM: Have a good day then.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Whats the weather like in Las Vegas?', 'SYSTEM: Its 84 degrees on average. Chance of rain is 18 percent.', 'USER: Can you check out hoses to rent there?', 'SYSTEM: I see one at 1215 South Las Vegas Boulevard. It has a 3.7 rating.', 'USER: That might be the one.', 'SYSTEM: Do you want to book it?', 'USER: Yeah. For March 1st. There are four of us.', 'SYSTEM: Until when do you need it?', 'USER: Until the 7th of this month.', 'SYSTEM: 4 people in Las Vegas from March 1st to March 7th?', 'USER: You got it.', 'SYSTEM: And you have a house to stay in.', \"USER: Nice job buddy. I'm set.\", 'SYSTEM: Glad I could be of help.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: What will the weather be on the next Monday in Vancouver?', 'SYSTEM: It will be 58 degrees with a 49 percent chance of precipitation.', 'USER: What is the humidity and wind speed?', 'SYSTEM: Humidity will be 54 per cent and the wind will gust at 8 miles per hour.', 'USER: I see. Find me a house to stay in there.', 'SYSTEM: Search revealed 10 results for you. 1018 Granville Street has a 4.2 rating.', 'USER: What else do you have?', 'SYSTEM: 1025 Granville Street has a 3.9 rating.', 'USER: That works for me.', 'SYSTEM: Shall I reserve a room for you?', 'USER: Yes, reserve a room for me.', 'SYSTEM: How many people will there be? Will you be arriving March 4th and what date are you departing the house?', 'USER: There is one person that is arriving March 4th and leaving next Thursday.', 'SYSTEM: You want a room for 1 person in Vancouver from March 4th to March 7th. Is that right?', 'USER: No, change that to 4 people.', 'SYSTEM: There will be a total of 4 people checking in on March 4th. Is that right?', 'USER: No, check in is on the 3rd of March and the departure date is the 10th of March.', 'SYSTEM: You want to arrive March 3rd and depart March 10th. Is that right?', 'USER: Yes, that is right.', 'SYSTEM: Your order is complete.', 'USER: Thanks a lot. That is all for now.', \"SYSTEM: I'm glad to help. Bye for now.\"]\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I need a one way flight leaving on the 12th of March.', 'SYSTEM: What is your departure city and destination?', \"USER: I'm leaving from San Francisco and going to Atlanta.\", 'SYSTEM: Alaska Airlines has a 3 pm flight with 0 layovers. The ticket costs $174 per passenger.', 'USER: Can you find me something else? I need three Economy class tickets.', 'SYSTEM: I found 4 flights. American Airlines has a 7:15 am flight with 0 layovers for $208 per passenger.', 'USER: Anything else? I need two seats, preferably on Delta Airlines.', 'SYSTEM: I found you 1 flight with 1 layover on Delta Airlines. It departs at 4:05 pm local time and costs $273 per passenger.', 'USER: What are the departure and arrival airports?', 'SYSTEM: The flight departs from SFO International Airport and arrives at the Hartsfield-Jackson International Airport.', 'USER: Good. I want round trip flights.', 'SYSTEM: What is your return date?', 'USER: The 14th of March.', 'SYSTEM: I found you 1 flight on Delta Airlines. It departs at 4:05 pm local time and the return flight departs at 7:55 pm local time. The ticket is $561 per passenger.', 'USER: All right.', 'SYSTEM: Can I help you with anything else?', 'USER: No. Thanks for your help.', 'SYSTEM: Your welcome. Have a nice day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: Could you search for any sort of music for me?', \"SYSTEM: What's your opinion about Barefoot in the Park by James Blake in the album Assume Form?\", 'USER: Do you possess anything else?', \"SYSTEM: What's your opinion about Back it Up by Prince Royce in the album Double Vision?\", 'USER: Do you posses anything else? I enjoy music by Justin Bieber. There are plenty of wonderful songs in the album Journals.', \"SYSTEM: I discovered 1 song you may enjoy. What's your opinion about All That Matters by Justin Bieber in the album Journals?\", \"USER: That's wonderful. I'd like to play the music.\", 'SYSTEM: Please verify the following information: play All That Matters on TV.', 'USER: Nope, play it on kitchen speaker.', 'SYSTEM: Please verify the following information: play all That Matters on kitchen speaker.', \"USER: Yeah, that's right.\", 'SYSTEM: The music began playing.', \"USER: Thank you for your help; that's all.\", 'SYSTEM: Have a pleasant afternoon.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Can you find me a unisex salon in Lafayette?', \"SYSTEM: I found 4 salons that you might like. How about 18|8 Fine Men'S Salons - Lafayette? It is a nice salon located in Lafayette.\", 'USER: Okay, that sounds good.', 'SYSTEM: Would you like to book an appointment?', 'USER: No, maybe later.', 'SYSTEM: Can I help you with something else?', 'USER: Yes, I want to find a therapist in the area.', 'SYSTEM: You mean a therapist in Lafayette?', \"USER: Yes, that's right.\", 'SYSTEM: Do you need a Family Counselor, a Psychiatrist or some other type of therapist?', 'USER: I want a Psychologist.', 'SYSTEM: How about Alissa Scanlin Psyd? They are a Psychologist located in Lafayette.', 'USER: That sounds good.', 'SYSTEM: Would you like to book an appointment with the therapist?', 'USER: Yes, please.', 'SYSTEM: Do you have a preferred time and date for the appointment?', 'USER: Try to make it for Friday next week at 2:30 pm.', 'SYSTEM: Confirming that you want to book an appointment with Alissa Scanlin Psyd at 2:30 pm on March 8th?', 'USER: Yes, that will work. Can you give me their phone number?', 'SYSTEM: Sorry, but something went wrong and I was unable to book your appointment. Is there anything else that I can help you with?', 'USER: Can you try to book it again? Try for the 6th of this month.', 'SYSTEM: Confirming that you want to book an appointment with Alissa Scanlin Psyd on March 6th 2:30 pm?', \"USER: Yes, that will work. What's the address and phone number?\", \"SYSTEM: They are located at 3468 Mount Diablo Boulevard and you can contact them at 707-371-2433. Sorry, but I wasn't able to book your appointment with Alissa Scanlin Psyd. How about I try for March 6th at 2 pm?\", 'USER: Yes, try that.', 'SYSTEM: Your appointment has been successfully scheduled and you should receive an email confirmation soon.', 'USER: Thanks a lot, I really appreciate it. Can you get me an appointment at the salon that you found earlier?', 'SYSTEM: Sure. For what time?', 'USER: Make it for 10:15.', \"SYSTEM: Confirming that you want to visit the 18|8 Fine Men'S Salons - Lafayette, on March 6th at 10:15 am?\", 'USER: No, make it for 5:45 pm.', \"SYSTEM: Confirming that you want to visit the 18|8 Fine Men'S Salons - Lafayette at 5:45 pm?\", 'USER: Yes, that sounds good. Can you get me their address and average rating?', \"SYSTEM: They are located at 15 Fiesta Lane and the average rating is 4.3. Sorry but I was unable to book your appointment at 18|8 Fine Men'S Salons - Lafayette. How about I try for March 6th at 6 pm?\", 'USER: Yes, that sounds good.', 'SYSTEM: Your appointment is confirmed.', \"USER: Thank you. That's all I need.\", \"SYSTEM: You're welcome. Have a pleasant day!\"]\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I need to find a eating place in San Carlos and some kind of Ramen food i okay', 'SYSTEM: There is a nice restaurant called Aya Sushi in San Carlos', 'USER: That is fine', 'SYSTEM: Is there any other help you need?', 'USER: Would you look for a salon in San Carlos?', 'SYSTEM: A salon called Sasha Salon in San Carlos is a nice one', 'USER: Can i know its average rating?', 'SYSTEM: The average rating of that is around 4.9', 'USER: That is fine', 'SYSTEM: You need an appointment there?', 'USER: Yes, i want an appointment to salon on 6th of this month', 'SYSTEM: What is your preferred time?', 'USER: I would like to have an appointment at 3:15 in the afternoon', 'SYSTEM: Please give confirmation details: An appointment with the hair stylist Sasha Salon at 3:15 pm on March 6th', 'USER: That is fine', 'SYSTEM: Sorry i failed in booking an appointment. What is your opinion on booking an appointment at Sasha Salon on March 6th at 3 pm?', 'USER: That is okay', 'SYSTEM: Your appointment is successful', 'USER: Thank you very much. Can you please try booking a table at the restaurant i liked?', 'SYSTEM: What time you prefer for reservation?', 'USER: I want it at 5 pm', 'SYSTEM: Please give confirmation details: Booking a table for 2 people at Aya Sushi at 5 pm on March 6th in the city of San Carlos', 'USER: That is fine', 'SYSTEM: Your booking is done', 'USER: Can i have their phone number?', 'SYSTEM: Their contact number is 650-654-1212', 'USER: Thank you.Now i like to listen to songs by Ghost', 'SYSTEM: Which is your preferred song?', 'USER: I need to listen to Rats', 'SYSTEM: Please give confirmation details: To play the song Rats on TV', 'USER: That is right', 'SYSTEM: Have fun and enjoy the song', 'USER: Can i know the song album?', 'SYSTEM: The song is from album Prequelle', 'USER: Thanks a lot', 'SYSTEM: Is there any other help you need?', 'USER: No, thanks a lot', 'SYSTEM: Have a nice day']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I would like to check the weather on Saturday this week in San Francisco.', 'SYSTEM: The temperature should be 72 degrees and there is a 15 percent chance of rain.', 'USER: I would like to find a house.', 'SYSTEM: There is one located at 1095 Market Street and the rating is 3.7', 'USER: That house sounds good.', 'SYSTEM: Would you like to make a reservation?', 'USER: Yes, I would like to book a house.', 'SYSTEM: When are you checking out?', 'USER: I will be checking on on March 3rd.', 'SYSTEM: How many people are in the group and do you want to check in on March 2nd?', \"USER: It's only for 1 person and check in will be on March 1st.\", 'SYSTEM: 1 person going to San Francisco on March 1st to March 3rd.', 'USER: Yes, that is correct. What is their phone number?', 'SYSTEM: Their phone number is +1 415-829-0000.', 'USER: Does this place have laundry service and what is the cost?', 'SYSTEM: Yes, it has laundry service and the price is $378.', 'USER: Thank you for your help.', 'SYSTEM: Can I help you with something else?', 'USER: No, thank you for your help.', 'SYSTEM: Have a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Please find me a movie to watch.', 'SYSTEM: Sure, in which area?', 'USER: Please find me an imax movie in Livermore at Livermore Cinema.', \"SYSTEM: Do you think you'd like Breakthrough, Missing Link or maybe Captain Marvel.\", 'USER: Breakthrough sounds awesome.', 'SYSTEM: Do you want me to get tickets for you to this movie?', 'USER: No, not at the moment, but please tell me the showtimes for the 2nd of this month.', \"SYSTEM: There's just one show at 7 pm at Livermore 13 Cinema.\", \"USER: Perfect. Now let's find a restaurant serving alcohol in the area.\", 'SYSTEM: Sure, but first tell me what cuisine would you like. American, Chinese or maybe something else?', \"USER: I'd like some not very costly italian food.\", \"SYSTEM: There's 3 meeting your criteria in Livermore. How abut Campo di Bocce of Livermore.\", 'USER: Please tell me their phone number as well as if they play live music.', \"SYSTEM: They're located at 175 Vineyard Avenue but they do not have a band.\", 'USER: Any other restaurant which you might suggest?', \"SYSTEM: In Livermore there's also Melo's Pizza & Pasta Livermore.\", 'USER: OK, that will do.', 'SYSTEM: Do you want me to book a table for you?', 'USER: Yes, please do.', 'SYSTEM: For what time.', 'USER: 5 o\"clock in the evening would be perfect.', \"SYSTEM: Can you please confirm that you want a table for 2 at 5 pm on March 2nd at Melo's Pizza & Pasta Livermore in Livermore?\", \"USER: Yes, that's correct. Please tell me their address as well as if they play live music.\", \"SYSTEM: I've successfully placed your reservation. They don't have a band and they're located at 4433 First Street.\", 'USER: Thanks a lot. That will be all for now.', 'SYSTEM: Have a nice day1']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Please help play a song. I am really in a bad mood.', 'SYSTEM: What genre of songs do you prefer?', 'USER: I feel like listening to The Water Fountain song.', 'SYSTEM: Please have it check, play the song The Water Fountain on the TV.', 'USER: Yes, everything is right. I forgot what album it does belong, I used to listen to it when it was first released.', 'SYSTEM: It is from Narrated For You album. The song has started playing at the TV.', 'USER: Thanks! It soothes my mood. Now I need to make a transfer to a savings account. I promised that I will lend my brother a small amount money.', 'SYSTEM: What do you want me to use?', 'USER: Please use my savings account too.', 'SYSTEM: Who is the recipient of this transfer and how much would you like to transfer?', \"USER: Send it to Amy, my brother's wife. Please transfer an amount of $1440. They need to buy a new laptop.\", 'SYSTEM: Please do confirm the following details: transfer from your savings account an amount of $1,440 to Amy in their savings account.', \"USER: That's right.\", 'SYSTEM: The transfer has been successful.', 'USER: Thank you so much! Now I want to watch a movie.', 'SYSTEM: DO you have something in mind?', 'USER: Yes, I want to watch Josie and the Pussycats. I heard its a good movie.', 'SYSTEM: Please do confirm the following details: you would like to play Josie and the Pussycats without subtitles.', 'USER: Yes, you got it correctly.', 'SYSTEM: The movie has started playing.', \"USER: Thanks again! You're such a big help.\", 'SYSTEM: Do you need help with anything else?', 'USER: No,that would be all. Thank you!', \"SYSTEM: You're welcome. Have a great day.\"]\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: My mind is getting out,I think its time for watch a movie starred by Larry Jenkins and directed by Brian De Palma.', 'SYSTEM: What type of movie are you looking for?', 'USER: I always prefer Detective movies, try for that.', 'SYSTEM: There is 1 move for your satisfaction, Body Double. Will it work?', 'USER: Ok go ahead with Body Double.', 'SYSTEM: Do you wish to get movie rented?', 'USER: Fine. I need on rent and with no subtitles.', 'SYSTEM: Then verify the demand; You need Body Double on rent without subtitles.', \"USER: That's it, thank you.\", 'SYSTEM: It is successfully done any you can enjoy in 3 days.', 'USER: How much should I pay?', 'SYSTEM: Charge of rent is $6.', 'USER: Good, thanks for you great help.', 'SYSTEM: Thank you very much, be with us for any help.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I want to find some cool events.', 'SYSTEM: What city would you like to find events in?', 'USER: I want to find events in Livermore.', 'SYSTEM: Do you want to find music or sports events?', 'USER: I want to find a concert.', 'SYSTEM: What about Josh Groban at Concerts at Wente Vineyards tomorrow at 7 pm?', \"USER: Yes, that's great.\", 'SYSTEM: Do you want to purchase tickets?', 'USER: No, now right now.', 'SYSTEM: Have a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I want to eat out today, and would like a reservation at a restaurant.', 'SYSTEM: Please tell me the city in which to search.', 'USER: Please search in SF, for 4 people.', 'SYSTEM: Any preferred restaurant? What time should I reserve it for?', 'USER: Please make a reservation at Limon for the 13th at morning 11:45.', 'SYSTEM: Please confirm that the reservation is for 11:45 am on March 13th, at Limon Rotisserie in San Francisco. It is for 4 people.', \"USER: Yes, that's perfect. Do you have their address, as well as contact number?\", 'SYSTEM: Your reservation has been made. They are on 1001 South Van Ness Avenue. You can reach them on 415-821-2134.', 'USER: Much appreciated.', 'SYSTEM: Is there anything else I can help you with?', 'USER: Nothing else, thanks a lot.', 'SYSTEM: Wishing you a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Hello. I need an apartment. Can you find me a 3 bedroom one in Santa Rosa?', 'SYSTEM: How about Behringer Harvard at 4656 Quigg Drive? It has 3 bedrooms, and also 3 baths. Its rent costs you $4,050 a month.', 'USER: Okay, sounds good.', 'SYSTEM: Want to visit it?', \"USER: Yes. I'd like to visit it on the 9th of this month.\", 'SYSTEM: You want to visit Behringer Harvard on March 9th?', 'USER: That is correct.', 'SYSTEM: I have scheduled your visit to there.', \"USER: Thanks! I'd like to put down as an event on my calendar.\", 'SYSTEM: At what time will it be on?', 'USER: I want this Property appointment event to happen at 1 in the afternoon.', 'SYSTEM: Okay. You want me to add the event Property appointment to your calendar with a time of 1 pm on March 9th and a location of 4656 Quigg Drive?', \"USER: Yes, that's accurate.\", 'SYSTEM: I have added the even to your calendar.', 'USER: Thanks for helping me out. I need nothing else from you right now.', 'SYSTEM: Have a great day!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I need a bus leaving from Sacramento to SD leaving at half past 10 in the morning.', 'SYSTEM: When are you leaving?', 'USER: On the 6th of this month.', 'SYSTEM: How many tickets?', 'USER: I need 1 ticket leaving from Long Beach.', 'SYSTEM: Please confirm, leaving Long Beach to San Diego on March 6th at 10:30 am for 1 person.', 'USER: Yes, that is correct.', 'SYSTEM: Your ticket is confirmed.', 'USER: I need a rental care from March 8th to March 14th.', 'SYSTEM: Are you picking it up in San Diego?', 'USER: Yes.', 'SYSTEM: At what time?', 'USER: Afternoon 2.', 'SYSTEM: I found a standard car, like an Accord, at Santa Fe Depot on March 8th.', 'USER: That sounds good. Reserve this car.', 'SYSTEM: Please confirm, picking up a standard car at Santa Fe Depot on March 8th at 2 pm. The drop off date is March 14th.', 'USER: Yes, that is good. What is the total cost?', 'SYSTEM: Your car is reserved. The total is $156.', 'USER: Thanks, that is all.', 'SYSTEM: Have a nice day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Can you find me a compact rental car for the 7th of this month?', 'SYSTEM: Sure. Where and when did you want to pick it up and when did you want to return it?', \"USER: I'd like to pick in up in SF around 10:30 and return it on the 12th of this month.\", \"SYSTEM: There's a Cooper, a nice compact car available for pick up March 7th at SFO International Airport.\", 'USER: Are there any others?', 'SYSTEM: Another nice compact car is a Forte which is available March 7th also at SFO International Airport.', 'USER: That sound more to my liking.', 'SYSTEM: Did you want to reserve it?', \"USER: Not just now. I'd also like to find a bus to get to San Fran.\", 'SYSTEM: Where are you leaving from? Did you want to leave March 7th?', \"USER: No make it the 1st of March. I'm leaving from Vegas.\", 'SYSTEM: I found one for $55 with 0 transfers that leaves at 10:50 am.', 'USER: What station does it leave from and where does it arrive.', \"SYSTEM: You'll leave from Union Plaza and arrive at Salesforce Transit Center.\", 'USER: That would work.', 'SYSTEM: Did you want to buy tickets?', \"USER: Not yet. I'd also like to check on one way economy flights. I will be checking 0 bags.\", 'SYSTEM: Did you still want to leave March 1st?', 'USER: No check on March 6th.', 'SYSTEM: I found 4 flights. American Airlines has one for $116 with 0 layovers that leaves at 6:50 am.', \"USER: Good to know. That's all I need for now.\", 'SYSTEM: Have a great day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": ": ['USER: Can you help me book a rental car?', 'SYSTEM: Where and when will you get it?', \"USER: I'll need it at 10:30 in KL.\", 'SYSTEM: What are your pickup and drop off dates?', 'USER: From the 10th of this month until the 14th of this month.', 'SYSTEM: I found 4 cars that may work. How about a standard Honda Accord available for pickup at KLIA International Airport on March 10th?', 'USER: Any other standard cars?', \"SYSTEM: There's a standard Honda Civic available at KLIA International Airport on March 10th.\", \"USER: Let's get that car.\", \"SYSTEM: Sure, I'll book it when you confirm you'd like to pickup a standard car on March 10th at 10:30 am from KLIA International Airport with a drop off on March 14th at the same location.\", \"USER: Yes, that's correct.\", \"SYSTEM: I've reserved your car.\", 'USER: Thanks, and can you help me with a hotel room?', \"SYSTEM: I found 10 hotels you may like. There's a 5 star one called Alila Bangsar.\", \"USER: I'll look into it later. That's all I need for now.\", 'SYSTEM: Have a great day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Is there a movie I can watch you can find for me?', 'SYSTEM: May I know your current location.', 'USER: Sure, its Milpitas, so are there any movies you can find in this city?', 'SYSTEM: I found a couple movies, what about Brittany Runs A Marathon, Good Boys, or Hobbs and Shaw?', 'USER: Any other movies you can find, perhaps a movie showing in Rohnert Park?', 'SYSTEM: There are 3 movies you may be interested in, may I recommend Hustlers, IT Chapter Two, or The Angry Birds Movie 2?', 'USER: I think The Angry Birds movie sounds like a good movie to watch, can you search for some songs for me to listen to right now, something popular?', 'SYSTEM: Would you like to listen to Acapella by Karmin from their Pulses album?', 'USER: Anything else you can find?', 'SYSTEM: How about African Beauty from the A Boy From Tandale album, this song is sung by Diamond Platnumz.', 'USER: Any other songs you can recommend for me?', 'SYSTEM: I can also recommend Airplane Mode by Limbo, from their Holo album.', \"USER: Was this song released in '15?\", 'SYSTEM: The song was actually released in the year 2017.', 'USER: Alright good, play this song and cast it on the speaker in patio.', 'SYSTEM: The song Airplane Mode will now play in the patio.', 'USER: That is correct, thanks for the help.', 'SYSTEM: Airplane Mode is now playing, hope you enjoy it.', 'USER: Thanks for the help, I really appreciate it!', 'SYSTEM: Will that be all for today, or may I help you with anything else?', 'USER: That is all for today, thank you!', 'SYSTEM: Your welcome, have a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I am looking for a train', 'SYSTEM: when are you traveling? where are you going to and depart from', 'USER: I am traveling from anaheim and to los angeles on march 13th', 'SYSTEM: what about departure at 6:30 am for $34', 'USER: what station does this arrive from and at', 'SYSTEM: you will be leaving from anaheim intermodal center and arrive at union station', 'USER: what other train can you find', 'SYSTEM: what about 6:40 am departure for $35', 'USER: this is perfect, please book 1 value ticket for me', 'SYSTEM: please confirm 1 value ticket from anaheim to los angeles on march 13th at 6:40 am', 'USER: this is fine. where does the train arrive at', 'SYSTEM: you will arrive at union station', 'USER: thats perfect. I am also looking for something fun to do', 'SYSTEM: please name something. you can say music or theater', 'USER: i want some broadway', 'SYSTEM: What about A year in dragonfly at studio c artists on march 1st at 7:30 pm', 'USER: where is this located and how much is the ticket', 'SYSTEM: this is locaed in 6448 california 2 and the ticket is $55', 'USER: perfect, can you share this location', 'SYSTEM: who do you want me to share the location with', 'USER: please share with rachel', 'SYSTEM: please confirm to share studio c artists with rachel', 'USER: yes that is correct', 'SYSTEM: location has been shared', 'USER: thank you for your help', 'SYSTEM: what else can i do for you', 'USER: no that is all i need', 'SYSTEM: have a great day']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I would like to see all of the alarms that I have set as of this time.', 'SYSTEM: You have 2 active alarms at this time. One alarm is titled Wake up and it is set for 7:30 am', 'USER: And can you tell me if there are additional alarms?', 'SYSTEM: You also have an alarm titled Workout that is set for 8:30 am', 'USER: Excellent. Can you please add a new alarm for 4:45 in the evening and label it Music practice?', 'SYSTEM: Okay, you would like to add a new alarm for 4:45 pm with the name Music practice, correct?', 'USER: That is correct.', 'SYSTEM: that alarm has been created.', 'USER: Great. Thanks so much!', 'SYSTEM: Do you need my assistance with anything further?', 'USER: No, that was all for me. Thanks!', 'SYSTEM: Have a nice day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I need to book a bus ticket, can you find me a seat?', 'SYSTEM: Sure. Where are you going? When are you leaving?', \"USER: I'd like to get four tickets from San Fran to Sacramento, CA on the 12th of March.\", 'SYSTEM: Okay, the bus leaves at 7:20 am and costs $22 per person, it has 0 transfers.', \"USER: That's great, I'm done now.\", 'SYSTEM: Okay, enjoy your trip.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Find a train for me please.', 'SYSTEM: In what date you plan to travel?', 'USER: Find me tickets for March 6th.', 'SYSTEM: From which city you want to depart?', 'USER: I want tickets form Seattle.', 'SYSTEM: In which city you go?', \"USER: I'm going to Portland, OR.\", 'SYSTEM: 10 trains can be okay for you.How about the train that depart at 8 am and cost $59 in total.', 'USER: Sounds good.find me something interesting to do on the 14th.I enjoy Songs.', 'SYSTEM: I have 6 options that you may like.A very popular options is Bastille and is take place at Theater Of The Clouds on March 14th at 5 pm.', 'USER: Sounds okay but find me something else, please.', 'SYSTEM: A very popular event is Bryan Adams at Theater Of The Clouds on March 14th at 7 pm.', 'USER: Tell me the location and the cost for one ticket.', 'SYSTEM: 1016-1098 North Center Court Street is the location and the cost is $55.', 'USER: This are okay but find me something else.', 'SYSTEM: Very popular is Dave Alvin Oregon at The Old Church Concert Hall on March 14th at 7 pm.', 'USER: Sounds great for me.', 'SYSTEM: You want to buy thickets ?', \"USER: No,right now I don't want that.Find me some child-friendly attractions there.I would like a Historical Landmark.\", 'SYSTEM: You should check out a Historical Landmark called St. Johns Bridge.', 'USER: Nice,Any other you can find?', 'SYSTEM: I am sorry but others cannot find according to your requirements.Something else you need?', 'USER: Try please again.I would like a Museum without an entry fee.', 'SYSTEM: You should check a Museum called Pittock Mansion.', 'USER: Tell me the phone number.', 'SYSTEM: 503-823-3623 is their phone number.', 'USER: Great.Find for me a house to say there.', 'SYSTEM: A nice house with rating 4.1 located at 1000 Northeast Multnomah Street.', 'USER: Something else you have with laundry service?', 'SYSTEM: 9 house I have for you.A nice house with rating 4.5 located at 1150 Northwest 9th Avenue.', 'USER: Something else you have for one people?', 'SYSTEM: 8 houses I have for you.A nice house located at 11518 Northeast Glenn Widing Drive with rating 4.2.', \"USER: I like this house.That's all for now.\", 'SYSTEM: Happy to help!Bye.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I have the 14th of March off work and would like to find something to do.', 'SYSTEM: I can help you with that but first is there a specific type of an event you would like me to look into for you?', \"USER: Yes, I really like sports events and haven't been able to make one yet this year.\", 'SYSTEM: Okay, and what about the location of the event?', \"USER: I would prefer something far away from the office so I don't run into any co-workers. Let's start looking in Philadelphia.\", 'SYSTEM: The first of 3 events that I was able to find matching your criteria is the Eagles Vs Cowboys game playing at Lincoln Financial Field.', \"USER: Let's look for something else on the 9th of this month instead.\", 'SYSTEM: How about the Owls Vs Bison game playing also playing at the Lincoln Financial Field?', \"USER: No, let's try baseball games instead.\", 'SYSTEM: The Phillies Vs Braves game will be playing at Citizens Bank Park, does that sound good?', 'USER: Maybe, what it the address of the location and what time does the game start?', 'SYSTEM: The game is located at 1 Citizens Bank Way and begins at 7:30 pm.', \"USER: Okay, let's check the balance in my checking account first to make sure I have enough funds for the tickets.\", 'SYSTEM: The current balance in your checking account is $1,470.87.', 'USER: Great!', 'SYSTEM: Did you need assistance transferring funds or paying any bills?', \"USER: No, I don't need to transfer any money and I'm caught up on all my bills. Thanks for the help and goodbye.\", 'SYSTEM: Have a good day!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I want to listen to some music.', 'SYSTEM: Sure. I see 10 songs that you might enjoy. How about Dean Town from the Vulfpeck album The Beautiful Game?', \"USER: I'm not a big Vulfpeck fan. Do you have anything else?\", 'SYSTEM: How about All On Me from the Devin Dawson album Dark Horse?', \"USER: I've never heard of that one. What genre is it?\", \"SYSTEM: It's Country music.\", 'USER: I hate country. Anything else?', 'SYSTEM: How about He Is from the Ghost album Meliora?', 'USER: Ghost? Never heard of him. What genre is the song?', 'SYSTEM: It is Rock music.', \"USER: Okay, I'll give it a shot.\", 'SYSTEM: Should I start playing the song now?', 'USER: Yeah. Set it to the kitchen device.', 'SYSTEM: You want to hear He Is from your kitchen speaker?', \"USER: Yeah, that's right.\", 'SYSTEM: Your music is now playing.', 'USER: Thanks a lot.', 'SYSTEM: Is there anything else I can help with?', 'USER: Nothing else, thanks.', 'SYSTEM: Enjoy the rest of your day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: I would like to choose a movie to watch. Can you help me find a movie in the Comic genre with James Corden in it?', 'SYSTEM: I found 1 movie like that. The film Yesterday has an average rating of 63 percent.', 'USER: Who directed the movie?', 'SYSTEM: The director is Danny Boyle.', 'USER: OK, sounds great, thanks, that is all.', 'SYSTEM: Happy to help!']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I would like to see some tourist attractions.', \"SYSTEM: You're casting a pretty wide net there buddy.\", 'USER: Ok, narrow it down to Seattle, WA.', \"SYSTEM: I see 10 that might be up your alley. There is Brandon Lee and Bruce Lee's Grave Site, a poplular tourist attraction.\", 'USER: Is it free? Should I bring the kids.', 'SYSTEM: Bring them. But its not free.', 'USER: Can you find me 1 room around there?', 'SYSTEM: I see 10 hotels. There is Ace Hotel Seattle with 2 stars.', 'USER: Where they at? Also, wifi.', 'SYSTEM: 2423 1st Avenue. They have wifi.', 'USER: What else do you have?', 'SYSTEM: Belltown Inn. 2 star place.', 'USER: That might hit the spot.', 'SYSTEM: Should I get you a room.', 'USER: Yes, please do.', 'SYSTEM: For what days?', 'USER: From the 10th and for two days.', 'SYSTEM: OK. 1 room for 2 days at Belltown Inn in Seattle, starting on March 10th. Do I have that straight?', 'USER: You got it.', 'SYSTEM: And you got a room.', 'USER: Where they at? And the digits please.', 'SYSTEM: +1 866-525-4704. 2301 3rd Avenue.', 'USER: Excellent. I am all set for now.', 'SYSTEM: Take it easy.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Hi, i need a help, one of my friend will come here to meet me, i need a restaurant to eat, could you find good place to eat?', 'SYSTEM: Sure, i can help you, can you say which type of foods are you looking for, Do you like Italian or indian or anything else? which city should i search in for?', 'USER: i am looking around in Milpitas, I like korean Hot pot', 'SYSTEM: Okay, i have found 3 restaurants for you, One of the best restaurant is Cj House Korean Bbq and it is located in Milpitas.', 'USER: Cool, give me their contact number.', 'SYSTEM: The restaurant contact number is 408-263-6705', 'USER: I am looking for some moderate priced restaurants, Could you find it for me?', 'SYSTEM: Sure, I have found 1 restaurant in Milpitas, The restaurant name is Korea Garden.', 'USER: Yes, it seems good for me, I need to reserve that restaurant.', 'SYSTEM: Okay, please tell me the reservation time?', 'USER: Reserve it at 6:30 in the evening', 'SYSTEM: Please confirm the following details: The restaurant name is Korea Garden and it is located Milpitas, The reservation date is March 1st at 6:30 pm and the reservation is for 2 people.', 'USER: No, Please change the time to 12 pm', 'SYSTEM: Please confirm the following details: The restaurant name is Korea Garden and it is located Milpitas, The reservation date is March 1st at 12 pm pm and the reservation is for 2 people', 'USER: Sorry, i need it on 3rd of this month', 'SYSTEM: Please confirm the following details:The restaurant name is Korea Garden and it is located Milpitas, The reservation date is March 3rd at 6:30 pm and the reservation is for 2 people', 'USER: Yes, you are right.', 'SYSTEM: congratulations, your reservation has been made.', 'USER: Okay, Thank you, Do they serve liquor? Give me their contact number?', 'SYSTEM: Sorry, They do not serve alcohol, The restaurant contact number is 408-946-2222', 'USER: Thank you very much for your help, i need to add this event to my calendar.', 'SYSTEM: Okay,Please tell me which title will give to the event and is the event happening at 1535 Landess Avenue #143?', 'USER: Yes, you are right, Give reservation at Korea Garden as event title.', 'SYSTEM: Please tell me what is the time for the event?', 'USER: The event time is 11:30 am', 'SYSTEM: Please confirm the following details: The event title is Reservation at Korea Garden and The scheduled date for the event is March 3rd, the event location is 1535 Landess Avenue #143 and scheduled time for the event is 11:30 am', 'USER: Yes, you are right.', 'SYSTEM: The event is successfully added to your calendar.', 'USER: Okay, Thank you very much for your help, bye', 'SYSTEM: you are welcome, have a great day, bye']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I want a taxi cab for four.', 'SYSTEM: Where to and would you like a shared ride?', 'USER: Mariscos El Patron and a shared ride is fine.', 'SYSTEM: To confirm then you want a shared ride, cab for 4 to Mariscos El Patron.', \"USER: Yes that's it. How long will the journey take?\", 'SYSTEM: Your cab is booked and will be with you shortly. The journey should be around 13 minutes.', 'USER: Thanks for your help.', 'SYSTEM: Can I assist you with anything else?', 'USER: No thanks for everything.', 'SYSTEM: Have a lovely day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": ": ['USER: I need to book a cab to Superior Palace for one person.', 'SYSTEM: I can help with that, would you be interested in a cab or ride share today?', \"USER: let's try ride share.\", 'SYSTEM: Alright, please confirm a ride share to Superior Palace for 1 person. Is this right?', 'USER: Yes, that is right, find out how long I can expect the ride to be?', 'SYSTEM: Sure, your ride is booked and in route. The ride is about 29 minutes.', 'USER: Great, whats the total suppose to be?', 'SYSTEM: The cost will be $8.29.', 'USER: Thanks, let put on some music while we wait.', 'SYSTEM: Alright, I found 10 songs for your listening pleasure. Ca I recommend the album Ana Keteer by Sherine, there is a great track called Ya Layali.', 'USER: Yeah, that will work perfect. I would like to listen on my kitchen speaker please.', 'SYSTEM: Please confirm we are playing Ya Layali on the kitchen speaker. Is this correct?', 'USER: yes, please play.', 'SYSTEM: Enjoy your selection.', 'USER: Thanks, find out what year this song came out and what kind of music is this?', 'SYSTEM: This is a Pop song from 2014.', 'USER: Thank you!', 'SYSTEM: your welcome. Can I assist you with anything else?', 'USER: Nope. Good Bye.', 'SYSTEM: Alright, Good bye.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: Can you help me find some attractions worth visiting?', 'SYSTEM: Of course! In what city shall I search?', 'USER: Lets try Los Angeles please.', 'SYSTEM: There are 10 things that may be what your looking for. A top rated Historical Landmark is Angels Flight Railway. Any interest in that one?', 'USER: Yes that one sounds good. Can you find me a bus heading there?', 'SYSTEM: What day would you like to go?', 'USER: Check for the 10th please?', 'SYSTEM: What city are you leaving from?', 'USER: I will be departing Anaheim.', 'SYSTEM: There are 10 buses available. One has an Economy ticket for $11 and leaves at 6:10 am.', 'USER: Can you tell me the bus stations please?', 'SYSTEM: It departs from Anaheim Intermodal Center and arrives at Union Station.', 'USER: Yes, that one will work.', 'SYSTEM: Shall I purchase tickets for you?', 'USER: Yes please do.', 'SYSTEM: How many tickets will you need?', 'USER: Just for one person please.', 'SYSTEM: To confirm: You wish to purchase 1 economy bus ticket leaving Anaheim on March 10th at 6:10 am heading to Los Angeles. Is this correct?', 'USER: Yes, sounds great.', 'SYSTEM: Ticket reservation is confirmed. Is there anything else?', 'USER: No thanks. That is all for now.', 'SYSTEM: Have a great day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": "['USER: Can you suggest a movie to me, I want to watch something.', 'SYSTEM: Would you like to watch Blackmail - Cinemix Par Chloe, its average rating is 7.0?', 'USER: Is there anything else?', \"SYSTEM: There's Breakthrough with an average rating of 5.6.\", \"USER: Anything else? What about movies directed by Iain Softley. Or something that's a Drama?\", 'SYSTEM: Would you like to watch Hackers, it has an average rating of 6.2?', \"USER: Who's in this movie?\", 'SYSTEM: John Bair is in the movie.', \"USER: Okay, that's all the help I need.\", \"SYSTEM: I'm glad to have helped you.\"]\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I have a plan to go to some interesting places. I need your help to find the one which is most attractive to watch. Can you find something with free entrance?', 'SYSTEM: Yes. Tell me that you want to search for the interesting places in any particular City?', 'USER: Yes, search it in Mexico City and find the one which should have free entrance.', \"SYSTEM: That's noted. I got 10 places. Do you want to go to a place like a Nature Preserve. If so you can try to visit Acuario Inbursa which is more interested one.\", 'USER: What is their contact number?', 'SYSTEM: They can be contacted by 55 5395 4586.', \"USER: That's great and thanks. Now, find me a SUV model car for rent and book it from the 9th.\", 'SYSTEM: What is your expected pick up time?', 'USER: I want to pick it up at 12:45 pm and book the car up to the date of March 12th.', 'SYSTEM: Do you have any particular place to search for the car Or shall I search it from Mexico City?', 'USER: Search it there and note the new time for pickup is 2 pm.', 'SYSTEM: I got results about 5 cars. What about a SUV Citroen C5 model car available for pickup at Benito Juarez International Airport?', 'USER: Let me know the cost details for one day to decide.', 'SYSTEM: It is around $32.00 for one day. Is it okay?', 'USER: No, search for some other cars.', 'SYSTEM: Okay, what about the car available at Benito Juarez international Airport and the same is SUV GMC Terrain model. Do you like to choose this car?', 'USER: No, please find some other cars which should be a comfortable one to me.', 'SYSTEM: Then you can try a SUV Jaguar F-Pace model Car available at Estacion Buenavista.', \"USER: that's great and I want to book this car.\", 'SYSTEM: Shall I book it with insuarnce?', 'USER: No, book it without insurance.', 'SYSTEM: I need your confirmation once again to book a SUV model Car available at Estacion Buenavista from March 9th to March 12th and the pick up time is at 2 pm without insurance.', 'USER: That is confirmed to proceed.', 'SYSTEM: I have booked the car successfully.', 'USER: Thanks for help. and also help me to share the location.', 'SYSTEM: Do you want to share the location Estacion Buenavista? and To Whom you want to share it?', 'USER: Yes, the address is correct. Share it with Alan.', 'SYSTEM: Please confirm to share the location Estacion Buenavista with Alan.', 'USER: confirmed and you can go ahead.', 'SYSTEM: Successfully shared the location.', 'USER: Thanks so much.', 'SYSTEM: Anything else you want from me?', 'USER: Nothing for now and thanks for everything.', 'SYSTEM: Its my pleasure. Have a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I need help locating some attractions to go to.', 'SYSTEM: In what city?', 'USER: In Seattle please.', \"SYSTEM: I have 10 events you might like. Brandon Lee and Bruce Lee's Grave Site is a tourist attraction.\", 'USER: How about soccer games? I want to go on the 1st.', 'SYSTEM: Sounders Vs Timbers are playing at CenturyLink Field.', 'USER: Where and when please?', \"SYSTEM: That's at 6:30 pm at 800 Occidental Avenue South.\", 'USER: Sounds like a good one.', 'SYSTEM: How else may I help you?', 'USER: I need a house to stay in, as well.', 'SYSTEM: I have a house rated 4.5 at 1000 1st Avenue.', 'USER: What else do you have?', \"SYSTEM: There's a house rated 3.9 at 1006 Spring Street.\", \"USER: That's a good one.\", 'SYSTEM: Would you like to reserve it?', 'USER: Not yet, thanks.', 'SYSTEM: What else may I help you with?', 'USER: I need a bus.', 'SYSTEM: Leaving from where?', 'USER: Going from Vancouver.', 'SYSTEM: Departing on March 1st?', 'USER: Yes, sounds good.', \"SYSTEM: I have 10 options for you. There's a $30 economy ticket with a 6:40 am departure.\", 'USER: Sounds good, thank you.', 'SYSTEM: Would you like to buy tickets?', 'USER: Not right now.', 'SYSTEM: Anything else today?', 'USER: No, not right now.', 'SYSTEM: Thank you very much.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": " ['USER: I would like to watch a movie online.', 'SYSTEM: What type of movie would you like to watch?', 'USER: I would like to watch a Action movie.', 'SYSTEM: There are 5 movies. There is Angel has fallen, hobbs and shaw or mission mangal?', 'USER: I would like more options.', 'SYSTEM: There is Riot Girls and Saaho.', 'USER: Saaho sounds good. Can you play it with French subtitles.', 'SYSTEM: Playing Saaho with subtitles in French.', 'USER: Yes, that sounds good.', 'SYSTEM: The movie is now playing.', 'USER: I would like to know how the weather is on the 14th in Sonoma.', 'SYSTEM: The day will be 88 degrees and there is a 25 percent chance of rain.', 'USER: How windy is the day going to be?', 'SYSTEM: The wind should be around 12 miles per hour.', 'USER: That is all I needed.', 'SYSTEM: Have a good day.']\n", "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}]