[{"SNG02296.json": ["USER: Hi, I need a taxi to gourmet burger kitchen going from hamilton lodge!", "SYSTEM: When would you like to get there by?", "USER: I want to leave after 4:00.", "SYSTEM: When would you like to arrive?", "USER: It doesn't matter, I just want to leave after 4:00.", "SYSTEM: Booking completed! Booked car type : grey ford Contact number : 07789662806", "USER: Thank you so very much. I am finished.", "SYSTEM: Thank you for contacting the Cambridge TownInfo centre!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL3012.json": ["USER: Hello, I am doing research on plant life in England, and visiting cambridge as part of that, can you give me more info on the cambridge university botanic gardens.", "SYSTEM: That sounds like an exciting trip! Cambridge University Botanic Gardens is located in the centre of town on Bateman Street. Its admission fee is 4 pounds.", "USER: That sounds perfect for what I am looking for. Can you tell me what type of attraction that is considered?", "SYSTEM: There is a beautiful park uniquely decorated with well scented flowers i bet you might have never seen. Do you want to buy an entrance ticket for that?", "USER: Uh...no thanks. Can you help me find a train going to Stevenage?", "SYSTEM: Where you will be traveling from and when would you like to leave?", "USER: The train should leave after 09:30. depart from cambridge and should leave on tuesday", "SYSTEM: The earliest train after that time is TR6009. It departs at 11:21 and arrives in Stevenage at 12:10. Would that work or do you prefer a later train?", "USER: That sounds fine. How long will the travel time be?", "SYSTEM: The travel time is 49 minutes. Would you like a ticket?", "USER: Yes, Please book me a round trip ticket and can you locate a cheap diner.", "SYSTEM: What type of food would you like?", "USER: I do not need a ticket booked. I do not need anything else. Thank you.", "SYSTEM: Are you sure you don't need anything else?", "USER: No that is it. Thank you.", "SYSTEM: Ok. thank you and goodbye"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0452.json": ["USER: I am looking for a train to cambridge that should arrive by 13:30.", "SYSTEM: On what day would you like to leave?", "USER: I would like to leave on sunday please.", "SYSTEM: OK, and what's your departure station?", "USER: I'm departing from stansted airport.", "SYSTEM: I have TR5358 arriving in Cambridge by 12:52. Would you like me to book it?", "USER: Yes Please. I am also looking for places to go in town.", "SYSTEM: I'm happy to help. Do you have any preferences for the type of attraction you would like to visit?", "USER: I'd like to visit a college in the centre. I'd like the entrance fee, address and phone number, as well, please.", "SYSTEM: Corpus christi is in the centre, the address is king's parade and has an entrance fee of 2 pounds. Their phone is 01223338000. Would you like to hear about any others?", "USER: No, thank you and have a good day!", "SYSTEM: Okay. Thank you for calling!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL4467.json": ["USER: i'm looking for el shaddai", "SYSTEM: The el shaddai is a guesthouse in the centre area. Would you like to make a booking today?", "USER: Yes I would love that. I need to book it starting on Saturday for 4 nights for 4 people.", "SYSTEM: Great choice! Your booking went through without a hitch. Here is your reference number 9NXGN689 . Can I do anything else for you?", "USER: Yes, I need a entrance fee and area", "SYSTEM: I'm not sure I understand. The El Shaddai is considered a cheap guesthouse in the centre part of town. Were you looking for an attraction?", "USER: Yes I am looking for a nightclub.", "SYSTEM: Would you prefer centre or south area?", "USER: It doesn't matter, pick one for me and I'll need the area and entrance fee please.", "SYSTEM: Club Salsa is a really cool hot spot. They are located in the centre of the city and it's only 5 pounds per person to get in!", "USER: Thank you. That is all for now. Thanks for your help.", "SYSTEM: I'm happy to be of service, and thank you for using the Cambridge TownInfo Centre!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1113.json": ["USER: Hi, I want to visit a museum.", "SYSTEM: There are several museums in the Cambridge area. Is there a certain area of town you prefer?", "USER: Any area is fine. Perhaps the centre area if there is a good one there.", "SYSTEM: i recommend primavera. it is located 10 king s parade, cb21sj. do you need the phone number?", "USER: yes phone number and postcode,thank uyou", "SYSTEM: The phone number is 01223357708 and the postcode is cb21sj. Is there anything else you'd like me to do for you?", "USER: As a matter of fact yes. I need a train that leaves after 13:15 on Saturday", "SYSTEM: What will your destination be?", "USER: I will be coming from Kings Lynn to Cambridge.", "SYSTEM: TR9346 leaves at 14:11. Want to book?", "USER: Yes please book that for 8 people.", "SYSTEM: Ok, the booking was successful, the total fee is 62.72 GBP payable at the station . Reference number is : P1J7RWHQ . Can I help with anything else?", "USER: No, that will be all for today. Thanks for your help today. It's been appreciated.", "SYSTEM: You're welcome, have a great day."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0354.json": ["USER: Hello, can you tell me about the options for moderately priced dining in Cambridge that are centrally located?", "SYSTEM: Yippee Noodle Bar (asian oriental), Restaurant One Seven (british), and The Oak Bistro (british) are all nearby", "USER: Are there any that serve Irish food?", "SYSTEM: No, sorry, there aren't any serving Irish food.", "USER: Perhaps a gastropub?", "SYSTEM: The cow pizza kitchen and bar would meet your request for gastropub. Would you like to book it?", "USER: Can I have the address for cow pizza kitchen please?", "SYSTEM: The address is Corn Exchange Street.", "USER: Thank you, I'm also looking for a train that leaves after 20:00 on a Friday.", "SYSTEM: There are several trains that depart on Friday after 20:00, where are you traveling from and to?", "USER: I'm traveling from cambridge to stansted airport.", "SYSTEM: There are 4 trains that will work for you - leaving 20:40, 21:40, 22:40, and 23:40. Would you like to book one of those?", "USER: Yes, can I book the 20:40 train for three people?", "SYSTEM: Booking was successful, your reference number is N9PDDWD8 . You pay at the station 30.29 GBP.", "USER: Great, thanks for your help.", "SYSTEM: You're welcome, thank you for using our service today."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0051.json": ["USER: I need to find a hotel in Cambridge that's moderately priced. I don't need to have free parking included for my stay.", "SYSTEM: There are four possibilities, one is a hotel and the others are guesthouses. Do you have a preference for one or the other?", "USER: I do not. Are any of those places located in the centre?", "SYSTEM: Only one is located in the centre. The cityroomz which also has free wifi. Would you be interested in booking this hotel?", "USER: Yes, that sounds splendid. I would like to book a room there for 6 people for 2 nights, and I would like the reference number, please.", "SYSTEM: What night would you like to begin your stay?", "USER: I would like to stay starting Tuesday night", "SYSTEM: I have booked the cityroomz hotel for 2 nights, starting this Tuesday, for 6 people.", "USER: That is great! How much?", "SYSTEM: I apologize I don't have the price. It is in the moderate price range however.", "USER: I see. That sounds great. Thank you. Could I get a reference number please?", "SYSTEM: Your reference number is : EB05KFXV . Will there be anything else today?", "USER: I also need a restaurant that serves turkish food please.", "SYSTEM: There are three Turkish restaurants, all in the center of town. The Meze Bar is expensive, but the other two are more moderate. Would you like to book a table?", "USER: the meze bar is fine. book it for 6 at 14:15 on tuesday", "SYSTEM: Your table will be reserved for 15 minutes. The reference number is XZX9AGML .", "USER: Thank you so much!", "SYSTEM: You are welcome. Have a nice day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL1900.json": ["USER: I'm looking for a theatre on the west side of town.", "SYSTEM: I'm sorry, there are no theatres located on the west side of town. Would you like to try a different area?", "USER: How about a museum instead?", "SYSTEM: We do have seven museums in that area. Are you looking for one that has free admission?", "USER: That's not necessary, but I would like to know what the entrance fee and phone number for a good one is.", "SYSTEM: Hi the phone number to the cafe jello gallery is 01223312112 and it is free.", "USER: Great. Can you also help with a train? I need to get to Kings Lynn by 16:15.", "SYSTEM: Absolutely. First, can you confirm you are departing from Cambridge, and the day you desire?", "USER: Yes, departing from Cambridge on Tuesday.", "SYSTEM: I have the TR8808, that arrives in kings lynn by 15:58. Would you like me to book this for you?", "USER: Book it for 4 please.", "SYSTEM: You are all set. Your reference number is 4NQ9WPKL, the total is 39.2 GBP and is payable at the station.", "USER: ok thank you so much!", "SYSTEM: you're welcome. thank you"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0869.json": ["USER: What Chinese restaurants are there in the center of town?", "SYSTEM: There are 10 Chinese restaurants in the centre of town. Would you like a moderately priced one or an expensive one? We have a few cheap.", "USER: I'd like an expensive one please.", "SYSTEM: I have found tang Chinese which is here in the centre. Would you like to start a reservation?", "USER: Yes, please book a table for 4 people at 16:15 on Friday and send me the reference number once it is booked.", "SYSTEM: I've made your reservation at Tang Chinese for 4 at 16:15, reference #D6G7VSV0 . Will that be all?", "USER: Actually I'd also like suggestions on areas to visit at the center of town", "SYSTEM: There's a church called all saints church you could visit, it's listed under architecture.", "USER: Can I get the address and entrance fee.", "SYSTEM: The address is Jesus Lane, and there is no entrance fee. Is there anything else I can assist you with today?", "USER: Yes. Can you help me book a taxi so I can get to the restaurant on time.", "SYSTEM: Yes, I reserved a Red Tesla for you. The contact number is 07612290033. Is there anything else I can help with?", "USER: Will the Red Tesla get me to the restaurant for my 16:15 reservation?", "SYSTEM: Yes, your taxi will pick you up at all saints church and arrive at tang chinese by 16:15. Is there anything else I can do for you today?", "USER: Ok sounds great. That's all I need. Thank You!", "SYSTEM: You are very welcome. Enjoy your time in Cambridge."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL2612.json": ["USER: Hi. I will be coming to Cambridge soon and I want to do a little planning first. I have read about different things to do and places to see.", "SYSTEM: Yes, there is so much here. You'll like it. Can I find something in particular for you?", "USER: I'm looking for an architecture attraction, please.", "SYSTEM: all saints church is located in the centre and has fabulous architecture!", "USER: Is there a fee to get in there?", "SYSTEM: There is not a fee for All Saints Church, would you like more information about it?", "USER: No that is great. I do need a place to stay however.", "SYSTEM: Okay! Did you have a particular area or price type you were looking for?", "USER: I am looking for an expensive guesthouse in the north with free parking.", "SYSTEM: I am sorry but I can't find any guesthouses that meet your criteria. Could you use a different price range?", "USER: Please try one with a moderate price range.", "SYSTEM: How about the arbury lodge guesthouse?", "USER: That sounds great! Thank you for helping me with this! And have a great day.", "SYSTEM: i wasn't going to book it for you?", "USER: Yes, please book it for 6 people for 2 nights starting on Saturday.", "SYSTEM: You are booked as requested for Arbury lodge guesthouse, the reference number is E54BAG41, can I assist with anything else?", "USER: I also need a taxi and would like to leave the hotel by 9:30.", "SYSTEM: Sure! What is the destination for the taxi?", "USER: The All Saints Church.", "SYSTEM: Thank you very much, I have booked you for a white tesla at 09:30. The contact number is 07369590593. Is there anything else I can do for you?", "USER: No, you've done enough. I appreciate the help.", "SYSTEM: You're welcome. I'm glad I could help. Have a nice day."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0673.json": ["USER: I am looking to book a place to stay in Cambridge with free wifi with a moderate price range, can you help me with that?", "SYSTEM: Yes I have many options. Do you have preference for what part of town you stay in?", "USER: No preference. I'm looking for a 4 star and guesthouse type.", "SYSTEM: The acorn guest house is located in the north area and has free internet and parking. Would you like me to book this for you?", "USER: What is the address and phone number?", "SYSTEM: the phone number is 01223315702 and this is address. zipcode-cb12dp 124 tenison road.", "USER: I also need a train to Leicester on Monday. Can you help?", "SYSTEM: What is your departure site and time?", "USER: The train should depart from cambridge and should leave after 12:45.", "SYSTEM: Train TR6799 leaves Cambridge at 13:21 and arrives in Leicester at 15:06, and is 37.80 pounds. Would you like me to book this for you?", "USER: Yes, for 5 tickets please.", "SYSTEM: I have booked 5 tickets for you, your reference number is BEDWHGFA . Is there anything else I can do for you today?", "USER: No that's all, thanks!", "SYSTEM: Thank You for using our service, have we met all of your needs?", "USER: Yes, thank you so much for all of your help. Have a nice day.", "SYSTEM: You're very welcome, thank you. You have a nice day as well.", "USER: Alright, if that's everything I'm going to close the dialogue, thanks again!", "SYSTEM: And, again, you are welcome."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL2778.json": ["USER: Hi, can you give me some information on places to stay on my trip?", "SYSTEM: I can we have 33 places to stay, do you have any pricerange or area you'd like to stay?", "USER: I'd like one in the expensive price range that includes free wifi.", "SYSTEM: The University Arms Hotel is very nice and includes free parking as well as wifi. Does that sound good?", "USER: Sounds good, could you book me a room for three people for three nights starting Thursday?", "SYSTEM: I have made a booking here is the information-Booking was successful. Reference number is : VPNP1BF0 .", "USER: Great, thank you. I'm also looking for a college to visit in the centre, do you have any recommendations?", "SYSTEM: Certainly. There are 13 located in the centre. Are you wanting one that has free admission?", "USER: Yes, free admission would be nice.", "SYSTEM: Christ's College is in the centre and has free entrance fee.", "USER: Thank you. Can you tell me their post code please?", "SYSTEM: The post code for Christ's College is cb23bu.", "USER: Awesome, thanks for your help! I'm finished now, bye!", "SYSTEM: Your very welcome."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0177.json": ["USER: Hi, I need a hotel that includes free wifi in the north of Cambridge.", "SYSTEM: Yes I have many listings for that type of hotel,if you tell me your price range I can narrow down your options.", "USER: Hotel doesn't need to have free parking. I don't care about price range.", "SYSTEM: The avalon is a moderately priced guesthouse-type that matches your criteria.", "USER: What is the postcode, price range, and address?", "SYSTEM: The postcode for the Avalon is cb43pd, it is moderately priced hotel, and it is located at 62 gilbert road.", "USER: Thank you so much. I am also looking for information on a place to dine in the same area of the hotel. I would prefer international food.", "SYSTEM: Unfortunately there are no matching restaurants in the North. Would you like to try a different type of cuisine, or a different area?", "USER: Maybe... are you sure there is no cheap international food in the north?", "SYSTEM: No I am sorry there are no locations I have found. Is there anything else I can help you with?", "USER: Since there is no cheap international restaurants, is there any Italian restaurants?", "SYSTEM: There is one, Da Vinci Pizzeria, would you like to book that?", "USER: Hold off on booking. Could you give me the address and phone number for it?", "SYSTEM: Sure, da vinci pizzeria is located at 20 Milton Road Chesterton postcode cb41jy, phone 01223351707. Can I help you with anything else?", "USER: No that should be all thank you", "SYSTEM: Thank you, goodbye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL1870.json": ["USER: I am looking for a swimming pool to visit on the north side of town. Can you help me with that?", "SYSTEM: There are two swimming pools in the north, Jesus Green outdoor pool and Kings Hedges Learner pool. Would you like the addresses?", "USER: No, just the entrance fee please. I think I am more interested in Kings Hedges.", "SYSTEM: I don't have the entrance fee listed here.", "USER: Do you have any contact information for these pools I could have to get the entrance fee?", "SYSTEM: Yes, their phone number is 01223353248", "USER: Thanks. I also need to get some information on trains for Saturday. London Liverpool St to Cambridge.", "SYSTEM: To narrow down the search, do you know what time you want to leave or what time you want to arrive by?", "USER: Yes, I'd like to arrive by 20:00 if possible.", "SYSTEM: I have a train that arrives at 19:07. Would you like me to book it for you.", "USER: I'd like to have the train ID and the travel time please.", "SYSTEM: The Train ID is TR8530 and it will leave at 17:39. Would you like me to book that for you?", "USER: What's the travel time?", "SYSTEM: The travel time is 88 minutes.", "USER: Can I get the travel time for that?", "SYSTEM: Yes. The travel time is 88 minutes. Is there anything else I can help you with today?", "USER: NO, that will be it. Thank you", "SYSTEM: You're welcome."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL3425.json": ["USER: Hello, I am looking for a train to cambridge that arrives by 17:15.", "SYSTEM: We'll find you something. Where are you departing from?", "USER: I am departing from London Kings Cross on Monday.", "SYSTEM: I have train TR9114 that leaves at 15:17 and will get you into Cambridge by 16:08. Would that work for you?", "USER: that is fine. get me the travel time", "SYSTEM: The travel time for the TR9114 is 51 minutes. Is there anything else I can help you with?", "USER: Yes, I'm also looking for an expensive restaurant in the center of town.", "SYSTEM: i have 33 expensive restaurants in the centre of town. what type of food would you like?", "USER: The type of food is not important, but I need one that can seat 8 people at 21:00. Can you make a suggestion?", "SYSTEM: I would recommend the Cambridge chop house. It serves British food. Would you like me to try to make a reservation?", "USER: Yes please. I need it to be for 8 people at 21:00 on Monday.", "SYSTEM: Booking was successful. The table will be reserved for 15 minutes. Your reference number is : 4DH6BKJO . Can I help you with anything else?", "USER: thank you so much for all of your help you have been great!", "SYSTEM: My pleasure! Enjoy your trip."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG0095.json": ["USER: Hi, I'm looking for a taxi. I need to leave from Golden House at 12:15.", "SYSTEM: Sure, can I have the destination for your taxi please?", "USER: I'm headed to the soul tree nightclub.", "SYSTEM: I have booked a taxi for you. It is a blue ford and the contact number is 07710275202. Is there anything else I can help you with today?", "USER: No, you have been very helpful. Thank you.", "SYSTEM: Have a nice day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL3328.json": ["USER: i'm looking for christ's college", "SYSTEM: Christ's College is located in the centre on Saint Andrew's Street and has no admission fees. What else can I help with?", "USER: May I have the postcode ?", "SYSTEM: The postcode is CB23BU. Is there anything else I do for you?", "USER: i am also looking for a 4 star place to stay with free wifi", "SYSTEM: There are several to choose from, do you know what area of town you would like to be?", "USER: I don't care where but I would also like free parking. Oh, and i would prefer a guesthouse.", "SYSTEM: There are quite a few guesthouse, do you have a preference as to how much you'd like to pay?", "USER: Anything that's cheap?", "SYSTEM: How about the autumn house? It's cheap and has a four star rating.", "USER: That sounds great. Could I get the phone number please?", "SYSTEM: The phone number is 01223575122.", "USER: I need to book a room for friday for 4 people 5 nights", "SYSTEM: Booked! Reference number is : GT087GTU .", "USER: I did not tell you when I want to stay.I want it from Friday on.", "SYSTEM: Yes, I understood you to say for friday for 4 people 5 nights is that correct? Is there anything else I can help you with today?", "USER: Ok, thank you that will be all for today.", "SYSTEM: Okay. Please let us know if we can help you with anything else."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL0575.json": ["USER: I'm looking for a restaurant called nandos city centre", "SYSTEM: Yes, it is located at 33-34 Saint Andrews Street cb23ar.", "USER: i want to book a table for 5 people at 14:00 on Sunday. i need the reference number.", "SYSTEM: Booking was successful. The table will be reserved for 15 minutes. Reference number is : CGXD71ZM . What else may I help with?", "USER: i also want a train which leaves after 17:30 on monday", "SYSTEM: what will be your destination and where are you leaving?", "USER: i'm trying to get to peterborough. i can leave any time after 17:30", "SYSTEM: There is a train departing Cambridge for Peterborough at 17:34 on Monday. This would be the earliest train. Shall I book this?", "USER: Yes, I will need it for 5.", "SYSTEM: Booking was successful, the total fee is 82.5 GBP payable at the station. Reference number is : 76ZSD1E8 .", "USER: Thanks for your help>", "SYSTEM: You're welcome. Will that be all for today?", "USER: That will be it! Thank you so much!", "SYSTEM: Well, you're welcome! You have a good day now!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0706.json": ["USER: I need a place to stay in West Cambridge,and it must include free parking.", "SYSTEM: There are four options available. Do you have a particular price range in mind?", "USER: No but it does need to be a hotel and I need to have free WiFi please.", "SYSTEM: I still am showing 4 entries. Do you have a preference for stars?", "USER: I don't have any preference. What are the options?", "SYSTEM: Finches Bed and Breakfast, Hobsons House, Hunting Marriott Hotel, and The Cambridge Belfry are available.", "USER: Please book Finches for three days starting on Saturday.", "SYSTEM: Alright, just one guest?", "USER: Never mind. Can I get the star rating, price, and phone number for Finches instead?", "SYSTEM: Finches has 4 stars and is cheap. Their phone number is 01223276653. Are you sure you wouldn't like me to book the room for you?", "USER: No, thank you for the suggestions I will check and look up the one that best fit.", "SYSTEM: I am sorry we were unable to find you a hotel that fit your preference, have a good day."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1683.json": ["USER: I want a train going to stansted airport .", "SYSTEM: There are 133 trains. Where will you be leaving from?", "USER: I'm leaving from Cambridge.", "SYSTEM: And what day and time would you like to travel?", "USER: I need to leave on Wednesday after 08:45.", "SYSTEM: TR1085 departs at 09:40 and arrives by 10:08. Would you like a ticket?", "USER: Not at this time. However, I am looking at hotels as well. Is there a hotel that has 2 stars and includes free wifi?", "SYSTEM: the lovell lodge is a moderate price in the north with free wifi. Would you like for me to book a room.", "USER: Is this a hotel or guest house?", "SYSTEM: This is a hotel.", "USER: I need a hotel book it for 4 people and 3 nights starting from sunday.", "SYSTEM: Your hotel at the Lovell Lodge is booked for 4 people and 3 nights, the reference number is LEC7DOND . Is there anything else I can help with?", "USER: No, that will be all. Thank you.", "SYSTEM: Thank you and Good bye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG01953.json": ["USER: I need to book a taxi to arrive at Ruskin Gallery by 21:45.", "SYSTEM: Alright. I will just need to know what the departure site will be please", "USER: I am going to be leaving from the Ruskin gallery.", "SYSTEM: I'm confused. Are you leaving from Ruskin Gallery or going to Ruskin Gallery?", "USER: I am leaving from Ruskin Gallery.", "SYSTEM: Alright, where will the taxi be taking you tonight?", "USER: I will be going to magdalene college.", "SYSTEM: Booking completed! Is there anything else I can help you with today? Booked car type : grey honda Contact number : 07402352518", "USER: Great, thanks. Can you confirm the time on that car? I just want to make sure I arrive at Magdalene College by 21:45.", "SYSTEM: Have a safe trip!"], "correction": "yes", "error": "E4", "turn": "1", "phrase": "I'm confused", "user_reaction": "UR1"}, {"SNG0090.json": ["USER: I would like to get a taxi from the Museum of archaeology and anthropology to the Soul Tree Nightclub", "SYSTEM: Certainly. Could you please tell me either the time you want to leave or the time you would like to arrive by?", "USER: The taxi should arrive by 02:30", "SYSTEM: I have booked you a taxi for that time. It is red bmw. Is there anything else I can assist you with today?", "USER: yes actually, I was wondering if you had any contact information for the driver?", "SYSTEM: The contact number is 07193948183. Anything else I can help with?", "USER: Nope, that's all I need today. Thanks!", "SYSTEM: If there is nothing else I can do, I want to thank you very much and have a great day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0878.json": ["USER: I'm looking for a restaurant that serves gastropub.", "SYSTEM: There are four gastropubs in Cambridge. Is there a price range you prefer?", "USER: Expensive. And in the centre, if you can.", "SYSTEM: I have the Backstreet Bistro or The Slug and Lettuce. Would you like me to book a reservation at one for you?", "USER: Could you book a table at the Backstreet Bistro on Friday? 18:45 for 4 people, please.", "SYSTEM: I'm sorry, Backstreet Bistro does not have availability at this time. Would you like to book another day or time for your reservation?", "USER: Please try 17:45 and get me the reference number if possible.", "SYSTEM: You are all set for Friday at 17:45 for 4 people. The reference number is 4IENEDKD . Is there anything else I can help with?", "USER: Yes, I'm also looking for something to do in town. Are there any museums close by to the restaurant?", "SYSTEM: The Cambridge Contemporary Art Museum is on Trinity Street. There are a number of others in the area also. Can I give you any other information?", "USER: Can you confirm whether this is in the centre area? And if I can get the phone number please.", "SYSTEM: Yes, this is in the centre area. The phone number is 01223324222. Would you like to know anything else?", "USER: Yes, I would also like to book a taxi to commute between the two places.", "SYSTEM: I'd be happy to help with that, but first I will need to know which place you're departing from and when you'd like to leave.", "USER: I'll be leaving Cambridge Contemporary Art Museum, and heading to the restaurant with my party to arrive before our reservation.", "SYSTEM: Ok, I have your taxi booked from the museum to the restaurant, arriving by 17:45. Anything else I can do for you?", "USER: Yes, I need to know the contact number and car type", "SYSTEM: Certainly. It will be a black honda. The contact number is 07091386292. Do you need anything else?", "USER: No, I don't need anything else. You have been very helpful. Goodbye.", "SYSTEM: You're welcome. Have a great time!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL2973.json": ["USER: Are there good hotels?", "SYSTEM: Yes, I have 33 options for you. Are you interested in a specific area?", "USER: I would like to be in the east.", "SYSTEM: Sure, is there a price range you'd like to stay within?", "USER: Yes, I'd prefer a cheap guesthouse.", "SYSTEM: I found three hotels that match your request, and they are all 4 star. Can I book a room for you at one of them?", "USER: Yes please book one for me. Send me the address phone post code and reference number. Thanks", "SYSTEM: Allenbell is a guesthouse on the east that gets 4 stars and is cheap. It has internet and parking. The address is 517a Coldham Lane. Will you be alone?", "USER: that sounds fine. Can you give me some info about a cinema to visit?", "SYSTEM: cineworld cinema is in the south and vue cinema is in the centre.", "USER: Can I get the phone number and entrance fee of cineworld cinema?", "SYSTEM: I'm afraid that I don't know their entrance fee, but their phone number is 00872208000. Can I help you with anything else?", "USER: No, that will be all. Thank you!", "SYSTEM: Thanks for using our service today!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0384.json": ["USER: I'm looking for a particular restaurant. It's called hotel du vin and bistro.", "SYSTEM: I have found the place you are looking for. It is located in the centre of town and has a moderate price range. Would you like the address?", "USER: Yes, and please include the area and postcode.", "SYSTEM: It is located at 15-19 Trumpington Street, postcode cb21qa, located within the city centre. Would you like me to book a reservation for you?", "USER: Yes please. I am also looking for a train that leaves wednesday from birmingham new street as well if that's not too much trouble?", "SYSTEM: There are trains departing from Birmingham New Street from 05:40 and every hour past that time. What time would you like to travel?", "USER: I would like to arrive by 13:45 in Cambridge if possible.", "SYSTEM: I have eight trains that will arrive by 13:45. What time would you like to depart?", "USER: The earliest train is alright with me.", "SYSTEM: Would you like me to book that for you?", "USER: Yes, please, for one. And could you give me the reference number, please?", "SYSTEM: I have booked at train leaving at 5:40 for you. The total cost will be 75.09 GBP and your reference number is DA1PDHXF . Is there anything else I can help with?", "USER: That's everything that I needed. Thanks a lot for the assistance.", "SYSTEM: You're quite welcome! Have a wonderful day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG1070.json": ["USER: Could you help me find a place for entertainment? Something on the east side of town.", "SYSTEM: Cherry Hinton Hall and Grounds is on the east side of town, would you like their phone number?", "USER: Actually, can I get the address and postcode?", "SYSTEM: Yes, it's Cherry Hinton Road, cb18dw.", "USER: Can you tell me what the entrance fee is?", "SYSTEM: I'm sorry, the entrance fee isn't listed in my system.", "USER: OK, then that's all I need today. Thank you for your help!", "SYSTEM: Thank you, if you need anything else let me know.Good Bye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL2541.json": ["USER: I'd like to find a college to visit.", "SYSTEM: There are 18 colleges to choose from. Are you looking to visit a specific area?", "USER: Yes somewhere in Cambridge.", "SYSTEM: There are 13 in the centre of the town, many of them offer free entrance. Would you be interested in Christ's college?", "USER: Yes, could I get their phone number please? I also need a guesthouse in the West as well.", "SYSTEM: You can reach Christ's College at 01223334900. As far as guesthouses, I have 2 that meet your criteria. Both offer free wifi and parking. Hobson's House is moderately priced.", "USER: Hobson's House sounds interesting. What is their phone number?", "SYSTEM: You can reach Hobsons House at 01223304906. Is there anything else I can help you with?", "USER: That sounds good, thank you.", "SYSTEM: Would you like me to book a room for you at Hobson's House?", "USER: No, thank you. I just only need the information of the guesthouse.", "SYSTEM: Hobsons House is in the west, on 96 barton road, cb39lh. It's in the moderate price range. It's a 3 star hotel with free wifi and parking. Anything else?", "USER: That will be all. Thank you!", "SYSTEM: Please contact us again if there is anything else you should need.", "USER: That seems to be all I need. Thank You.", "SYSTEM: You are very welcome. Good bye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1944.json": ["USER: I sure hope so. I'd like to find a place to stay, with four stars, in the north.", "SYSTEM: I have about 8 options for you. They are all guesthouses. Do you have a preferred price range?", "USER: Price is not of any concern, just so it has a 4 star rating.", "SYSTEM: What dates would you like to stay?", "USER: Oh, I think I forgot to mention that it needs to be a 4 star guesthouse. I want to book Saturday for 7 people 2 nights.", "SYSTEM: All the 8 hotels are 4 star hotels. I recommend the Avalon or the Archway House. Should I book one of those for you and your party?", "USER: Yes, please book a reservation.", "SYSTEM: I have successfully booked you for avalon. Reference number is RI8WLX7E . Do you need anything else?", "USER: Thank you! I also need info on trains that are leaving Cambridge.", "SYSTEM: Sure, where are you headed?", "USER: kings lynn is my destination", "SYSTEM: What day and time would you like to travel?", "USER: I need to arrive by 20:45 on Monday, please.", "SYSTEM: There are two trains that would work. One leaves at 8:11 and the other at 9:11.", "USER: Is there a train that arrives closer to the deadline of 20:45? If not, I will take the 9:11.", "SYSTEM: I have found a train that leaves Cambridge at 19:11 and arrives by 19:58 at Kings Lynn on Monday. Would you like me to book for you?", "USER: Yes please! could I get the departure time, train ID and travel time?", "SYSTEM: Great, the train departure time is 19:11, the travel time is 47 minutes and Train ID is TR8868. Can I assist with anything else?"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL1622.json": ["USER: I need a train on Sunday.", "SYSTEM: I'd be happy to help! Where are you coming from and where are you going?", "USER: Coming from kings lynn to cambridge", "SYSTEM: What time would you like to travel?", "USER: I need to arrive by 17:15.", "SYSTEM: There are several trains that meet your criteria. How early would you like to arrive? That will help me narrow down your choices.", "USER: Just a little before 17:15 arrival would be great.", "SYSTEM: There is a train that departs at 16:11 and arrives at 16:58. The train number is TR0864 and the cost is 7.84 per person.", "USER: Okay, excellent. I am also looking for a restaurant called Bloomsbury. Can you tell me where it is and what kind of food?", "SYSTEM: Sure, its at Crowne Plaza Hotel 20 Downing Street, their number is 08719429180 and they have a moderate price range with international food.", "USER: Thank you that is all I needed today. Have a nice day.", "SYSTEM: You're welcome, have a nice day."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG0253.json": ["USER: I am looking for a train to Cambridge on Saturday.", "SYSTEM: certainly, do you know from where you will be departing, and at what time?", "USER: I will depart at Birmingham New Street and should arrive by 11:30. Can you help me with this?", "SYSTEM: Of course I can. There are 6 possibilities, at what time would you like to leave?"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG0993.json": ["USER: I'm looking for a cheap place to stay with free wifi.", "SYSTEM: We have 10 possibilities for you. Do you have any additional preferences?", "USER: Yes, I am looking for a hotel with a 2 star rating.", "SYSTEM: I don't have anything with two stars, free wifi, and in the cheap range. Would you like to try a different number of stars?", "USER: Let's try something in the moderate price range with two stars and free wifi please.", "SYSTEM: I have two options in the moderate price range. The Ashley House and Lovell Lodge. Would you like to try one of these?", "USER: Lets try the Ashley House please.", "SYSTEM: When will your stay be?", "USER: We'll arrive on Wednesday and stay 3 nights. There will be 2 of us.", "SYSTEM: I've made your reservation, and the reference number is 5NA21JWO . What else can I help you with?", "USER: That is all I need for now. Thank you for finding the hotel.", "SYSTEM: You're very welcome. Thanks for contacting the Cambridge TownInfo Centre. I hope you have a great day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1771.json": ["USER: I am organizing my trip to cambridge and need a place to stay in the east in the cheap price range.", "SYSTEM: I have 3 cheap hotels in the east for you to choose from. There are all good Hotels with free internet and parking though allenbell is closest to cambridge.", "USER: I would prefer a hotel with 4 stars. Does Allenbell fit the bill?", "SYSTEM: Yes it does would you like me to make a booking?", "USER: No but I'd like to know where it's exactly located.", "SYSTEM: Allenbell is located at 517a coldham lane with a postcode of cb13js.", "USER: I also need a train going to stevenage.", "SYSTEM: Okay! What day would you like to travel? I'm presuming you're coming from Cambridge?", "USER: I would like to travel on Thursday leaving from Cambridge.", "SYSTEM: I have 10 trains that will be leaving Cambridge going to Stevenage on Thursday. What time would you like to leave or arrive?", "USER: The train should arrive by 19:30 the latest.", "SYSTEM: The closest to 19:30 without being after is TR 4765, they arrive at 18:10, does that work for you?", "USER: That will give me time to find my way, in case I get lost, so that's fine. I'll need you to book 6 tickets, please.", "SYSTEM: Your total is 76.80 GBP, which you can pay at the station. Your Reference number is : 708IJWEK .", "USER: Thank you so much, that's all I need.", "SYSTEM: You're very welcome! Bye now!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL2166.json": ["USER: Hi, I'm looking for a nightclub in town please.", "SYSTEM: There are several nightclubs in town. I recommend ballare. It is found in the center of town.", "USER: Okay, could you tell me he postcode and the entrance fee?", "SYSTEM: Sure thing! Entry fee is 5 pounds and postcode is cb23na.", "USER: I would also like to eat in the center of town.", "SYSTEM: We have many dining options available in city centre. Do you have a price range or style of food you would prefer?", "USER: Are there any steakhouses in the centre?", "SYSTEM: Unfortunately not. Do you want to broaden your search?", "USER: Can you find something with italian food instead?", "SYSTEM: Oh, great choice. I love Italian too. There are several options. How about Zizzi Cambridge?", "USER: That sounds great, what's the price range for Zizzi Cambridge?", "SYSTEM: Zizzi Cambridge is relatively cheap, but the food is sublime. Would you like me to book it for you?", "USER: That sounds great, please do.", "SYSTEM: I'd be happy to. Can you tell me a date, time and how many people in your party?", "USER: It will just be for me on Wednesday. I would like it to be for around 4pm.", "SYSTEM: Booking was successful. The table will be reserved for 15 minutes. Your Reference number is : UWZS9JSU .", "USER: I would love a taxi", "SYSTEM: I can help with that. What is your departure site, destination, and the time you need it?", "USER: I want to depart the restaurant at 05:00 to go to the attraction", "SYSTEM: A yellow Tesla will pick you up, and the contact number is 07267272725. Can I help with anything else today?", "USER: No, I believe that's all I need today. Thanks for your help.", "SYSTEM: Have a great day. Enjoy your trip. Goodbye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL4941.json": ["USER: I need a train to leave from birmingham new street on friday", "SYSTEM: Is your destination Cambridge?", "USER: Yes, cambridge is my destination.", "SYSTEM: Is there a certain time you need to arrive by?", "USER: Yes, I need to arrive by 13:45. How long with the trip take?", "SYSTEM: The trip takes about 163 minutes. We have a few trains going to birmingham new street on friday, would you like to book a seat?", "USER: No thank you. I'm also looking for an Indian restaurant in the north.", "SYSTEM: What area of town are you interested in dining at?", "USER: In the north please.", "SYSTEM: The Nirala in Chesterton is a moderately priced restaurant. Would you like a reservation?", "USER: Yeah. Can you make a reservation for 1 person at 16:00 on friday?", "SYSTEM: Booking was successful. The table will be reserved for 15 minutes. Reference number is : PUXFOUYW .", "USER: Great, thanks, that's all I need.", "SYSTEM: You're welcome. Have a good day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1121.json": ["USER: Hi, I need a train that leaves on Wednesday and arrives by 08:45.", "SYSTEM: I'm going to need a little more information from you. Where will you be leaving from? Where are you traveling to?", "USER: I'm leaving from Cambridge and want to arrive in London Liverpool Street.", "SYSTEM: The TR1047 departs Cambridge for London Liverpool Street on that day and arrives at 07:27. Would you like to book a seat?", "USER: Yes please book it for me and I need a confirm number", "SYSTEM: How many people do you need reservations for?", "USER: There will be 8 people.", "SYSTEM: You're all set on that train, and your reservation reference number is 3XM02AO1 . The total due at the station will be 132.8GBP. Can I help with anything else today?", "USER: Yes, I am looking for places to go while I'm in town. Perhaps something in the city centre.", "SYSTEM: Sure! I highly suggest All Saints Church. Would you like more information?", "USER: I'm thinking some type of architecture in the center. I'll need their address and phone number as well.", "SYSTEM: I suggest the Old Schools. The address is Trinity Lane and the phone number is 01223332320.", "USER: Thank you. That is all I need for now.", "SYSTEM: You are very welcome. Enjoy your trip."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL2072.json": ["USER: Hi there. Can you help me find a train to Cambridge on Thursday?", "SYSTEM: I can. Will you be departing from London Kings Cross?", "USER: No, I'm coming from Ely.", "SYSTEM: What time would you like to travel?", "USER: I would like to arrive in Cambridge by 16:15.", "SYSTEM: I would recommend the TR7745 train that arrives at 07:52. Would that work?", "USER: I need the travel time for that.", "SYSTEM: It is 17 minutes.", "USER: can you see about reservations at the aylesbray lodge guest house", "SYSTEM: Yes, I can. Will it be for for just 1 night?", "USER: Actually, let's not worry about booking it just now. Can you narrow down where it is for me with the area at postcode?", "SYSTEM: Sure. It's in the south of town with postcode cb17sr. Can I help you with anything else?", "USER: No, that seems like everything. Go ahead and book it, and we should be done here.", "SYSTEM: How many nights will you be staying?", "USER: I'm sorry, I'm not ready to book yet. I can do it myself later. Thanks so much for all of your help. Bye.", "SYSTEM: Sounds good. Thanks for using Cambridge TownInfo centre!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL2251.json": ["USER: I'm looking for a place to stay while in Cambridge. What is available in the west area that has free wifi?", "SYSTEM: There are 4 hotels to choose from. I can recommend Finches Bed and Breakfast. It's a cheap 4 star guesthouse. Does that work?", "USER: I need a guesthouse with a star rating of 0.", "SYSTEM: I'm sorry, there are no 0 star guesthouses, would you like to try something else?", "USER: Is there a guesthouse located in the centre with free wifi?", "SYSTEM: El Shaddai fits your needs. Would you like me to reserve a room?", "USER: Does that have free parking?", "SYSTEM: Yes it does. It's cheap and has free parking.", "USER: Thanks for the info. I also need to look for a train. Can you look that up?", "SYSTEM: Absolutely. Let me start by asking you what your departure and destination locations will be?", "USER: I'm going from Cambridge to Ely.", "SYSTEM: Great! What day and time to you want to travel on?", "USER: I would like to travel on Tuesday and leave sometime after 16:30.", "SYSTEM: TR7733 leaves at 17:50. May I book that for you?", "USER: That sounds good. Please get me tickets for six people.", "SYSTEM: The Booking was successful, the total fee is 26.4 GBP payable at the station . Reference number is : TO3Z8A06 .", "USER: Thank you very much.", "SYSTEM: Can I be of further assistance today?", "USER: No, you've been a great help mate. Thanks for everything!", "SYSTEM: It was my pleasure! Enjoy your stay!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1990.json": ["USER: I'm looking for a train that is going to birmingham new street and leaves after 17:15.", "SYSTEM: There's a train on that route every day departing at 18:01 that ought to work for you. Do you know what day you'll be travelling?", "USER: I will be traveling on Friday.", "SYSTEM: Where will your departure site be?", "USER: I will be leaving from Cambridge. I will need 4 seats.", "SYSTEM: Great I booked you 4 seats on that train and your reference number is HI8OJSIM .", "USER: I also need to get a place to stay that is in the moderate price range and have 3 stars.", "SYSTEM: Sure, there are a few guesthouses available. Which part of town would you like to stay in?", "USER: West part of town. Thanks", "SYSTEM: It looks like there is a 3 star guesthouse in the area named Hobsons House. How does that sound?", "USER: That sounds perfect please book for the same group of people for 2 nights starting on wednesday.", "SYSTEM: Done! Your reference number is 9QIJMOO2 . Can I help you with anything else?", "USER: No thank you. You have helped me bunches today.", "SYSTEM: Thank you for using our service!", "USER: Thanks, I'll call if I need anything else.", "SYSTEM: Have a good day. Goodbye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL1746.json": ["USER: Hi there, I'm looking for a museum to go to that's in the centre of the city.", "SYSTEM: We have 11 museums in the centre. The museum of archaelogy and anthropology is very popular. Would you like to go there?", "USER: What is the entrance fee for the Museum of Archaeology and Anthropology?", "SYSTEM: It has a free entrance fee.", "USER: Can you please provide the address and postcode?", "SYSTEM: Yes, I can. The address is university of cambridge, downing street, postcode cb23dz.", "USER: Thank you. I also looking for train that departs from cambridge and arrive by 21:00.", "SYSTEM: Could you provide your destination in order that I might better help you?", "USER: There are two of us, and we'd like to go to norwich please.", "SYSTEM: What day would you and your companion be traveling?", "USER: We will be traveling on Thursday.", "SYSTEM: Great! I have the TR1006 departing at 5:36 and arriving by 6:55 or if you would like a later time the TR5892 departs at 19:36 and arrives by 20:55.", "USER: The TR5892 would be great. Could I book two tickets for that train please?", "SYSTEM: I successfully booked two tickets on TR5892 at a cost of 35.2 GBP. Your reference number is GA09OC54 .", "USER: You have been so helpful. Thank you. I have no other requests. Good bye.", "SYSTEM: Thank you for choosing Cambridge Help Desk. Have a lovely trip."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG02311.json": ["USER: I'm looking for more information on arbury lodge guesthouse.", "SYSTEM: The arbury lodge guesthouse is a 4 star hotel in the north area at a moderate price range and includes internet and parking. Would you like me to book it?", "USER: Yes, please. For 3 people, 3 nights starting on tuesday.", "SYSTEM: Your booking was successful. The Reference number is : 4HWMO5PZ .", "USER: Thanks, that's all. Good bye.", "SYSTEM: welcome again next time"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1393.json": ["USER: Hi, I need to take a train from Cambridge, leaving any time after 09:15.", "SYSTEM: Alright the first train leave by 11:00.", "USER: I'll be going to Liverpool Street in London on Wednesday. Can I get the information on the earliest train after 09:15?", "SYSTEM: TR4757 is just fine for you. it takes 88 minutes. can i book", "USER: What specific time does TR4757 arrive to Liverpool Street?", "SYSTEM: TR4757 is much later than you want. TR5874 is better - it will leave at 09:59 and arrive at 11:27.", "USER: You can book this. Can you tell me about entertainment type places in the centre of town?", "SYSTEM: there's nothing in that area, do you want me to check other areas?", "USER: How about a college in the centre of town?", "SYSTEM: There are 13 colleges located in the center of cambridge. Would you like a recommendation?", "USER: Yes with an entrance fee please.", "SYSTEM: Sure, I would recommend Corpus Christi College, their admission fee is 2 pounds. Would you like a reservation?", "USER: No , thank you. That is all I need.", "SYSTEM: Okay, have a great day!", "USER: okay you too", "SYSTEM: Thank you. Please contact us again if you need anything else."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG0293.json": ["USER: I need a train going from Ely to Cambridge please.", "SYSTEM: What day and time would you like to leave?", "USER: I'd like to leave on Friday and arrive by 14:45.", "SYSTEM: I have 5 trains that arrive by 14:45. Is there a particular time you would like to leave?", "USER: No time in particular, please reserve any one of them for 3 people.", "SYSTEM: I have three seats booked on TR0236, departing at 13:35 and arriving at 13:52. Your confirmation number is T3Y4Y9S8 .", "USER: That is all for now. Thank you.", "SYSTEM: You are welcome and thank you for using Cambridge TownInfo Centre."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL3806.json": ["USER: I need to know if there are any polynesian restaurants in the east side of cambridge?", "SYSTEM: I'm sorry, we don't have any. Is there something else I can help you with?", "USER: Just to confirm, there are no expensive restaurant 's serving polynesian food on the east side, is that right?", "SYSTEM: There are no Polynesian restaurants in the east at all, cheap, expensive, or otherwise.", "USER: What about an expensive British place in the east?", "SYSTEM: sure, there is the grafton hotel restaurant in that area.", "USER: Great! May I get the phone number and address?", "SYSTEM: They are at Grafton Hotel 619 Newmarket Road Fen Ditton, postcode cb58pa, they can be reached at 01223241387, can I help with anything else?", "USER: Yes, I am looking for a train going to Broxbourne by 17:45.", "SYSTEM: how about TR2519? it arrives by 10:01.", "USER: Does it depart from cambridge on wednesday?", "SYSTEM: I have train TR2925 available. It departs cambridge on wednesday at 16:01 and arrives in broxbourne at 17:01. Will that work?", "USER: Yes, that would be lovely. I'll need to book for 2 people. Can I have the reference number please?", "SYSTEM: I was able to book that for you for a total of 35.79 GBP. Your reference number is 7VRFHBER .", "USER: Great thanks so much! That's all I need!", "SYSTEM: You're welcome, have a great day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL1549.json": ["USER: Hi, I need a train from ely to cambridge. Can you help me with that?", "SYSTEM: Sure. Which day would like to travel?", "USER: I would like to leave on Wednesday after 13:45.", "SYSTEM: There are 5 trains. Train TR5050 arrives at 21:52 and departs at 21:35. Would that work?", "USER: Yes. Can you book for 1 person?", "SYSTEM: Sure thing booking was successful, the total fee is 4.4 GBP payable at the station. Reference number is KC9U39NR .", "USER: Yes, I am looking for a restaurant. The restaurant should be in the centre and should serve European food.", "SYSTEM: Sure, I recommend eraina. It's expensive, but excellent. Does this interest you?", "USER: Yes please book a table for me at 18:30 on the same day , Wednesday. I will need the reference number please.", "SYSTEM: I was able to successfully book you. Your reference number is HKBUPYI9 . Is there anything more I can help with?", "USER: No, that's everything I need. Thank you very much.", "SYSTEM: Okay thank you. Enjoy your dinner."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG01320.json": ["USER: Please book me a taxi to come to Rajmahal by 22:30.", "SYSTEM: Sure! Where are you coming from?", "USER: I want to depart from Rajmahal, not go to there.", "SYSTEM: Ok, what is your destination?", "USER: I'll be heading to restaurant two two", "SYSTEM: Booking completed! Booked car type : black toyota Contact number : 07452807807"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL4826.json": ["USER: Hi I am looking for information on the magdalene college.", "SYSTEM: That is a college in the West with free admission. Would you like the address?", "USER: No, can you please give me the area and phone number to the college instead.", "SYSTEM: Sure. Magdalene College is west and the phone number is 01223332138. Anything else I can help with?", "USER: Yes, I need to take a train from bishops stortford to cambridge.", "SYSTEM: Okay, what day would you like to travel?", "USER: Sunday. I can't leave until after 21:45", "SYSTEM: The TR6914 meets your criteria. Would you like to book tickets?", "USER: i just need the price and arrival time please.", "SYSTEM: the price is 8.08 pounds and it arrives by 24:07. is there anything else i could help you with?", "USER: No that is it. Thank you.", "SYSTEM: You're welcome have a great day"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"MUL0739.json": ["USER: Hi I need to find a place to stay with a 3 star rating with free parking", "SYSTEM: There are 6 four star hotels in Cambridge. Do you have a preferred price range?", "USER: Could you find me a one that is cheap?", "SYSTEM: There is none that is cheap. Would you like to change your criteria?", "USER: Could you give me the lowest price of the 6 hotels currently available?", "SYSTEM: There are no cheap hotels available with 3 stars and free parking. Do you want to try a different price range?", "USER: What about cheap 4 star hotels?", "SYSTEM: I have 7 guesthouse and the cambridge belfry hotel that meet your needs. Would you like to book one?", "USER: What area is the Belfry in? Do they have internet? I'd also like their phone number.", "SYSTEM: Yes. The cambridge belfry hotel has free internet and parking. Their phone number is 01954714600. Can I help you with anything else?", "USER: Thanks. Can you tell me what area the hotel is in please. And I would also like to find a train to Cambridge on Monday.", "SYSTEM: The cambridge belfry is a hotel in the west in the cheap price range. Do you need any more information?", "USER: Do you know if the property offers free parking?", "SYSTEM: They do offer free parking.", "USER: I also need a train ticket from Kings Lynn to Cambridge, please.", "SYSTEM: There are over one hundred trains that go from Kings Lynn to Cambridge, can you tell me what day and time you would like to leave?", "USER: I would like to arrive by 20:45 and leave on a Monday. It will also be for only myself.", "SYSTEM: The closest train I've found to meet your preferences leaves Monday and arrives by 19:58. Would you like me to book this for you?", "USER: Yes, please do. May I have the reference number?", "SYSTEM: Yes, the number is TR1978. Anything else?", "USER: That should do it, thank you.", "SYSTEM: OK, I have booked the train and you have a reference number of VJMRP8OS . Please be ready to board at 19:11.", "USER: Thank you! That's all I needed.", "SYSTEM: You're welcome! Goodbye!"], "correction": "yes", "error": "E4", "turn": "0", "phrase": "-", "user_reaction": "UR1"}, {"SNG0772.json": ["USER: Are there any guesthouses with 3 star ratings?", "SYSTEM: I was able to get four results for what you are looking for, is there a certain price range you would like?", "USER: Yes definitely. I would like something moderate.", "SYSTEM: We have four guesthouses that fit the bill, two in the north, one in the south, and one in the west.", "USER: Out of those, can you find me one with free internet and parking?", "SYSTEM: We have 3 that match your criteria but Hamilton Lodge is very popular. Would you like to try there?", "USER: No, I'm not ready to book just yet. Thank you!", "SYSTEM: Just let us know when you are ready to book and we will be happy to assist you. Have a great day!"], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"SNG0636.json": ["USER: What restaurants in the centre serve international cuisine?", "SYSTEM: The Varsity Restaurant and the Bloomsbury Restaurant serve international food and are in the centre of town.", "USER: How about a place in the moderate price range?", "SYSTEM: Both of the named restaurants are in the moderate price range.", "USER: OK, can you book a table for 6 at 12:00 on Tuesday at The Varsity Restaurant? I will need a reference number too, please.", "SYSTEM: Certainly. I will have that reference number for you in just one second.", "USER: Thanks. Looking forward to it.", "SYSTEM: Yes I can. I have booked you a table for 12 noon on Tuesday for 6 people. Your reference number is WC1ZY82V . Anything else I can help you with?", "USER: No, that is all. Thank you.", "SYSTEM: You're welcome. Good-bye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"PMUL1029.json": ["USER: I am planning a trip to Cambridge and need a train heading to Cambridge on Tuesday.", "SYSTEM: Yes certainly. Where will you be leaving from and at what time of day?", "USER: I will leave after 09:00 and need to depart from Stansted Airport.", "SYSTEM: I found multiple options for you. Do you have a preference when it comes to arrival time?", "USER: i just want to leave around 9", "SYSTEM: I have the TR1610 leaving at 09:24. Would you like me to book a ticket?", "USER: Yes, I need 4 tickets and the reference number.", "SYSTEM: Your booking was successful. You can pay the fee of 40.4 GBP at the station. Your reference number is TCYIATTU . Anything else I can assist you with today?", "USER: I also need to find a museum in the west to go and see.", "SYSTEM: There are a number of options, but I recommend the free Museum of Classical Archaeology in the west area. Would you like more information about this museum?", "USER: Yes, please. I just need the phone number.", "SYSTEM: The phone number for the Museum of Classical Archaeology is 01223335153.", "USER: Great thank you, that is all I need for now.", "SYSTEM: Please call back if you have additional questions. Thank you for calling! Goodbye."], "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}]