[{"turns": {"dialogue_id": 13458, "dialogue": [{"speaker": "0_Wizard", "text": "Hi.  Do you like listening to the Beatles? They have been around since 1960."}, {"speaker": "1_Apprentice", "text": "Well,  I know who they are but I'm not that familiar with their songs."}, {"speaker": "0_Wizard", "text": "They were a bar band out of Liverpool.   They are contemporaries of Bob Dylan."}, {"speaker": "1_Apprentice", "text": "So they are from England?"}, {"speaker": "0_Wizard", "text": "Yes from Liverpool England.  Maybe you've heard \"Penny Lane\" or \"Let it Be\"?"}, {"speaker": "1_Apprentice", "text": "Yes, I've definitely heard Let it Be!  That's a classic for sure."}, {"speaker": "0_Wizard", "text": "Yeah it's sad only Paul McCartney and Ringo Starr are still around."}, {"speaker": "1_Apprentice", "text": "Were there 5 originally?"}, {"speaker": "0_Wizard", "text": "I've only known of the 4: John Lennon, Paul McCartney, George Harrison and Ringo Starr"}, {"speaker": "1_Apprentice", "text": "Yeah, I think you're right.  There were 4 of them."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 3123, "dialogue": [{"speaker": "0_Apprentice", "text": "evening, you know,  my favorite food is pizza"}, {"speaker": "1_Wizard", "text": "mine too! who doesn't love that flatbread topped with cheeses and baked in the oven to perfection. it a traditional italian classic!"}, {"speaker": "0_Apprentice", "text": "you cannot beat a flatbread with cheese and sauce  ;)"}, {"speaker": "1_Wizard", "text": "true that! And i love that you can top it with  vegetables, meats, and condiments, and can be made without cheese"}, {"speaker": "0_Apprentice", "text": "i do not think I ever had a pizza without any kind of cheese"}, {"speaker": "1_Wizard", "text": "I made on once without cheese. It had honey curry sauce with chicken and arugala. wow, it was good but not like traditional."}, {"speaker": "0_Apprentice", "text": "I'm a basic pizza guy, nothing fancy, give me a cheese pizza, i'm happy"}, {"speaker": "1_Wizard", "text": "The modern pizza we eat today was invented in Naples, and the dish and its variants have since become popular and common in many areas of the world."}, {"speaker": "0_Apprentice", "text": "makes since it is from Italy, it deserves to become popular, its yummy"}, {"speaker": "1_Wizard", "text": "I found out that the term \"pizza\" was first recorded in the 10th century in a latin manuscript from the Southern Italy town of Gaeta in Lazio, on the border with Campania."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 1717, "dialogue": [{"speaker": "0_Apprentice", "text": "I think American Eagle is a good brand for young people"}, {"speaker": "1_Wizard", "text": "They do target mostly college kids.  They are doing pretty well with 949 stores!"}, {"speaker": "0_Apprentice", "text": "Amazing stat! I think they are well priced and have sales often."}, {"speaker": "1_Wizard", "text": "They do have good price.  Also they have so much variety, from polos, t-shirts, outwear, swimwear.  You name it, they got it"}, {"speaker": "0_Apprentice", "text": "Yes, also they have very good quality control and fabric when it comes to jeans for example."}, {"speaker": "1_Wizard", "text": "They have been around since 1977 and were created by Jerry and Mark Silverman.  "}, {"speaker": "0_Apprentice", "text": "Amazing that they have been in business for almost 50 years. Thats dedication and quality!"}, {"speaker": "1_Wizard", "text": "The company also owns a clothing store called Aerie"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 10263, "dialogue": [{"speaker": "0_Apprentice", "text": "I love frank ocean, can you tell me more about him?"}, {"speaker": "1_Wizard", "text": "Frank Ocean is an American independent singer, songwriter, producer and photographer. I say he is jack of all trades.  "}, {"speaker": "0_Apprentice", "text": "i did not know he did photography. What are some his popular songs?"}, {"speaker": "1_Wizard", "text": "His first charting single is called Novacane. I don't know he is a photographer either. He is amazing right?"}, {"speaker": "0_Apprentice", "text": "Is really is. Very talented. What else might I not know about him, or even find interesting? "}, {"speaker": "1_Wizard", "text": "He was a ghostwriter when he started his career and in 2010 he became a member of a hip hop group called Odd Future."}, {"speaker": "0_Apprentice", "text": "that is really cool. Do you know anything he ghostwrote, or for, if not, any other fact will do."}, {"speaker": "1_Wizard", "text": "There is not really enough information about what he wrote about, maybe he was not a successful writer?"}, {"speaker": "0_Apprentice", "text": "maybe, what else might I find cool? hometown? anything really"}, {"speaker": "1_Wizard", "text": "He was born as Christopher Edwin Breaux on October 29. 1987 in Long Beach California. Then his family moved to New Orleans when he was five."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 5256, "dialogue": [{"speaker": "0_Apprentice", "text": "I have Polydactyly, 6 toes on one foot, is this common?"}, {"speaker": "1_Wizard", "text": "No, I think this is very rare. Is it just soft tissue that can be removed?"}, {"speaker": "0_Apprentice", "text": "no it a real toe with bone and nail and everything"}, {"speaker": "1_Wizard", "text": "Has this caused any problems for you?"}, {"speaker": "0_Apprentice", "text": "no pain, but just embarrassment to go barefooted and need a wider shoe for it."}, {"speaker": "1_Wizard", "text": "Well I can see it being embarrassing to be barefoot. On the other hand shoes can cause problems such as bunions and hammer toe, especially if you have an extra toe. "}, {"speaker": "0_Apprentice", "text": "yea,  I always have to buy a wider shoe to accommodate for my extra toe"}, {"speaker": "1_Wizard", "text": "Good idea because if you smash all your toes into too narrow a shoe, the toe can become permanently bent, resembling a hammer. That's hammer toe. "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 10139, "dialogue": [{"speaker": "0_Wizard", "text": "I love going to the beach - I prefer wild beaches - they are undeveloped or undiscovered beaches"}, {"speaker": "1_Apprentice", "text": "You don't mean n*de beaches do you? Ones where people disrobe and go back to nature like God intended?"}, {"speaker": "0_Wizard", "text": "No, they are beaches that most people don't know about yet - I like them for their untouched beauty and preserved nature."}, {"speaker": "1_Apprentice", "text": "I like the sound of untouched. Now i think we are on the same page.  Aren't the only undeveloped beaches in the world in North Korea?  Isn't that was D Trump was trying to do there/ Make a deal to build resorts on his beaches?"}, {"speaker": "0_Wizard", "text": "They are all over - some are in Myanmar - all you need is a landform with sand alongside a body of water that noone knows about, and you have solitude!"}, {"speaker": "1_Apprentice", "text": "Oh yes Myanmar, the country formerly known as Burma.  I like that country - they have switched over to 100% electric vehicles - something the USA refuses to do.  Good for them! Environmentally concious and forward thinking! The two are not mutually exclusive!!"}, {"speaker": "0_Wizard", "text": "As for beaches, the ones that are developed have hospitality venues like resorts, camps, hotels, and restaurants nearby."}, {"speaker": "1_Apprentice", "text": "Great!! those are all things rich american lawyers and celebrities love to visit!!  I wonder how that country treats it's most vulnerable citizens, like the old, sick and infirm?  Intuition tells me they are forward thinking in these areas also. "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 17308, "dialogue": [{"speaker": "0_Apprentice", "text": "Tennis is something that has interested me for a while.  Would love to learn more!"}, {"speaker": "1_Wizard", "text": "It's a difficult sport. You play either by yourself or with a partner."}, {"speaker": "0_Apprentice", "text": "When did people start playing tennis?"}, {"speaker": "1_Wizard", "text": "Modern tennis actually originated in the 19th century in England from lawn tennis."}, {"speaker": "0_Apprentice", "text": "I heard of serena williams.  Who are some other popular tennis players?"}, {"speaker": "1_Wizard", "text": "Maria Sharapova is from Russia. and she was ranked number 1 for 21 weeks."}, {"speaker": "0_Apprentice", "text": "Wimbledon seems pretty important. Where is that played at?"}, {"speaker": "1_Wizard", "text": "I'm not sure about Wimbledon but the WTA Tour Championships was a big match that took place in Istanbul Turkey in 2012."}, {"speaker": "0_Apprentice", "text": "Does the WTA Tour Championships happen every year?"}, {"speaker": "1_Wizard", "text": "Yes i believe so. I think the WTA Tour championships are played in a different place every year."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 6006, "dialogue": [{"speaker": "0_Wizard", "text": "I have social anxiety, nervousness in social situations"}, {"speaker": "1_Apprentice", "text": "I used to have that. Still do in some settings. But then I started college and was forced to socialize so much that it went away a little."}, {"speaker": "0_Wizard", "text": "Yeah when I have high social anxiety I avert my gaze can't make eye contact"}, {"speaker": "1_Apprentice", "text": "I can understand that.. I want to understand social anxiety better so that I can help those that have it when I interact with them... What do you wish people knew?"}, {"speaker": "0_Wizard", "text": "It affects everyone nearly 90% of all people polled report feeling a form of social anxiety at some point"}, {"speaker": "1_Apprentice", "text": "That's kind of what I thought.. that it's universal, sort of. But still, I don't want to discredit it in people just because everyone experiences it. What else would you say is important to know?"}, {"speaker": "0_Wizard", "text": "Social anxiety is a normal emotion and part of the developement process for us all"}, {"speaker": "1_Apprentice", "text": "That's fair to say. I'll have to take these things into account when I feel like someone might be experiencing it when talking to me."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 8571, "dialogue": [{"speaker": "0_Wizard", "text": "Human height or stature is the distance from the bottom of the feet to the top of the head, I'm about 6 feet, how tall are you?"}, {"speaker": "1_Apprentice", "text": "I am 6'4 and still growing a bit, but sometimes I still feel short compared to other people, like NBA players"}, {"speaker": "0_Wizard", "text": "that is tall! the instrument used to measure human height is called the stadiometer. and it is usually measured in centemeters."}, {"speaker": "1_Apprentice", "text": "I have never heard of that, in America, our empirical system makes no sense, I wish we had a metric system like everyone else"}, {"speaker": "0_Wizard", "text": "It makes sense for the United States to convert to the metric system like everyone else."}, {"speaker": "1_Apprentice", "text": "I agree, I am used to it now, but it seems so pointless"}, {"speaker": "0_Wizard", "text": "There are only seven countries that officially do not use the metric system."}, {"speaker": "1_Apprentice", "text": "That is awesome, glad we have to be one of the only ones stuck in a pointless system haha"}, {"speaker": "0_Wizard", "text": "Yeah the other countries other than the US are Myanmar, Liberia, Palau, Marshall Islands, the Federated States of Micronesia, and Samoa. "}, {"speaker": "1_Apprentice", "text": "So we are the only super power to still use it? That is interesting"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 15372, "dialogue": [{"speaker": "0_Apprentice", "text": "i enjoy hitchhiking"}, {"speaker": "1_Wizard", "text": "First thought: I hope you're safe! Second: although typically \"free\", have you found that your rides come at a cost? We all know free is not always free..."}, {"speaker": "0_Apprentice", "text": "I know and there are safety precaution on it all. What are you scared of? "}, {"speaker": "1_Wizard", "text": "I'm not scared -- but what safety precautions? How do you know that the ride you're taking is safe? I know it depends where in the world you are, but there are very few places in the world where laws exist to restrict or regulate it."}, {"speaker": "0_Apprentice", "text": "And i am in that part of the world. And i mean you are scared something might go wrong. Have you ever heard of anything go wrong in the news before while hitching? "}, {"speaker": "1_Wizard", "text": "Um....yes! But again, that's may be location. It's interesting that hitchikers in different parts of the world use different hand signals. Are you of the arm extended, thumb up variety?"}, {"speaker": "0_Apprentice", "text": "Yes, i am of the arm extended, thumb up variety"}, {"speaker": "1_Wizard", "text": "In Africa, the hand is held still with palm facing upward; in Australia, they point the index finger at the road. Just in case you find yourself needing a ride in those locales ;-)"}, {"speaker": "0_Apprentice", "text": "Okay. But i cannot do it in an unfamiliar country. That might be dangerous"}, {"speaker": "1_Wizard", "text": "Fair! And do you have a different name for it? Hitching, Thumbing, or Autostop?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 13596, "dialogue": [{"speaker": "0_Wizard", "text": "Are you interested in alcoholism?"}, {"speaker": "1_Apprentice", "text": "not personally but more in a general sense"}, {"speaker": "0_Wizard", "text": "Well, certain researches suggests more and more youngsters find alcoholism fascinating"}, {"speaker": "1_Apprentice", "text": "interesting, i wonder why they are fascinated by it"}, {"speaker": "0_Wizard", "text": "Well, they are attracted to  risky situations. let it drinking and driving or drunken unprotected activity with opposite gender!"}, {"speaker": "1_Apprentice", "text": "yeah that makes sense, the excitement of it all"}, {"speaker": "0_Wizard", "text": "it is a real health hazard as well. for example drinking during pregnancy can cause fatal health issues to the child"}, {"speaker": "1_Apprentice", "text": "that goes without saying but there are many who still drink while pregnant , it is a shame"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 840, "dialogue": [{"speaker": "0_Wizard", "text": "Have you ever seen South Park? It is an American animated sitcom created by Matt Stone and Trey Parker."}, {"speaker": "1_Apprentice", "text": "I have only watched South Park a few times. Can you tell me more about it?"}, {"speaker": "0_Wizard", "text": "Sure, the show is about four boys: Stan, Kyle, Eric, and Kenny. They have bizarre adventures around their town."}, {"speaker": "1_Apprentice", "text": "It seems like show has been around forever. When when it first air?"}, {"speaker": "0_Wizard", "text": "It started in August 1997 with great success. It earned the highest ratings for any cable show."}, {"speaker": "1_Apprentice", "text": "Wow! That's pretty impressive! It it popular in other countries as well as America?"}, {"speaker": "0_Wizard", "text": "Yes, the show is popular around the world. Some countries censor it though because of the crude humor."}, {"speaker": "1_Apprentice", "text": "Has it won any major awards?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 15048, "dialogue": [{"speaker": "0_Apprentice", "text": "I used to live in an apartment, but moved to a home.  Have you ever lived in an apartment?"}, {"speaker": "1_Wizard", "text": "I lived in multiple apartments when I was in school. I lived in a complex as well as a self-contained housing unit"}, {"speaker": "0_Apprentice", "text": "The last apartment I lived in was huge and had a great pool and a gym.  Did your apartment complex have a pool?"}, {"speaker": "1_Wizard", "text": "It did.  I prefer having a landlord over a complex management though"}, {"speaker": "0_Apprentice", "text": "We bought a home and prefer single-family living much better.  I really prefer not having to tote groceries up 3 flights of stairs.  Apartments are called \"flats\" in the UK which I find to be charming."}, {"speaker": "1_Wizard", "text": "Apartment buildings can also be called complexes, flat complexes, tower block, high-rise, or mansion block"}, {"speaker": "0_Apprentice", "text": "I've lived in studio style apartments before, when I was in college.  That was just like living in one big room."}, {"speaker": "1_Wizard", "text": "I don't think I would like that.  Multi-story apartments can be referred to as mid-rise apartments as well"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 15691, "dialogue": [{"speaker": "0_Apprentice", "text": "I live my life not having regret, what about you?"}, {"speaker": "1_Wizard", "text": "I do not have a negative conscious."}, {"speaker": "0_Apprentice", "text": "That's great! Life is a lot less stressful that way."}, {"speaker": "1_Wizard", "text": "In some societies adults have the highest regrets regarding choices of their education. That is crazy to me."}, {"speaker": "0_Apprentice", "text": "I could see people having regret about that but it's in the past and you can only look forward with a positive attitude."}, {"speaker": "1_Wizard", "text": "Regret intensity varies over time after the decision."}, {"speaker": "0_Apprentice", "text": "That's understandable. Meditation takes the stress of regret away sometimes."}, {"speaker": "1_Wizard", "text": "I love to focus on my mind on a particular object."}, {"speaker": "0_Apprentice", "text": "So do i, it really helps me clear out negative energy from my mind"}, {"speaker": "1_Wizard", "text": "Negative energy is involved in wormholes which allow time travel. I wish I could time travel."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 4380, "dialogue": [{"speaker": "0_Apprentice", "text": "I have a lizard named Oshi."}, {"speaker": "1_Wizard", "text": "some lizards have no legs and have bodies that are similar to snakes"}, {"speaker": "0_Apprentice", "text": "What does a lizards diet consist of?"}, {"speaker": "1_Wizard", "text": "They are mostly carnivores and generally wait  for their prey, most smaller lizards eat insets but some of the bigger ones can eat mammals as big as a buffalo!"}, {"speaker": "0_Apprentice", "text": "How big can Lizards get?"}, {"speaker": "1_Wizard", "text": "They have a wide variety of different sizes, some are only a few centimeters long but some are up to 3 meters long!"}, {"speaker": "0_Apprentice", "text": "Wow, mine is very small. Do they have any defense mechanisms?"}, {"speaker": "1_Wizard", "text": "They do, surprisingly! They can have venom, reflex bleeding, and I am sure everyone knows about the camouflaging they are able to do. But I had no idea they could regrow their tails!"}, {"speaker": "0_Apprentice", "text": "That's insane! How do lizards communicate with each other?"}, {"speaker": "1_Wizard", "text": "They use all kinds of different sensory systems for communication, like their sight, smell and hearing! They have evolved and lizards can use different ways to communicate with one another including sight chemical tactile and even vocal communications!!"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 9527, "dialogue": [{"speaker": "0_Wizard", "text": "The sunset or the sun down is the disappearance of the sun "}, {"speaker": "1_Apprentice", "text": "ok, and at what times does the sunset happen where you live?"}, {"speaker": "0_Wizard", "text": "The sunset will happen exactly due west at the equator on the spring and fall"}, {"speaker": "1_Apprentice", "text": "And in winter and summer, when does it happen then?"}, {"speaker": "0_Wizard", "text": "Not much information on that but the sunset is very distinct from the twilight"}, {"speaker": "1_Apprentice", "text": "In what way is the sunset distinct from the twilight?"}, {"speaker": "0_Wizard", "text": "Near the horizon, atmospheric refraction causes the ray path of light from the sun"}, {"speaker": "1_Apprentice", "text": "Sunsets can be very beautiful sometimes with all the colors, that is probably the reason.  What else can you tell me about sunsets?"}, {"speaker": "0_Wizard", "text": "There is a song called \"sunset'' this was made from the band vulture street!"}, {"speaker": "1_Apprentice", "text": "I've never heard  about them, is it any good?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 6826, "dialogue": [{"speaker": "0_Wizard", "text": "The Miami night life is great. They have some of the best entertainment."}, {"speaker": "1_Apprentice", "text": "So I've heard. Even though I lived for ten years in Florida, I never visited Miami. My friend used to go clubbing there a lot. And my husband was born there!"}, {"speaker": "0_Wizard", "text": "He must have money because in 2009 they were listed as the richest city in the US."}, {"speaker": "1_Apprentice", "text": "Hah! Chance would be a fine thing! His family moved to Philly when he was about three. That's interesting though. I would never have imagined that."}, {"speaker": "0_Wizard", "text": "I want to move there just for the simple fact that they have some of the best air quality, and clean drinking water. Where I live you might as well be drinking toilet water."}, {"speaker": "1_Apprentice", "text": "I know what you mean. Our water is destroying my hair and skin. Where I grew up we had beautiful clean water. Now it's full of chemicals :("}, {"speaker": "0_Wizard", "text": "Yeah, and Miami also has a large population of around 5.5 million. So, i'm sure I could find my future wife there."}, {"speaker": "1_Apprentice", "text": "Could be. Mind you, I found my husband on a golf course in a remote village. You just never know where love is going to strike! You'll have to socialize a lot to find her in that size of a population, lol."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 7500, "dialogue": [{"speaker": "0_Apprentice", "text": "I'm a big fan of electronic music. How about you?"}, {"speaker": "1_Wizard", "text": "Yes, I dance to it all the time when I go to nightclubs."}, {"speaker": "0_Apprentice", "text": "My favorite electronic dance music artist is The Chemical Brothers."}, {"speaker": "1_Wizard", "text": "I like them too. Tom Rowlands and Ed Simons are a dynamic duo."}, {"speaker": "0_Apprentice", "text": "I am also a big fan of Fatboy Slim."}, {"speaker": "1_Wizard", "text": "He pioneered the emergence of the big beat genre."}, {"speaker": "0_Apprentice", "text": "I am interested in attending an EDM festival.  Which do you think is the best?"}, {"speaker": "1_Wizard", "text": "The Creamfields dance music festival. They have the best live acts."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 16573, "dialogue": [{"speaker": "0_Wizard", "text": "My husband used to be a lifeguard.  He had to be a strong swimmer, trained in CPR and first aid and certified in water rescue.  Have you ever needed a lifeguard/"}, {"speaker": "1_Apprentice", "text": "I have not. I am a decent swimmer."}, {"speaker": "0_Wizard", "text": "I feel much safer when there is one around!  I like that they supervise the safety of the swimmers, surfers and other water sports in pools, on a beach, etc."}, {"speaker": "1_Apprentice", "text": "That is a good perk. Does it take a lot of training?"}, {"speaker": "0_Wizard", "text": "A fair amount.  In some areas they are part of the EMS system and some of them even carry out mountain rescues."}, {"speaker": "1_Apprentice", "text": "Wow. Is there an age limit?"}, {"speaker": "0_Wizard", "text": "There are actually wide differences as certain conditions call for different types, etc..so there is often a significant variation - in our area you must be 16 to lifeguard at a pool.  Ocean is 18 I believe"}, {"speaker": "1_Apprentice", "text": "I would be scared to guard the ocean. Riptides are no joke."}, {"speaker": "0_Wizard", "text": "Me neither!!!  That would be scary, and some of these lifeguards are just volunteers!!  Not even paid employees."}, {"speaker": "1_Apprentice", "text": "That is very honorable!"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 1410, "dialogue": [{"speaker": "0_Apprentice", "text": "hello do you really know much about corn dog?"}, {"speaker": "1_Wizard", "text": "Yes, I love corndogs and everything about them. What's not to love about a hotdog covered in cornbread!"}, {"speaker": "0_Apprentice", "text": "wow, do you know how i can make one?"}, {"speaker": "1_Wizard", "text": "Sure! Take a hotdog and dip it in cornmeal and deepfry it. If you want it to lookmore like a corndog put a stick in one end."}, {"speaker": "0_Apprentice", "text": "wow i cant wait to try this"}, {"speaker": "1_Wizard", "text": "The German Texans invented them when Americans didn't like their regular sausages. They are simple, but delicious."}, {"speaker": "0_Apprentice", "text": "good, i think i have to order some for lunch today i cant wait to make"}, {"speaker": "1_Wizard", "text": "Just fry them until they look like a golden ear of corn. That is how they used to look."}, {"speaker": "0_Apprentice", "text": "oh good, how much will it cost to get some from the restaurant "}, {"speaker": "1_Wizard", "text": "Hmm, that depends on the vendor. Surprisingly there are many vendors that claim they invented the corn dog."}, {"speaker": "0_Apprentice", "text": "ok can you give an estimate"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 3226, "dialogue": [{"speaker": "0_Apprentice", "text": "Have you ever seen the Horror Film Dracula?"}, {"speaker": "1_Wizard", "text": "I have not, but it seems like a good film and premise. I will have to see this horror film at some point. Have you seen Suspiria?"}, {"speaker": "0_Apprentice", "text": "I have seen parts of it. Suspiria seems like a fun movie. Is it a horror film?"}, {"speaker": "1_Wizard", "text": "Yes it is, the same director also made the film Inferno - Dario Argento."}, {"speaker": "0_Apprentice", "text": "That is so cool. I have not heard of Dario Argento. What are his other films?"}, {"speaker": "1_Wizard", "text": "Deep Red is one of them. He is known as one of the great European horror film directors."}, {"speaker": "0_Apprentice", "text": "Can you tell me about Deep Red?"}, {"speaker": "1_Wizard", "text": "It is a thriller film directed by Argento and co written with Bernardino Zapponi"}, {"speaker": "0_Apprentice", "text": "Zapponi is a funny name. He is a Director as well?"}, {"speaker": "1_Wizard", "text": "No just a writer I believe. He does other stuff too like screenwriting."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 8672, "dialogue": [{"speaker": "0_Wizard", "text": "I am depressed i feel guilty, and anger because i dont know how to speak another language besides english"}, {"speaker": "1_Apprentice", "text": "I'm sorry to hear that why do ypu want to learn another language? "}, {"speaker": "0_Wizard", "text": "Because all of my friends speak othe languages, so i feel depressed, i feel ashamed."}, {"speaker": "1_Apprentice", "text": "Awe, you should not feel ashamed! I know how to do sign language i been teaching my self since i was 15 maybe you could use an app and teach yourself a new language? "}, {"speaker": "0_Wizard", "text": "You must be really smart, sing language sound difficult to use manual communication to convey meaning sounds hard"}, {"speaker": "1_Apprentice", "text": "It's realy not to hard its really fun and easy once u get the hang of it . its just facial expressions and using your hands. "}, {"speaker": "0_Wizard", "text": "Facial expressions are hard to read! i read that they are a form on nonverbal communication, im too bad at it"}, {"speaker": "1_Apprentice", "text": "Don't be so negative ypu can do anything u want if you set your mind to it .What language would you loke to learn?"}, {"speaker": "0_Wizard", "text": "I was looking to learn spanish, i do can do anything i want like the american singer lady gaga's song \"Do What You Want\" with r. kelly"}, {"speaker": "1_Apprentice", "text": "Exactly!!! So take control and learn stop feeling depressed and get motivated good luck :) "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 10164, "dialogue": [{"speaker": "0_Apprentice", "text": "I was thinking of getting a pet snake. What can you tell me about them?"}, {"speaker": "1_Wizard", "text": "They are elongated, legless, carnivorous reptiles. Actually growing up we had a albino burmese python. She was 22 feet when she died of old age. "}, {"speaker": "0_Apprentice", "text": "Wow that is awesome. What did you feed your 22 foot python?"}, {"speaker": "1_Wizard", "text": "Rabbits and Chickens or Louisiana swamp rats. Lots of species of snakes have skulls with several more joints than their lizard ancestors which allows them to eat such large things."}, {"speaker": "0_Apprentice", "text": "Now that is a meal. I wonder how one acquires Louisiana swamp rats. Maybe set up some traps?"}, {"speaker": "1_Wizard", "text": "we got them from breeders. Snakes are found on every continent except Antarctica,"}, {"speaker": "0_Apprentice", "text": "Maybe one day there will be a arctic breed acclimated to the cold climate."}, {"speaker": "1_Wizard", "text": "I'm sure in time nature will evolve a snake that can handle a long, cold winters and short, cool summers."}, {"speaker": "0_Apprentice", "text": "I think I will start small. Probably get a garter snake for a pet."}, {"speaker": "1_Wizard", "text": "That's actually the state animal of Massachusetts. "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 10814, "dialogue": [{"speaker": "0_Wizard", "text": "I am allergic to shellfish which are oddly not even a type of fish."}, {"speaker": "1_Apprentice", "text": "they aren't. Then what the heck are they?"}, {"speaker": "0_Wizard", "text": "Many types of shellfish are actually crustaceans which are closer to insects. There are other types as well."}, {"speaker": "1_Apprentice", "text": "Insects you say? oh my. I wonder if a bug tastes as good as a lobster."}, {"speaker": "0_Wizard", "text": "They might taste similar since they are closely related, common ones that are eaten are shrimp, lobsters, crabs and crayfish. Crayfish remind me of insects a lot."}, {"speaker": "1_Apprentice", "text": "Maybe I should try that. What else do they have in common with insects?"}, {"speaker": "0_Wizard", "text": "They are invertebrates. They are both in the main class of the phylum Arthropoda so they are both arthropods which have an exoskeleton. "}, {"speaker": "1_Apprentice", "text": "I never knew that. You are just full of facts. "}, {"speaker": "0_Wizard", "text": "Shellfish also includes cephalopods such as squids and octopuses, even though they don't really have a \"shell\"."}, {"speaker": "1_Apprentice", "text": "thank you so much for telling me that"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 7560, "dialogue": [{"speaker": "0_Wizard", "text": "Hi. Eating some cookies for breakfast. It seems they usually contain flour sugar and some fast in some combination. "}, {"speaker": "1_Apprentice", "text": "Wow cookies for breakfast seems kind of unhealthy if I'm being honest. What about some oatmeal and a banana instead?"}, {"speaker": "0_Wizard", "text": "It's not the typical first meal of the day that most people undertake before work, that's for sure. "}, {"speaker": "1_Apprentice", "text": "You're certainly correct about that. Some people skip breakfast altogether, I think it's called intermittent fasting."}, {"speaker": "0_Wizard", "text": "I think that's a good idea to combine with cutting back on calories if you want to lose weight."}, {"speaker": "1_Apprentice", "text": "For sure, I think the idea is growing in popularity as well. What kind of foods do you enjoy eating other than cookies?"}, {"speaker": "0_Wizard", "text": "More like what don't I like, lol.  Did you see The Food Wife episode of the Simpsons? That was funny."}, {"speaker": "1_Apprentice", "text": "No I'm not familiar with that, can you explain it a bit?"}, {"speaker": "0_Wizard", "text": "Yeah, it was the fifth episode of the 23rd season, and came on November 13, 2011"}, {"speaker": "1_Apprentice", "text": "Interesting, and can you explain a bit about the plot of The Food Wife if possible?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 507, "dialogue": [{"speaker": "0_Wizard", "text": "I love role playing games being able to act out the roles within a narrative."}, {"speaker": "1_Apprentice", "text": "Really what kind roles do you act out"}, {"speaker": "0_Wizard", "text": "Well, In the Original Form its through discussion type, whereas In live action, the players physically perform the character actions."}, {"speaker": "1_Apprentice", "text": "That sounds interesting.  What kind of action do they perform?"}, {"speaker": "0_Wizard", "text": "Some RPG perform single player roles where they undertake quests. Thats my favorite."}, {"speaker": "1_Apprentice", "text": " Is this role-playing in a video game setting?"}, {"speaker": "0_Wizard", "text": "There are several types or RPG , especially in electronic media. "}, {"speaker": "1_Apprentice", "text": "what is an RPG?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 4360, "dialogue": [{"speaker": "0_Apprentice", "text": "Hello there! Have you every tried a vegan diet?"}, {"speaker": "1_Wizard", "text": "I don't think I ever could!"}, {"speaker": "0_Apprentice", "text": "Really? I'm vegan and it's surprisingly easy. Just some humps you have to get over in the beginning. It makes cooking more creative I think."}, {"speaker": "1_Wizard", "text": "I might try it using preference learning."}, {"speaker": "0_Apprentice", "text": "Preference learning? What's that?"}, {"speaker": "1_Wizard", "text": "preference learning is using the ability of \"learning to rank\""}, {"speaker": "0_Apprentice", "text": "Oh how interesting. Is it useful for a lot of things?"}, {"speaker": "1_Wizard", "text": "It's very useful in artificial intelligence."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 2447, "dialogue": [{"speaker": "0_Apprentice", "text": "Education is important but so far the system is broken."}, {"speaker": "1_Wizard", "text": "I knpw, education is ridiculously important to everyone in the world. It has to do with knowledge too."}, {"speaker": "0_Apprentice", "text": "How can I get good education?"}, {"speaker": "1_Wizard", "text": "A good education stems from going to a good school and trying hard to acquire knowledge and values."}, {"speaker": "0_Apprentice", "text": "Okay. What else do I need to know?"}, {"speaker": "1_Wizard", "text": "Education involves knowledge, skills, values, and beliefs."}, {"speaker": "0_Apprentice", "text": "That's interesting.  So values are important education too!"}, {"speaker": "1_Wizard", "text": "Oh definitely, also habits are important to education too!"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 5613, "dialogue": [{"speaker": "0_Wizard", "text": "I really like cupcakes. It is just enough of a cake to serve one person."}, {"speaker": "1_Apprentice", "text": "I absolutely love cupcakes. I like to bake them too!"}, {"speaker": "0_Wizard", "text": "Me too! The earliest mention of a cupcake was in 1796. Like did George Washington eat cupcakes?"}, {"speaker": "1_Apprentice", "text": "Wow, that was a very long time ago that cupcakes were first made. What else do you know about their history?"}, {"speaker": "0_Wizard", "text": "In the 19th centure, there were two different uses for 'cup cake' and 'cupcake'"}, {"speaker": "1_Apprentice", "text": "Oh I never thought about their name before. So why are they even called cup cakes? "}, {"speaker": "0_Wizard", "text": "Mostly because they are baked in a small thin paper or aluminum cup."}, {"speaker": "1_Apprentice", "text": "Okay that's interesting. I like how many flavors there is of cupcakes too!"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 12563, "dialogue": [{"speaker": "0_Wizard", "text": "The Coors brewing company operates out of Golden Colorado.  Have you ever had any of their products?"}, {"speaker": "1_Apprentice", "text": "Sure, I like their beer.  Do you know when was the company founded?"}, {"speaker": "0_Wizard", "text": "It was first established in the year of 1873"}, {"speaker": "1_Apprentice", "text": "Besides beer do they produce other things?"}, {"speaker": "0_Wizard", "text": "They also sold malted milk to the Mars candy company."}, {"speaker": "1_Apprentice", "text": "Ok, any idea if they are a public or private company?"}, {"speaker": "0_Wizard", "text": "I don't know that but they are the worlds 3rd largest brewing company."}, {"speaker": "1_Apprentice", "text": "They must be huge.  Do they sell beer just in the U.S. or around the world too?"}, {"speaker": "0_Wizard", "text": "They do not sell beer in other countries but the founders first came from Germany."}, {"speaker": "1_Apprentice", "text": "Interesting, It seem like good beer always come from Germany, one way or the other.  And what  is the name of its founder?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 2451, "dialogue": [{"speaker": "0_Apprentice", "text": "During the week I work as a barista at Portuguese restaurant."}, {"speaker": "1_Wizard", "text": "Ahhh, the Barista. That is Italian for bartender. But, as you know, it is now used for coffee shop workers."}, {"speaker": "0_Apprentice", "text": "It is often used for coffee shop workers. I think barista has evolved into many things these days in the hospitality industry. It is the title that I use at my place of employment."}, {"speaker": "1_Wizard", "text": "Yes. In Italian female barmaids were called baristes."}, {"speaker": "0_Apprentice", "text": "Well now the term is genderless. It can apply to both females and males, at least it does where I work. "}, {"speaker": "1_Wizard", "text": "We aim for gender neutrality these days, so we used gender less language to avoid referring specifically to males or females."}, {"speaker": "0_Apprentice", "text": "I think that is a good thing. I personally prefer to call myself a server though. I think the word barista is a little old school."}, {"speaker": "1_Wizard", "text": "I could see why you'd think so. It avoids the whole gender neutrality struggle and supports public policies designed to eliminate gender distinctions."}, {"speaker": "0_Apprentice", "text": "This is all so interesting! And to think all of this came from talking about the term barista!"}, {"speaker": "1_Wizard", "text": "It does take a special skill to make espresso, so I value your work."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 8418, "dialogue": [{"speaker": "0_Apprentice", "text": "Do you know the muffin man?  I love to bake, especially strawberry muffins.  they smell so good right out of the oven!!!"}, {"speaker": "1_Wizard", "text": "I remember it being a nursery rhyme or children's song. "}, {"speaker": "0_Apprentice", "text": "i had forgotten about the song. LOL that you brought it up.  I also like chocolate muffins, do you have any good recipes for muffins that you would like to share with me?"}, {"speaker": "1_Wizard", "text": "I actually buy fresh muffins at my local bakery or coffeehouse. "}, {"speaker": "0_Apprentice", "text": "ooh. i also love white chocolate and macadamia nut muffins. have you ever had those?"}, {"speaker": "1_Wizard", "text": "I have not although I get a muffin for breakfast most days and may try that, it sounds yummy!"}, {"speaker": "0_Apprentice", "text": "I wish there was somewhere around here that i could get a good muffin.  All we have is Dunkin Donuts, which is fine but usually stale."}, {"speaker": "1_Wizard", "text": "Have you had any factory baked muffins that are sold at the grocery store or a convenience store? "}, {"speaker": "0_Apprentice", "text": "I don't think i would like those. Are you talking about Entenmanns or Hostess muffins?"}, {"speaker": "1_Wizard", "text": "Yes, some of them are very moist. "}, {"speaker": "0_Apprentice", "text": "i will have to try them. it has been a few years, but the last time i bought some they were tiny, expensive, and tasteless.  But thanks for the tips!!!!"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 1759, "dialogue": [{"speaker": "0_Apprentice", "text": "Are you a fan of iPhones?"}, {"speaker": "1_Wizard", "text": "I honestly just got a iphone Saturday I always wanted one because they are the top iOS mobile operating system but now I-'m like what is the hype for lol."}, {"speaker": "0_Apprentice", "text": "Did you like your previous smartphone better?"}, {"speaker": "1_Wizard", "text": "Yes I did I have been team android for years and my last mobile device was great it was a touchscreen, which phone do you have?"}, {"speaker": "0_Apprentice", "text": "I have the iPhone 6s. I've never used Android or any other type of smartphone so I have nothing to compare it to."}, {"speaker": "1_Wizard", "text": "I love the camera on the iPhones I can say that Apple did good coming up with this smartphone design and market and I have the 8 plus."}, {"speaker": "0_Apprentice", "text": "The 8 is a nice phone. I'm hoping to upgrade to that one soon."}, {"speaker": "1_Wizard", "text": "The look is so nice it has a glass back piece so I made sure I got a autobox case lol and I have alot of storage so I got lot's of video games and social networks downloaded. "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 1147, "dialogue": [{"speaker": "0_Wizard", "text": "I own a Ford F-Series light duty pickup. Do you own a truck?"}, {"speaker": "1_Apprentice", "text": "No, but i really want a big truck with a lift kit"}, {"speaker": "0_Wizard", "text": "That would be very useful. You should consider the Ford F-Series as it's been the best selling truck in the United States since 1981."}, {"speaker": "1_Apprentice", "text": "I'm not a big fan of Fords. I've heard they aren't that reliable"}, {"speaker": "0_Wizard", "text": "Well Canada sure likes them. They're the best selling vehicle there too."}, {"speaker": "1_Apprentice", "text": "Interesting! I didn't know that. "}, {"speaker": "0_Wizard", "text": "Yeah and the most popular version is the F-150 and it's now in its 13th generation."}, {"speaker": "1_Apprentice", "text": "I guess people really like this car. I'll definitely check it out"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 3119, "dialogue": [{"speaker": "0_Wizard", "text": "Ever heard of Sir Alfred Hitchcock?"}, {"speaker": "1_Apprentice", "text": "I have, he did those creepy movies back in the day didn't he? Like \"The Birds\"?"}, {"speaker": "0_Wizard", "text": "Yeah, way back in the day too. He was born on August 13 1899."}, {"speaker": "1_Apprentice", "text": "Oh wow, that's a long time ago! I remember all of his movies were in black and white. It added to the spookiness."}, {"speaker": "0_Wizard", "text": "I agree! It's a shame that he died, as he passed away on April 29, 1980."}, {"speaker": "1_Apprentice", "text": "I thought he died long before I was born in the 80s, do you know how he died? Was it a bird attack?"}, {"speaker": "0_Wizard", "text": "I don't think that Sir Alfred Hitchcock died in a bird attack, as ironic as that would be."}, {"speaker": "1_Apprentice", "text": "It would be delightfully ironic lol"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 14691, "dialogue": [{"speaker": "0_Wizard", "text": "Do you have anyone in your family that is a truck driver, they earn a living by driving a semi truck"}, {"speaker": "1_Apprentice", "text": "I actually don't, but I have a friend that does! It's a tough job. The hours are really long and driving the truck is a lot more exhausting than it looks."}, {"speaker": "0_Wizard", "text": "Although they do provide an essential service by transporting goods and raw materials over land - "}, {"speaker": "1_Apprentice", "text": "They do. It's a very important job! Don't you need a special license to do it?"}, {"speaker": "0_Wizard", "text": "In the US, I believe they need a CDL License - and part of that is that they are responsible for inspecting their vehicle for issues related to safe operation."}, {"speaker": "1_Apprentice", "text": "Ahh makes sense. Safety is very important. I would think they needed specialized training too, parking a semi truck can't be easy!"}, {"speaker": "0_Wizard", "text": "Yes, driving commercial vehicles definitely requires advanced skills and knowledge above and beyond those required to drive a car."}, {"speaker": "1_Apprentice", "text": "Do you know how much they get paid on average? Special skills must mean decent pay..."}, {"speaker": "0_Wizard", "text": "I am not sure exactly but I think they are paid by the mile verses the trip or what they are hauling - but they also have a take breaks such as resting for 15 minutes every 5 hours, 30 minutes every 8 , etc.."}, {"speaker": "1_Apprentice", "text": "Ahhh...that would explain all those rest stops that you see on the highways. That's an interesting way to get paid! "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 14908, "dialogue": [{"speaker": "0_Apprentice", "text": "Do you ever watch HGTV? They have so many shows now about those Tiny houses."}, {"speaker": "1_Wizard", "text": "I don't have cable, so I don't get HGTV, but I think I have seen a show or two on Tiny Houses."}, {"speaker": "0_Apprentice", "text": "The whole movement towards living simpler and minimal has really caught on with living in a tiny house. Have you seen one before?"}, {"speaker": "1_Wizard", "text": "I don't think my area has much of a tiny house movement, because it is a big city."}, {"speaker": "0_Apprentice", "text": "They are actually pretty functional and eco-friendly. They really implement a lot of multi-functional furniture in them. "}, {"speaker": "1_Wizard", "text": "I think I read an article about Fred Schultz, he had furniture and fixtures like a bath that was also a sink."}, {"speaker": "0_Apprentice", "text": "That's interesting. I guess you have to combine different things like that to save space. "}, {"speaker": "1_Wizard", "text": "He also made them specifically for the climate in Australia.  "}, {"speaker": "0_Apprentice", "text": "Wow, I know that the toilets supposedly flush in a differrent direction in Australia. "}, {"speaker": "1_Wizard", "text": "He included composting toilets in his designs, those don't use water so It is probably hard to tell what direction they swirl."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 9581, "dialogue": [{"speaker": "0_Wizard", "text": "I just found out that the word pizza was first recorded in the 10th century! Wow!"}, {"speaker": "1_Apprentice", "text": "Seriously? Tell me that it was recorded in Italy!"}, {"speaker": "0_Wizard", "text": "Absolutely! It was found in a manuscript in Southern Italy in the town of Gaeta."}, {"speaker": "1_Apprentice", "text": "Italy sounds absolutely amazing, to be honest. Have you ever been there?"}, {"speaker": "0_Wizard", "text": "I have once! I visited Southern Italy a few years ago, it's unlike anything I've ever seen. The culture is so unique!"}, {"speaker": "1_Apprentice", "text": "Ahh, that is so lucky. Is the Italian food as good as they claim it to be?"}, {"speaker": "0_Wizard", "text": "Oh yeah! And the variety of types of Italian food is insane. Food from North Italy and from South Italy are very diverse."}, {"speaker": "1_Apprentice", "text": "Really? How do the Northern and Southern cuisine differ?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 7111, "dialogue": [{"speaker": "0_Apprentice", "text": "My wife is a teacher, i have no idea how she does it"}, {"speaker": "1_Wizard", "text": "I respect teachers, they have to deal with tons of children all day which must be exhausting!"}, {"speaker": "0_Apprentice", "text": "yes! and she also brings some papers home so she works after work too"}, {"speaker": "1_Wizard", "text": "Cool, is she an art teacher?"}, {"speaker": "0_Apprentice", "text": "no she isn't, she teaches science"}, {"speaker": "1_Wizard", "text": "Awesome! Did she do any professional work beyond teaching/"}, {"speaker": "0_Apprentice", "text": "no, she loves being a teacher"}, {"speaker": "1_Wizard", "text": "Cool, anyone can \"teach\" something but it takes a certain type to do it for a living."}, {"speaker": "0_Apprentice", "text": "i totally agree with you. Do you know anything interesting about teachers?"}, {"speaker": "1_Wizard", "text": "Yes, a teacher's role varies depending on the culture. In Asia they are highly venerated as members of society."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 8998, "dialogue": [{"speaker": "0_Apprentice", "text": "Pugs are so crazy adorable!  My Aunt and Uncle have two; Norman and Lewis.  They are super adorable as puppies!"}, {"speaker": "1_Wizard", "text": "I agree that they are pretty adorable, with those little wrinkly and muzzled faces."}, {"speaker": "0_Apprentice", "text": "Yes!  Their faces are so squishy.  They are my favorite of small dog breeds.  Norman, the older one, got so fat he couldn't breathe though."}, {"speaker": "1_Wizard", "text": "I'm sorry to hear that. I really like the fine glossy coat of the pugs and also the range of colors that they can have."}, {"speaker": "0_Apprentice", "text": "He lost weight and was much better but Pugs do have a tendency to get chunky but my Uncle fed him too many treats and human food.  Yes, they own a fawn color and Lewis, the puppy, is black. I like the fawn color coat."}, {"speaker": "1_Wizard", "text": "That's good to hear that he survived. I also like how well their muscles usually develop."}, {"speaker": "0_Apprentice", "text": "Yes, he's doing well but has to be on diet food.  Its human's fault for feeding them stuff they shouldn't. How do their muscles develop?"}, {"speaker": "1_Wizard", "text": "I'm not familiar with the science behind the muscle development of pugs. But from looking at them I can say that modern pugs often have a compact form, deep chest, and developed muscles when they come of age."}, {"speaker": "0_Apprentice", "text": "I see what you mean.  Yes, we always joke that they are one big muscle with how hard their bodies are.  I often wonder how their faces got the smashed look. "}, {"speaker": "1_Wizard", "text": "Their faces are interesting from a genetic standpoint. A pug was also judged as best in show at the World Dog Show in 2004."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 17690, "dialogue": [{"speaker": "0_Wizard", "text": "I want to get a BMW car one day. BMW is a German automobile and motorcycle company."}, {"speaker": "1_Apprentice", "text": "Same here, they look great!"}, {"speaker": "0_Wizard", "text": "The company was started in 1916 and has its headquarters in Munich, Bavaria."}, {"speaker": "1_Apprentice", "text": "That's such a long time ago, damn."}, {"speaker": "0_Wizard", "text": "It is. BMW produces vehicles in Germany, China, South Africa, India, Brazil, and the United States."}, {"speaker": "1_Apprentice", "text": "Wow, that's really interesting!"}, {"speaker": "0_Wizard", "text": "In 2015 BMW was the 12th largest producer of motor vehicles with 2,279,503 produced."}, {"speaker": "1_Apprentice", "text": "Only the 12th? That's pretty low for how big they are."}, {"speaker": "0_Wizard", "text": "True. The Quandt family are the biggest shareholders with the remaining stocks owned by public float."}, {"speaker": "1_Apprentice", "text": "That family must be pretty loaded then."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 6024, "dialogue": [{"speaker": "0_Apprentice", "text": "I wanted to try cooking with tomatoes sometime, do you know anything about tomatoes in general?"}, {"speaker": "1_Wizard", "text": "i love them for one, is the edible, often red, fruit of the plant \"Solanum lycopersicum\""}, {"speaker": "0_Apprentice", "text": "Are there other fruits in the Solanum genus?"}, {"speaker": "1_Wizard", "text": "well The plant belongs to the nightshade family"}, {"speaker": "0_Apprentice", "text": "What else belongs to the nightshade family?"}, {"speaker": "1_Wizard", "text": "I read in a book that  Its use as a cultivated food may have originated with the indigenous peoples of Peru"}, {"speaker": "0_Apprentice", "text": "Okay, that's pretty cool. Can you tell me anything else about Peru?"}, {"speaker": "1_Wizard", "text": "if i recall The Spanish discovered the tomato from their contact with the Aztec peoples during the Spanish colonization"}, {"speaker": "0_Apprentice", "text": "That's interesting, but not really related to Peru. Can you tell me anything about the Aztec people though? They sound interesting."}, {"speaker": "1_Wizard", "text": "i do know that  Numerous varieties of tomato are widely grown in temperate climates across the world"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 11680, "dialogue": [{"speaker": "0_Wizard", "text": "The poodle is a group of formal dog breeds"}, {"speaker": "1_Apprentice", "text": "Poodles are neat! There are all sorts of types of poodle and I believe they're quite good natured. Do you have one?"}, {"speaker": "0_Wizard", "text": "I do have one named charlie that had has a parent that was best in show"}, {"speaker": "1_Apprentice", "text": "Wow, a pedigree poodle no less! Where do poodles come from originally?"}, {"speaker": "0_Wizard", "text": "the origins of the poodle are still discussed over them coming from germany as a type of french barbet breed variant"}, {"speaker": "1_Apprentice", "text": "I might have guessed Germany. Can you tell me a little more about them please."}, {"speaker": "0_Wizard", "text": "poodles have taken top honors in many shows including the Westminster kennel club dog show in 1991 and 2002!"}, {"speaker": "1_Apprentice", "text": "Very impressive. I love to watch the Westminster show - so many beautiful dogs! Do you show your poodle?"}, {"speaker": "0_Wizard", "text": "No I dont have the time but they are an intelligent dog breed just behind the border collie."}, {"speaker": "1_Apprentice", "text": "Well I know how smart border collies are, so poodles are no slouches! Many people say dogs are not smart, but every dog I've had has been very intelligent."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 8209, "dialogue": [{"speaker": "0_Apprentice", "text": "I need to get my eyes checked for glasses, because I have noticed my vision getting worse, especially at night when I am driving."}, {"speaker": "1_Wizard", "text": "Glasses are typically used for vision correction "}, {"speaker": "0_Apprentice", "text": "I know that..."}, {"speaker": "1_Wizard", "text": "Also some people where corrective lens over their eyes to help with their vision."}, {"speaker": "0_Apprentice", "text": "This is not knew information, but thank you I guess."}, {"speaker": "1_Wizard", "text": "They will put the lenses right on the surface of the eyes."}, {"speaker": "0_Apprentice", "text": "Oh you mean contact lenses...yes I am very aware of contact lenses. Do you have any new information regarding vision correction?"}, {"speaker": "1_Wizard", "text": "I know that there is a estimated the 125 million people worldwide are using contact lenses."}, {"speaker": "0_Apprentice", "text": "Thats more than I would have thought. I bet most of them are in the US."}, {"speaker": "1_Wizard", "text": "Only about one third is from the U.S.wear them and two thirds of all contact lens are women.. "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 17928, "dialogue": [{"speaker": "0_Wizard", "text": "I love making beadwork, it's the art of attaching beads to one another by stringing them in case you're not familiar."}, {"speaker": "1_Apprentice", "text": "I am not! What more can you tell me about it! Never heard of it before!"}, {"speaker": "0_Wizard", "text": "Well going back in history beads were used for religious purposes and as good luck talismans, nowadays beadwork is mostly a hobby to create jewelry and stuff."}, {"speaker": "1_Apprentice", "text": "Is there anywhere in particular that this craft originated from?"}, {"speaker": "0_Wizard", "text": "I don't think any one area in particular, but beads were found in the archaelogical record so we've probably used them for as long as modern man has been around."}, {"speaker": "1_Apprentice", "text": "Wow, impressive! And what about today? Is it a pop culture thing?"}, {"speaker": "0_Wizard", "text": "I think it's a creative outlet, people want to make nice looking jewelry or handbags or other crafts, and beads help give the creations some aesthetic appeal."}, {"speaker": "1_Apprentice", "text": "SO it seems like it is for everyone!"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 492, "dialogue": [{"speaker": "0_Apprentice", "text": "I love cooking but I am a terrible baker! I need to bake an apple crumb cake, what do I do?"}, {"speaker": "1_Wizard", "text": "Well usually whenever I need baking help I Google it so I'd suggest that! I like baking bread sometimes, but cakes and cookies are good too."}, {"speaker": "0_Apprentice", "text": "Ohh bread.. Maybe I will make that... How do you make bread?"}, {"speaker": "1_Wizard", "text": "Well you just need some dough, water, and yeast and then you can bake it in the oven, quite simple."}, {"speaker": "0_Apprentice", "text": "You don't need anything else? What if I add pepperoni to it? Do I put in from the start or later on in the cooking process?"}, {"speaker": "1_Wizard", "text": "I wouldn't suggest adding a cure porked and beef mixed-together product in my bread, but I guess you could try, I'd add it in from the start I suppose."}, {"speaker": "0_Apprentice", "text": "Well Italian culture we cook pepperoni and mozz bread you should try it, it's good!  I just don't know how! lol"}, {"speaker": "1_Wizard", "text": "Oh that does sound kind of good. Google will help you out I'm sure, and will let you create a nice baked bread with a firm dry crust and a soft, pepperoni center, yum!"}]}, "correction": "yes", "error": "E4", "turn": "2", "phrase": "-", "user_reaction": "UR1"}, {"turns": {"dialogue_id": 141, "dialogue": [{"speaker": "0_Wizard", "text": "I have brown hair,What's your hair type?"}, {"speaker": "1_Apprentice", "text": "I have blue hair, and my hair type is 4A"}, {"speaker": "0_Wizard", "text": "Brown hair is characterized by higher levels of the dark pigment eumelanin and lower levels."}, {"speaker": "1_Apprentice", "text": "That's cool I didn't knoow that. I do know that blue dyes have stronger ions, which makes it harder  to remove."}, {"speaker": "0_Wizard", "text": "They are natural  dyes natural dyes are vegetable dyes from plant sources—roots, berries, bark, leaves, and wood—and other biological sources."}, {"speaker": "1_Apprentice", "text": "Oh okay that is cool, so our hair are kind of like plants?"}, {"speaker": "0_Wizard", "text": "Sure, it would interest you to know that in China ,dyeing with plants, barks and insects has been traced back more than 5,000 years. "}, {"speaker": "1_Apprentice", "text": "I think they also do that in India too!"}, {"speaker": "0_Wizard", "text": "The French word for brunet\", which is a diminutive form of \"brun\" meaning \"brown/brown-haired\"?, "}, {"speaker": "1_Apprentice", "text": "Brown in french is marron though?"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 9695, "dialogue": [{"speaker": "0_Apprentice", "text": "My favorite band from the 90s is Pearl Jam."}, {"speaker": "1_Wizard", "text": "Oh yeah Pearl Jam the American Rock Band"}, {"speaker": "0_Apprentice", "text": "Yep, they're pretty awesome. I especially love the song \"Jeremy\"."}, {"speaker": "1_Wizard", "text": "Pearl Jam formed in Seattle Washington in 1990"}, {"speaker": "0_Apprentice", "text": "What's the lead singer's name again? I can never remember his name for the life of me."}, {"speaker": "1_Wizard", "text": "Lead vocals is Eddie Vedder"}, {"speaker": "0_Apprentice", "text": "That's right! I can't believe I forgot lol Are they still making new albums these days?"}, {"speaker": "1_Wizard", "text": "Not sure but to date they have sold 60 million albums world wide"}, {"speaker": "0_Apprentice", "text": "That's a lot! Have they won a lot of awards for their music?"}, {"speaker": "1_Wizard", "text": "They have and they are considered one of the leading bands of the grunge movement"}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 16433, "dialogue": [{"speaker": "0_Wizard", "text": "Surfing is a fun sport, I just wish I had guts to ride those monster waves."}, {"speaker": "1_Apprentice", "text": "very like surfing sport"}, {"speaker": "0_Wizard", "text": "But do you surf yourself, are you a part of this culture?"}, {"speaker": "1_Apprentice", "text": "yes"}, {"speaker": "0_Wizard", "text": "Come one, you have to tell me about your surfing experience."}, {"speaker": "1_Apprentice", "text": "i have 2 years experience surfing. i am enjoy"}, {"speaker": "0_Wizard", "text": "What is the biggest wave you've ridden and where?"}, {"speaker": "1_Apprentice", "text": "10ft wave my biggest ride. "}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}, {"turns": {"dialogue_id": 17972, "dialogue": [{"speaker": "0_Apprentice", "text": "I love the guitar do you play it?"}, {"speaker": "1_Wizard", "text": "Sure do! I've been teaching myself how to play acoustic guitar, and I think someday I might also wanna learn jazz guitar!"}, {"speaker": "0_Apprentice", "text": "I have heard most rock has jazz notes in it"}, {"speaker": "1_Wizard", "text": "Yeah I guess you could say that guitar solos are heavy on the polyrhythms and improvisation, so in a way they could be considered jazzy."}, {"speaker": "0_Apprentice", "text": "Do you have any songs you want to learn?"}, {"speaker": "1_Wizard", "text": "I'd have to say I want to learn most of the Johnny Cash discography at least right now, then move on to The Flashbulb."}, {"speaker": "0_Apprentice", "text": "I have never heard of that before"}, {"speaker": "1_Wizard", "text": "Well I assume you don't mean you've never heard of Johnny Cash, because he's one of the best-selling musical artists EVER."}, {"speaker": "0_Apprentice", "text": "Is he the guy that wrote that Hurt song?"}, {"speaker": "1_Wizard", "text": "Yes indeed, and songs from a lot of other genres too. Blues, folk, gospel if you like it. He did them all."}]}, "correction": "no", "error": "", "turn": "", "phrase": "", "user_reaction": ""}]