[{"turns": {"dialogue_id": 3642, "dialogue": [{"speaker": "0_Wizard", "text": "Lightning McQueen, typically referred to by his surname McQueen, is an anthropomorphic stock car in the animated Pixar film \"Cars"}, {"speaker": "1_Apprentice", "text": "My neighbor's grandson loves that program. He has a toy car he calls Lightning McQueen!"}, {"speaker": "0_Wizard", "text": " its sequels \"Cars 2\" (2011), \"Cars 3\" (2017), and TV shorts known as \"Cars Toons."}, {"speaker": "1_Apprentice", "text": "What are TV shorts and is Lightning McQueen in them?"}, {"speaker": "0_Wizard", "text": "This is a list of characters from the Pixar franchise \"Cars\", as well as the Disney franchise \"Planes\", which is set in the same fictional universe: Lightning McQueen, often referred to as \"McQueen\", is the main character in \"Cars"}, {"speaker": "1_Apprentice", "text": "I don't see a list of characters - are you copying this from somewhere?"}, {"speaker": "0_Wizard", "text": "LOL! Copy protection, also known as content protection, copy prevention and copy restriction, is any effort designed to prevent the reproduction of software, films, music, and other media"}, {"speaker": "1_Apprentice", "text": "Presumably you're here to discuss Lightning McQueen. Please give me some information on the topic. Thank you."}, {"speaker": "0_Wizard", "text": "THE inspiration of the  design is inspired by a stock car and \"a more curvaceous Le Mans endurance racer,\" with \"some Lola and some Ford GT40."}, {"speaker": "1_Apprentice", "text": "Fascinating. I must google more on this subject."}]}, "annotations": [{"error_type": "E7", "user_correction": "C1", "user_reaction": "UR5", "turn": "2", "phrase": "-"}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR5", "turn": "", "phrase": ""}, {"error_type": "E6", "user_correction": "C1", "user_reaction": "UR2", "turn": "3", "phrase": ""}]}, {"turns": {"dialogue_id": 2171, "dialogue": [{"speaker": "0_Wizard", "text": "I love Ice Hockey! Watching the teams of players zooming around the rink and shooting that vulcanized rubber puck into the net really gives me a thrill!"}, {"speaker": "1_Apprentice", "text": "That is awesome. I don't love Hockey, but I saw that the capitals won the cup this year."}, {"speaker": "0_Wizard", "text": "I have loved it my entire life. When i was a child, we would play street hockey in the street using roller skates and a softball for a puck."}, {"speaker": "1_Apprentice", "text": "That's awesome I would play street hockey as a kid. I grew up playing soccer."}, {"speaker": "0_Wizard", "text": "Hockey is so popular they even made a movie about it called \"Slap Shot\", and another called \"The  Mighty Ducks\". Remember those?"}, {"speaker": "1_Apprentice", "text": "I love THe Mighty Ducks! They were such cool kids. Who was your favorite?"}, {"speaker": "0_Wizard", "text": "I like the third movie, \"D3\", where Bombay announcfes he is leaving the team to take a job with the Junior Goodwill Games."}, {"speaker": "1_Apprentice", "text": "I never went that far in the series. Can you tell me more about \"D3\"?"}, {"speaker": "0_Wizard", "text": "At the beginning of the film, the ducks are awarded scholarships to Eden Hall Academy, this was after they won the Junior Goodwill Games in Los Angeles."}, {"speaker": "1_Apprentice", "text": "Really? That sounds like an interesting plot line. I feel like Los Angeles is a great spot."}, {"speaker": "0_Wizard", "text": "The Anaheim Ducks, a NHL team, was owned by Walt Disney who named their team after the movie."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 17110, "dialogue": [{"speaker": "0_Wizard", "text": "I have been a computer repair technician for about 10 years. I repair and maintain computers and servers. "}, {"speaker": "1_Apprentice", "text": "Cool, is it a tough job?"}, {"speaker": "0_Wizard", "text": "Yes, i have to configure new hardware, create new computer networks, and updating software."}, {"speaker": "1_Apprentice", "text": "I am not good at computers, did you have any training?"}, {"speaker": "0_Wizard", "text": "Yes, I had to go to a professional institution to get a certificate to prepare me for the job. It included classroom work and on the job teaching."}, {"speaker": "1_Apprentice", "text": "Wow. Sounds like a lot of work. Did you enjoy the classroom work?"}, {"speaker": "0_Wizard", "text": "Yes, but I enjoyed the apprenticeship even more. I got to learn my trade on actual jobs."}, {"speaker": "1_Apprentice", "text": "Thats cool. I wish I could get any apprenticeship."}, {"speaker": "0_Wizard", "text": "You could if you found something you really enjoyed."}, {"speaker": "1_Apprentice", "text": "I will do that. Thanks for the advice."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 5532, "dialogue": [{"speaker": "0_Apprentice", "text": "i used to love playing overwatch when it came ouot"}, {"speaker": "1_Wizard", "text": "Well, Overwatch is a team based multiplayer first person shooter game so I think a lot of people enjoy it (especially CoD types) but it was never my thing"}, {"speaker": "0_Apprentice", "text": "Do you know the company that designed said video game?"}, {"speaker": "1_Wizard", "text": "Indeed. Overwatch was developed by Blizzard Entertainment (yes that Blizzard) and was released on Windows, PS4, and Xbox One in 2016"}, {"speaker": "0_Apprentice", "text": "Blizzard is a really awesome game company i really like their game, do you play overwatch much?"}, {"speaker": "1_Wizard", "text": "Not really. It's not my type of game even though I do like team games. Oerwatch assigns players into two teams of six, so it is definitly a team based game with offense, defenses, tank, and support roles"}, {"speaker": "0_Apprentice", "text": "Yeah i really wish they could add new characters more often to make the game feel a little different"}, {"speaker": "1_Wizard", "text": "Well, on the plus side, players gain cosmetic rewards such as character skinds and victory poses which do not affect gameplay :p"}, {"speaker": "0_Apprentice", "text": "The victory poses are really nice and some really funny but over all i think overwatch is a great game for all people to enjoy"}, {"speaker": "1_Wizard", "text": "It's interesting to note, too, that Overwatch is Blizzard's fourth major franchise and happened because the mmo Titan was cancelled in 2014"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 17109, "dialogue": [{"speaker": "0_Wizard", "text": "Sleep is a naturally recurring state of mind and body, that helps us recover mentally and physically."}, {"speaker": "1_Apprentice", "text": "I love to sleep."}, {"speaker": "0_Wizard", "text": "The internal circadian clock promotes sleep daily at night, do you ever sleep at times other than night?"}, {"speaker": "1_Apprentice", "text": "Yes sometimes during the day."}, {"speaker": "0_Wizard", "text": "interesting, were you aware that the diverse purposes and mechanisms of sleep are still a mystery and are subject to ongoing research?"}, {"speaker": "1_Apprentice", "text": "I did not know that. You know a lot."}, {"speaker": "0_Wizard", "text": "I try, were you aware that REM stands for rapid eye movement?"}, {"speaker": "1_Apprentice", "text": "I did know that, also a very good band."}, {"speaker": "0_Wizard", "text": "Yeah it is! relationship between sleep and memory has been studied since the 19th century!"}, {"speaker": "1_Apprentice", "text": "I like to sleep as long as possible."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 5815, "dialogue": [{"speaker": "0_Wizard", "text": "Have you ever participated in the scavengerhunt of geocaching?"}, {"speaker": "1_Apprentice", "text": "I havent it it any fun?"}, {"speaker": "0_Wizard", "text": "yea, you find things that are often buried that can contain treasures like toys or trinkets for traiding"}, {"speaker": "1_Apprentice", "text": "I would love to go sometime!"}, {"speaker": "0_Wizard", "text": "Usually you find a waterproff container and a logbook that you can sign and add something to it for someone else to find"}, {"speaker": "1_Apprentice", "text": "Is their good places I should go look"}, {"speaker": "0_Wizard", "text": "There are many websites that have locations that are GPS coordinates that help you find the locations, but usually they are public parks"}, {"speaker": "1_Apprentice", "text": "Cool I will look into it"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 8429, "dialogue": [{"speaker": "0_Wizard", "text": "Have you heard of the German automobile manufacturer Porsche?"}, {"speaker": "1_Apprentice", "text": "Yeah I've heard of them.  They make sports cars, right?"}, {"speaker": "0_Wizard", "text": "Yep , that why Porsche's current lineup includes the 718 Boxster/Cayman, and 911!"}, {"speaker": "1_Apprentice", "text": "Are they good performing cars?  I like the sound of the one called Boxster!"}, {"speaker": "0_Wizard", "text": "Yes they sure are! The Porsche Boxster and Cayman are both mid-engined two-seater sports cars which you might like."}, {"speaker": "1_Apprentice", "text": "Do they get decent mileage?  I heard Sports cars often get pretty bad mileage."}, {"speaker": "0_Wizard", "text": "Yea thats true, but thats the trade-off for a high performance classic German sports car"}, {"speaker": "1_Apprentice", "text": "Well I still like the Boxster.  I may see if I could find a pre-owned one!"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 13459, "dialogue": [{"speaker": "0_Apprentice", "text": "I love going to the library! There is such a large selection of good books!"}, {"speaker": "1_Wizard", "text": "Me too! There's so much there, books, newspapers, periodicals, manuscripts, maps, film, DVDs, etc. You can find anything you want!"}, {"speaker": "0_Apprentice", "text": "I love how the books are organized.  I learned about the Dewey Decimal System in high school, and I think it is still used today"}, {"speaker": "1_Wizard", "text": "Yes, I remember it from school too. It's funny how a library can really be just a few books on a shelf, all the way up to millions of items!"}, {"speaker": "0_Apprentice", "text": "Somehow an e-book just isn't the same - I'd rather hold an actual book in my hands - mystery books are my favorite!"}, {"speaker": "1_Wizard", "text": "I prefer a book in my hand too. When I think back to the first libraries, having the first forms of writing, like the clay tablets in cuneiform script, it seems amazing to me. Some of them even dated back to 2600BC....can you imagine holding that?"}, {"speaker": "0_Apprentice", "text": "Wow!  It would be rather heavy if it's made of clay! What an interesting way to create something to be read!"}, {"speaker": "1_Wizard", "text": "It is, and so primitive to now. Personal libraries with written books were first noted in Greece in the 5th centry BC, so long books have been very important!"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 12390, "dialogue": [{"speaker": "0_Apprentice", "text": "i love cookies"}, {"speaker": "1_Wizard", "text": "I like them and my daughter is addicted. A cookie is a baked food that is small, flat and sweet but I'm sure you know that haha"}, {"speaker": "0_Apprentice", "text": "My favorite type is chocolate chip, i have always wanted to prepare a good cookie but always seem to bun them"}, {"speaker": "1_Wizard", "text": "I do that too, a lot. What's fun is you can use all types of ingredients like raisins,oats, chocolate, and nuts among other things "}, {"speaker": "0_Apprentice", "text": "I will defenetly have to try the raisins cookies sounds really good"}, {"speaker": "1_Wizard", "text": "I think it's funny everywhere except US and Canada call crisp cookies biscuits."}, {"speaker": "0_Apprentice", "text": "hahahah i think  i will go to the store later to buy some doe and see if i can cook them right this time"}, {"speaker": "1_Wizard", "text": "Or you could always buy mass produced cookies from factories. Although, small batch or homemade cookies do tend to be best"}, {"speaker": "0_Apprentice", "text": "Yeah but i find them a little bad once they spent a lot of time in the container"}, {"speaker": "1_Wizard", "text": "Yeah they don't seem to last long but my kids don't give them a chance to get stale. They are good with a drink like milk or coffee"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 11372, "dialogue": [{"speaker": "0_Apprentice", "text": "My friend likes to collect stamps. He has some that are 100 years old!"}, {"speaker": "1_Wizard", "text": "That is awesome. Stamp collecting is a great hobby as there are always new and different stamps available."}, {"speaker": "0_Apprentice", "text": "Yeah, I am always interested in the different kinds of stamps used around the world."}, {"speaker": "1_Wizard", "text": "Me too, I would love to have some old stamps that were issued in the 1840 when some one the worlds first stamps were issued."}, {"speaker": "0_Apprentice", "text": "I think the US started using stamps with the Postal Service was started. The Pony Express was amazing."}, {"speaker": "1_Wizard", "text": "Yes I believe you are correct. The pony express sadly only operated for 19 months"}, {"speaker": "0_Apprentice", "text": "It must have been very difficult due to travel through wilderness and Indian country."}, {"speaker": "1_Wizard", "text": "Yes it must have been. I wonder if that had some help in forming Wells Fargo?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 1012, "dialogue": [{"speaker": "0_Wizard", "text": "Are you colorblind having decreased ability to see color or differences in color?"}, {"speaker": "1_Apprentice", "text": "I am not colorblind but I have met people who are. "}, {"speaker": "0_Wizard", "text": "Achromatopsia is known as total color blindness"}, {"speaker": "1_Apprentice", "text": "Wow! I never knew the name for it. I wonder how exactly people with Achromatopsia view the world?"}, {"speaker": "0_Wizard", "text": "It is very severe and I believe they see the world in shades of gray.  Work is in progress for gene therapy."}, {"speaker": "1_Apprentice", "text": "If gene therapy results in success, I believe that people with Achromatopsia will feel like it's a whole new world filled with brightness and beauty!"}, {"speaker": "0_Wizard", "text": "Yes.  For those with partial color blindness it will provide increased job opportunities.  It affects many people, especially males."}, {"speaker": "1_Apprentice", "text": "Come to think of it, the people I've met with color blindness have been male. I do hope scientific advances increases all kinds of opportunities."}, {"speaker": "0_Wizard", "text": "Yes, some animal gene projects have been successful."}, {"speaker": "1_Apprentice", "text": "That sounds very promising! "}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 9053, "dialogue": [{"speaker": "0_Wizard", "text": "Sculpture is the branch of the visual arts that operates in three dimensions do you know any thing about it?"}, {"speaker": "1_Apprentice", "text": "I have heard of sculpting. Do you know any famous sculptures? "}, {"speaker": "0_Wizard", "text": "Cubist sculpture"}, {"speaker": "1_Apprentice", "text": "I see, what else do you know about this?"}, {"speaker": "0_Wizard", "text": "Cubist sculpture developed in parallel with Cubist painting, beginning in Paris around 1909 "}, {"speaker": "1_Apprentice", "text": "That was a long time ago. What does a cubist sculpture involve? "}, {"speaker": "0_Wizard", "text": "Cubist sculpture is rooted in Paul Cézanne's reduction of painted objects into component planes and geometric solids; cubes, spheres, cylinders, and cones"}, {"speaker": "1_Apprentice", "text": "When was Paul Cézanne born? He sounds like a famous person I should know about."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 13847, "dialogue": [{"speaker": "0_Wizard", "text": "I really like dogs. They are the most widely abudant carnivores!"}, {"speaker": "1_Apprentice", "text": "I love dogs but I've never had one! Are there many different breeds?"}, {"speaker": "0_Wizard", "text": "Well there are 337 pure bred dog breed that are recognized. "}, {"speaker": "1_Apprentice", "text": "Holy cow! That's a lot! What's a good dog breed to have as a pet?"}, {"speaker": "0_Wizard", "text": "Well if you live on farm an Australian Cattle Dog they are really good herding dogs and can cover long distances!"}, {"speaker": "1_Apprentice", "text": "That sounds like a good breed! Dogs are such smart animals, aren't they? It seems like they can be trained for so many different tasks!"}, {"speaker": "0_Wizard", "text": "Yeah they have played lots of roles like hunting, assisting police and even a role in the military."}, {"speaker": "1_Apprentice", "text": "That's so cool! What other neat facts can you tell me about dogs?"}, {"speaker": "0_Wizard", "text": "Well they come in all shapes and sizes!"}, {"speaker": "1_Apprentice", "text": "And they seem to have different coats, don't they? I've seen dogs with short, wiry hair and other with long, soft coats."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 16744, "dialogue": [{"speaker": "0_Apprentice", "text": "I don't know a lot about the actor Jason Mraz but I did see him in a Broadway show, Waitress which was amazing!"}, {"speaker": "1_Wizard", "text": "I kind of know who he is, I think his first hit was The Remedy, that was a while ago though."}, {"speaker": "0_Apprentice", "text": "Was that a film or a television show? I haven't heard of it before."}, {"speaker": "1_Wizard", "text": "It is a song, Jason Mraz is from my recollection a songwriter."}, {"speaker": "0_Apprentice", "text": "Oh, I had no idea. lol What other songs is he known for writing?"}, {"speaker": "1_Wizard", "text": "Only other one I can think of is \"I'm Yours\".  It is a good one though!"}, {"speaker": "0_Apprentice", "text": "Is he still writing songs today?"}, {"speaker": "1_Wizard", "text": "Not really sure to be honest, his last album I know of is Love is a Four Letter Word was apparently in 2012."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 8262, "dialogue": [{"speaker": "0_Apprentice", "text": "You know what? I really like the color blue."}, {"speaker": "1_Wizard", "text": "I love pastel colors."}, {"speaker": "0_Apprentice", "text": "That is very interesting.  Those colors show a person who is creative!"}, {"speaker": "1_Wizard", "text": "They remind me of the 1980's"}, {"speaker": "0_Apprentice", "text": "Oh yes the tie dye era! But did you know that blue symbolizes truth and confidence?"}, {"speaker": "1_Wizard", "text": "Tie-die was teh 1960's The 1980's were pink and blue pastel colors. "}, {"speaker": "0_Apprentice", "text": "Oh ok I got that mixed up! I am a 60's baby!  I guess I am partial to blue because it is peaceful..."}, {"speaker": "1_Wizard", "text": "I was born in the mid 70's so came of age right when the bright neon colors started. "}, {"speaker": "0_Apprentice", "text": "And now it would seemed that during this era that pretty much anything goes!"}, {"speaker": "1_Wizard", "text": "Super bright neon lights of all colors are the thing now. "}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E5", "user_correction": "C1", "user_reaction": "UR2", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 17852, "dialogue": [{"speaker": "0_Apprentice", "text": "I really like basketball, how did it get invented?"}, {"speaker": "1_Wizard", "text": "Good question, it was invented in 1891 by Dr James Naismith"}, {"speaker": "0_Apprentice", "text": "oh wow that long ago.  Is it popular here in America?"}, {"speaker": "1_Wizard", "text": "For which, basketball in general or one-on-one or two-on-two or what?"}, {"speaker": "0_Apprentice", "text": "basketball in general.  Where is it popular?"}, {"speaker": "1_Wizard", "text": "I am not really sure on some of these things, after it was invented in 1891 by Dr James Naismith, I assume everywhere. Mainly the US"}, {"speaker": "0_Apprentice", "text": "How is it played?"}, {"speaker": "1_Wizard", "text": "To start, the objective is to shoot a ball though a hoop in diameter and high that is mounted to a backboard at each end of the court. Thinking about it I'm saying for sure US"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 14413, "dialogue": [{"speaker": "0_Apprentice", "text": "Cat are the best animal ever, Don't you agree? "}, {"speaker": "1_Wizard", "text": "I am more of a dog person, but I appreciate cats for their companionship and ability to hunt vermin.  "}, {"speaker": "0_Apprentice", "text": "Yes, I have herd dogs are smarter. But they also want more attention. My cat and I visit at meals like people then do our own thing. Do you have a dog?"}, {"speaker": "1_Wizard", "text": "No.  Actually, I am allergic to both cats and dogs so I don't have pets.  To interesting your relationship with your cat.  They are solitary animals but also like communicating through mewing, purring, grunting, etc."}, {"speaker": "0_Apprentice", "text": "That's sad. You can always get a digital pet like we had in the 90s"}, {"speaker": "1_Wizard", "text": "That's so funny.  Maybe I should get a digital pet or virtual pet as a companion."}, {"speaker": "0_Apprentice", "text": "A tomodachi. How about fish? "}, {"speaker": "1_Wizard", "text": "Tomodachi Life is great.  Maybe Is should look into that Nintendo game or...a fish would work for me as well.  Great Suggestions!"}, {"speaker": "0_Apprentice", "text": "I had fish love them. "}, {"speaker": "1_Wizard", "text": "Should I get an aquarium or maybe a fish pond or garden pond?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 4349, "dialogue": [{"speaker": "0_Wizard", "text": "I used to do weight training and I used to be fit. Do you like strength training?"}, {"speaker": "1_Apprentice", "text": "I'm planning on starting in the next few months, but right now I'm working on cardio."}, {"speaker": "0_Wizard", "text": "I actually like doing HIT training now. It's a high intensity training . The exercises are short, infrequent and intense. Makes your heart rate go up and  you burn more calories"}, {"speaker": "1_Apprentice", "text": "Can you tell me more about that kind of training?  Does it require any special equipment?"}, {"speaker": "0_Wizard", "text": "I do it at the gym so they have all the equipment but I'm pretty sure you can do it at home too with no equipment. "}, {"speaker": "1_Apprentice", "text": "Is it good for cardio and weight lifting?"}, {"speaker": "0_Wizard", "text": "It's kind of both! For example you do 40 seconds of running in one place and then 10 seconds rest. Then you pick up dumbbells and do bicep curls for 40 seconds and then 10 seconds rest and so on.  "}, {"speaker": "1_Apprentice", "text": "OH I understand now - kind of like circuit training?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 18366, "dialogue": [{"speaker": "0_Apprentice", "text": "My dad is a roofer and wants me to work for him but I dont know much about it"}, {"speaker": "1_Wizard", "text": "Does he concentrate on the application of materials that waterproof."}, {"speaker": "0_Apprentice", "text": "Yeah I think he does. He has been doing it forever"}, {"speaker": "1_Wizard", "text": "He must have good motor skills."}, {"speaker": "0_Apprentice", "text": "Yeah he sometimes climbs houses without support lines"}, {"speaker": "1_Wizard", "text": "In Australia they are called roof carpenters."}, {"speaker": "0_Apprentice", "text": "I think I have heard them called that before"}, {"speaker": "1_Wizard", "text": "They are often also called roofing contractors."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 6069, "dialogue": [{"speaker": "0_Apprentice", "text": "I vividly remember my first swimming lessons- did you ever take them yourself?"}, {"speaker": "1_Wizard", "text": "Yes~ I love to swim.  Infants can hold their breath underwater and do basic swimming at only a few weeks old?"}, {"speaker": "0_Apprentice", "text": "That is incredible- treading water was the first thing we learned. I was probably three!"}, {"speaker": "1_Wizard", "text": "That's amazing. So many countries have minimum swimming levels kids have to know - they even teach in school!  US needs that, too."}, {"speaker": "0_Apprentice", "text": "Agreed! I always teach my students to float on their backs and tread water first. You cannot fight a current and these skills save lives!"}, {"speaker": "1_Wizard", "text": "Great life lessons to save lives.  When swimming you can rely on your body's natural buoyancy, and save your life!"}, {"speaker": "0_Apprentice", "text": "And swimming is so, so great for physical therapy patients of all ages and just as exercise in general! Low impact is where it's at!"}, {"speaker": "1_Wizard", "text": "Yes something that can be done at any age without impact like land activities (running). Much better for your body!"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 6058, "dialogue": [{"speaker": "0_Wizard", "text": "I love 80's progressive rock bands. "}, {"speaker": "1_Apprentice", "text": "Can you give me some examples of one?"}, {"speaker": "0_Wizard", "text": "Like Toto or YES."}, {"speaker": "1_Apprentice", "text": "I'm not familiar with those at all."}, {"speaker": "0_Wizard", "text": "Toto is an American band. I'm sure you have heard their song Africa. "}, {"speaker": "1_Apprentice", "text": "I probably have. I can recognize songs but not sure who sings them."}, {"speaker": "0_Wizard", "text": "It has been a popular meme for a few years now. "}, {"speaker": "1_Apprentice", "text": "Oh Ok, that's interesting. I'm sure I have seen it."}, {"speaker": "0_Wizard", "text": "Weezer just did a big cover of it. "}, {"speaker": "1_Apprentice", "text": "Now, I definitely know who Weezer is."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 13195, "dialogue": [{"speaker": "0_Apprentice", "text": "My favorite actor is Robert De NIro, do you like him? Have any favorite movies?"}, {"speaker": "1_Wizard", "text": "I love taxi driver! Robert was born August 17 1943,"}, {"speaker": "0_Apprentice", "text": "Cool! I don't think I've seen that one, what's it about?"}, {"speaker": "1_Wizard", "text": "A taxi driver who gets tired of seeing crime, His longtime collaboration with director Martin Scorsese earned him the Academy Awards."}, {"speaker": "0_Apprentice", "text": "Neat! Sounds like an interesting plot. I like \"The Godfather\", he was excellent in that movie."}, {"speaker": "1_Wizard", "text": "He was great in that, He received the AFI Life Achievement Award in 2003 for all his work."}, {"speaker": "0_Apprentice", "text": "Wow! I bet he has received a lot of rewards throughout his career."}, {"speaker": "1_Wizard", "text": "Well De Niro received additional nominations for Michael Cimino's Vietnam war drama \"The Deer Hunter\"  It was a great movie as well."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 16532, "dialogue": [{"speaker": "0_Apprentice", "text": "I have always wanted to try Scuba Diving."}, {"speaker": "1_Wizard", "text": "So have I! I know that it involves having a underwater breathing apparatus, which sounds a bit annoying to be carrying around under there."}, {"speaker": "0_Apprentice", "text": "I've heard that it's compressed air I wonder what's that like. "}, {"speaker": "1_Wizard", "text": "Yes, it is compressed air! It allows greater independence and freedom of movement when they have the tank with them as opposed to surface-supplied divers."}, {"speaker": "0_Apprentice", "text": "Oh wow, they can also be open circuit right?"}, {"speaker": "1_Wizard", "text": "Yes they can! These discharge the gas into the environment as you breathe out."}, {"speaker": "0_Apprentice", "text": "tell me more."}, {"speaker": "1_Wizard", "text": "Well closed-circuit, on the other hand, allow recycling of gases that you breathe out into the environment. "}, {"speaker": "0_Apprentice", "text": "Which one is better?"}, {"speaker": "1_Wizard", "text": "Neither are really better, since they are better at different things. Another thing is rebreathers, as they extend the amount of time that you can spend underwater."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 17598, "dialogue": [{"speaker": "0_Wizard", "text": "Pizza is very popular."}, {"speaker": "1_Apprentice", "text": "Yes I like pizza myself.  What is your favorite kind of pizza?"}, {"speaker": "0_Wizard", "text": "I love brick oven baked pizzas."}, {"speaker": "1_Apprentice", "text": "I like stuffed crust or New York style.  What kind of toppings do you like on your pizza?"}, {"speaker": "0_Wizard", "text": "I like the meats, with extra cheese."}, {"speaker": "1_Apprentice", "text": "I like pepperoni, sausage and bacon as well.  Not a big fan of veggies or pineapple on a pizza."}, {"speaker": "0_Wizard", "text": "Some of the cheeses can be high in proteins depending on the source; cow, goat, sheep."}, {"speaker": "1_Apprentice", "text": "Yes I don't mind mozzarella at all, I have sprinkled cheddar on it as well."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 10728, "dialogue": [{"speaker": "0_Apprentice", "text": "I love the novel A Song of Ice and Fire."}, {"speaker": "1_Wizard", "text": "I haven't yet read the epic fantasy novel by George R. R. Martin."}, {"speaker": "0_Apprentice", "text": "I highly recommend the series if you enjoy the fantasy genre."}, {"speaker": "1_Wizard", "text": "Have you read the 5th and most recent volume in the series? It's \"A Dance with Dragons.\""}, {"speaker": "0_Apprentice", "text": "I have not, I've only recently started reading the series due to the TV show. "}, {"speaker": "1_Wizard", "text": "The author's inspiration for the series came from Wars of the Roses."}, {"speaker": "0_Apprentice", "text": "So I've read. He was also inspired by French history novels such as The Accursed Kings by Maurice Druon."}, {"speaker": "1_Wizard", "text": "Yes and that was a sequence of 7 historical novels by French author Maurice Druon."}, {"speaker": "0_Apprentice", "text": "After I finish reading the series, I'll try reading those as well to see how much influence it had over Martin's own work."}, {"speaker": "1_Wizard", "text": "I might have to try both series as well!"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 6902, "dialogue": [{"speaker": "0_Apprentice", "text": "I am a big fan of Frank Ocean. Do you know him?"}, {"speaker": "1_Wizard", "text": "I do not believe I've heard of him before, but his real name is Christoper Edwin Breaux."}, {"speaker": "0_Apprentice", "text": "Do you know what his first single was?"}, {"speaker": "1_Wizard", "text": "I think he released his mixtape \"Nostalgia, Ultra\" in 2011."}, {"speaker": "0_Apprentice", "text": "Yep! I haven"}, {"speaker": "1_Wizard", "text": "And then from that he had his first charting single \"Novacane\""}, {"speaker": "0_Apprentice", "text": "Novacane is a great song! One of my favorites by him."}, {"speaker": "1_Wizard", "text": "Did you like his studio album \"Channel Orange\" that was released in July 2012?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 2380, "dialogue": [{"speaker": "0_Apprentice", "text": "I enjoy going fishing on my free time."}, {"speaker": "1_Wizard", "text": "me too, i really like it, i do it for pleasure or competition, i like going fishing with my friends also"}, {"speaker": "0_Apprentice", "text": "What equipment do you need when preparing for a recreational fishing trip?"}, {"speaker": "1_Wizard", "text": "you can do it with a rod, reel, line, hooks and any one of a wide range of baits, thats why its so interesting for me"}, {"speaker": "0_Apprentice", "text": "Are worms used as bait for recreational fishing?"}, {"speaker": "1_Wizard", "text": "Yes, of course, terminal tackle is also used to affect or complement the presentation of the bait to the targeted fish"}, {"speaker": "0_Apprentice", "text": "What are some recreational fishing techniques?"}, {"speaker": "1_Wizard", "text": "There is a thing called big-game fishing is conducted from boats, they catch larger fish, but i dont like that kind of fishing"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 9795, "dialogue": [{"speaker": "0_Wizard", "text": "I get sad a lot. My mood is always low and it's affecting my daily life."}, {"speaker": "1_Apprentice", "text": "Why's that? Have you tried seeking help at all?"}, {"speaker": "0_Wizard", "text": "My grandma died, and I am very depressed. I haven't sought any help because I think it's temporary and I might get over it."}, {"speaker": "1_Apprentice", "text": "That is upsetting, I'm sorry to hear that. Yes, it will take some time to get over it, sometimes talking about it helps."}, {"speaker": "0_Wizard", "text": "I feel guilty and angry because I wasn't there for her when she needed me."}, {"speaker": "1_Apprentice", "text": "Well don't beat yourself up over it, there isn't anything you change about that now. I'm sure your grandma loved you deeply."}, {"speaker": "0_Wizard", "text": "I've been contemplating suicide recently, and I have trouble concentrating. I hope I can overcome this feeling."}, {"speaker": "1_Apprentice", "text": "Definitely do not do that! You should seek help, there are trained professionals who can help you deal with this."}]}, "annotations": [{"error_type": "E10", "user_correction": "C1", "user_reaction": "UR3", "turn": "3", "phrase": "definitely do not do that"}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 16624, "dialogue": [{"speaker": "0_Wizard", "text": "When the moon passes between the Sun and Earth and the moon fully or partially blocks the Sun, it is called a solar eclipse."}, {"speaker": "1_Apprentice", "text": "That's amazing. I saw two solar eclipse before."}, {"speaker": "0_Wizard", "text": "Did you see \"The Great American Eclipse\" which happened this past August 21st?"}, {"speaker": "1_Apprentice", "text": "Yes I did. I watched it with a special reflective mirror. Did you?"}, {"speaker": "0_Wizard", "text": "I only saw it on the news. Before this event, no solar eclipse had been visible across the entire contiguous United States since 1918."}, {"speaker": "1_Apprentice", "text": "It was a once in a life time chance to see.  Do you know the next time this event will take place?"}, {"speaker": "0_Wizard", "text": "I believe the next solar eclipse will not occur until April 8th of 2024."}, {"speaker": "1_Apprentice", "text": "That is not too far away.  Will you try to see it?"}, {"speaker": "0_Wizard", "text": "I will try as it will be visible across North America."}, {"speaker": "1_Apprentice", "text": "Great! Natural event are something that must be seen in person."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 7601, "dialogue": [{"speaker": "0_Wizard", "text": "I really love mushroom ravioli. It's like a dumpling with filling in the middle."}, {"speaker": "1_Apprentice", "text": "I love mushrooms and I like ravioli. So I assume I would like it also."}, {"speaker": "0_Wizard", "text": "It is amazing. You can eat it with a broth or with sauce over it."}, {"speaker": "1_Apprentice", "text": "I would probably do sauce."}, {"speaker": "0_Wizard", "text": "I do love sauce. The ravioli's are usually square shaped but they can be made circular too."}, {"speaker": "1_Apprentice", "text": "I like raviloi's that are squares."}, {"speaker": "0_Wizard", "text": "I really love ravioli with ricotta cheese in the middle, which is made from sheep milk"}, {"speaker": "1_Apprentice", "text": "Ricotta cheese is my favorite cheese."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 8413, "dialogue": [{"speaker": "0_Apprentice", "text": "I am interested in learning about the Hindu religion. Can you tell me anything about it?"}, {"speaker": "1_Wizard", "text": "Well Hinduism is a way of life, or an Indian Dharma, practiced mainly in South Asia."}, {"speaker": "0_Apprentice", "text": "I see. What is the central beliefs for Hindus? I heard cows are considered sacred."}, {"speaker": "1_Wizard", "text": "Yes, the slaughter of cows is prohibited in most states of India"}, {"speaker": "0_Apprentice", "text": "Ok, that is a law I can respect. I do enjoy Indian food a lot. It is great for vegetarians!"}, {"speaker": "1_Wizard", "text": "I really like Curry, all different types of them since there is such a variety"}, {"speaker": "0_Apprentice", "text": "Yeah chicken curry and rice is great. I also like panak paneer. Great stuff!"}, {"speaker": "1_Wizard", "text": "I love chicken curry with mango chutney and chili peppers"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 2023, "dialogue": [{"speaker": "0_Apprentice", "text": "i have a 1 year old son. parenting isnt easy!"}, {"speaker": "1_Wizard", "text": "I do not have kids and have only helped with cousins an siblings, but I still agree with you that parenting is very hard."}, {"speaker": "0_Apprentice", "text": "i feel like i don't even know what to do sometimes"}, {"speaker": "1_Wizard", "text": "There are no static rules to follow, and the child you raise is made different than everyone else. Society also plays a role in this as well I think."}, {"speaker": "0_Apprentice", "text": "i agree with you. I know some people don't believe in spanking but i definitely do"}, {"speaker": "1_Wizard", "text": "I was spanked when I was younger and I didn't mind it because I was a mischievous kid sometimes. It wasn't life threatening or anything. "}, {"speaker": "0_Apprentice", "text": "as long as people spank their kids to discipline them and not to hurt them or bruise them i'm fine with that"}, {"speaker": "1_Wizard", "text": "I agree, some countries outlawed spanking except for by parents. The goal of hurting a child is completely separate from spanking them for discipline in my opinion."}, {"speaker": "0_Apprentice", "text": "i agree. I was born in Soviet Russia, kids were allowed to be spanked at a daycare and school"}, {"speaker": "1_Wizard", "text": "OK I don't know much about Russian culture but discipline seems valued and important over there, so I'm not surprised. I think part of the goal is to teach right and wrong."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 4407, "dialogue": [{"speaker": "0_Apprentice", "text": "Bacon is one of my favorite foods! I love it on hamburgers especially. Do you like bacon?"}, {"speaker": "1_Wizard", "text": "I love bacon especially for breakfast with some pancakes and eggs."}, {"speaker": "0_Apprentice", "text": "I like it with eggs too! I also like it wrapped around shrimp. "}, {"speaker": "1_Wizard", "text": "I feel like we should have a full cook book of just bacon recipes."}, {"speaker": "0_Apprentice", "text": "Yes! I would buy it. Unfortunately I'm not good at cooking bacon. I can never get it to cook evenly."}, {"speaker": "1_Wizard", "text": "Either way bacon makes everything taste good. Even veggies or fruits in some cases."}, {"speaker": "0_Apprentice", "text": "I've never had it with fruit! What fruit does it go well with? "}, {"speaker": "1_Wizard", "text": "That and fruits and veggies are more healthier than straight bacon so it does help health-wise."}, {"speaker": "0_Apprentice", "text": "True. I believe it's okay as long as it's in moderation."}, {"speaker": "1_Wizard", "text": "Fruits and veggies do help with overall health though."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 5602, "dialogue": [{"speaker": "0_Wizard", "text": "I had a domestic cat"}, {"speaker": "1_Apprentice", "text": "What kind of cat did you have?"}, {"speaker": "0_Wizard", "text": "I had a white cat. Cat are typically furry mammals"}, {"speaker": "1_Apprentice", "text": "What other kinds of mammals do we keep as pets?"}, {"speaker": "0_Wizard", "text": "Cats are valued companions of humans"}, {"speaker": "1_Apprentice", "text": "Are there other breeds of domestic cats?"}, {"speaker": "0_Wizard", "text": "Yes, but I don't know them. Cats can hear sounds too faint or too high frequency for humans"}, {"speaker": "1_Apprentice", "text": "What do cats eat?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR1", "turn": "2", "phrase": ""}]}, {"turns": {"dialogue_id": 8437, "dialogue": [{"speaker": "0_Apprentice", "text": "I want to be the worlds best swimmer!"}, {"speaker": "1_Wizard", "text": "You must be good at holding your breath under water then!"}, {"speaker": "0_Apprentice", "text": "I feel like I am! Why... Is that a prerequisite?"}, {"speaker": "1_Wizard", "text": "Well you need to be able to hold your breathe while stroking! But good for you, I mean swimming is one of the lower impact sports out there! "}, {"speaker": "0_Apprentice", "text": "So I've heard!"}, {"speaker": "1_Wizard", "text": "Well, as a formalized sport, swimming features in a range of local, national, and international competitions, including every modern summer Olympics. Have you competed in any of these levels?"}, {"speaker": "0_Apprentice", "text": "I have not- but I hope to make tryouts this week for my local team!"}, {"speaker": "1_Wizard", "text": "Well do you live in one if the countries where swimming is a compulsory part of the educational curriculum?"}, {"speaker": "0_Apprentice", "text": "NO BUT I WISH!!!"}, {"speaker": "1_Wizard", "text": "Just make sure you got your locomotion (coordinated movement of the limbs) down pact!"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 14391, "dialogue": [{"speaker": "0_Wizard", "text": "I know a ton of really popular luxury fashion companies, but Louis Vuitton, which was founded in 1854, is the one that I know the most about."}, {"speaker": "1_Apprentice", "text": "oh that's fantastic, I like Louis Vuitton, It's just that their bags are exclusively  for the rich because of their high price tag"}, {"speaker": "0_Wizard", "text": "Oh definitely, I always know that when I see their signature LV monogram on something it is either ridiculously expensive or fake."}, {"speaker": "1_Apprentice", "text": "I learnt their  products from countries like Hong Kong go through strict quality control and anti piracy laws so you hardly get a fake there"}, {"speaker": "0_Wizard", "text": "That's probably really nice then. It makes sense, since they sell most of their products through standalone boutiques so it must be easy to know where to get a real one."}, {"speaker": "1_Apprentice", "text": "yes very true. "}, {"speaker": "0_Wizard", "text": "The company is really successful this way too, since in 2012 it was valued at $25.9 billion."}, {"speaker": "1_Apprentice", "text": "How many countries do they have their exclusive boutiques in ?"}, {"speaker": "0_Wizard", "text": "They're in a ton of different countries, it's a total of 50 worldwide!"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 11482, "dialogue": [{"speaker": "0_Apprentice", "text": "I have never been skating, but it looks like great fun. Do you skate?"}, {"speaker": "1_Wizard", "text": "I used to Inline skates when I was young. They were a different type of roller skate."}, {"speaker": "0_Apprentice", "text": "I've never heard of that. What does it involve?"}, {"speaker": "1_Wizard", "text": "Well the inline skate has 2-5 wheels in a single line, wheres the quad skate have two front and two rear wheels."}, {"speaker": "0_Apprentice", "text": "Oh yes, I've seen them but didn't know what they were called. It must be much more difficult than regular roller skating."}, {"speaker": "1_Wizard", "text": "Its easier than it looks really. Some inline skates will have a rubber brake on the back for recreational users."}, {"speaker": "0_Apprentice", "text": "I'd certainly make use of that brake, lol! Are their competitions relating to inline skating?"}, {"speaker": "1_Wizard", "text": "There are all types including tricks and races. The modern inline skate was made as a substitute to ice skates. The Russian athletes used then to train when ice was not an option."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 7059, "dialogue": [{"speaker": "0_Wizard", "text": "I love YOUTUBE!  YouTube is an American video-sharing website"}, {"speaker": "1_Apprentice", "text": "What do you mostly watch on youtube?"}, {"speaker": "0_Wizard", "text": "I like Buzzfeed mainly, The service was created by three former PayPal employees"}, {"speaker": "1_Apprentice", "text": "Is Buzzfeed on you tube? the Paypal employees created Buzzfeed or you tube?"}, {"speaker": "0_Wizard", "text": "Chad Hurley, Steve Chen, and Jawed Karim created youtube, they are all former youtube employees "}, {"speaker": "1_Apprentice", "text": "You mean former Paypal employees, I guess. And when was you tube founded?"}, {"speaker": "0_Wizard", "text": "That was in 2005, in 2006  Google bought the site in November 2006 for US$1.65 billion"}, {"speaker": "1_Apprentice", "text": "Did Goggle bought the site from the three founders?  If so, do you know if they founded something else with the money they got?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR5", "turn": "", "phrase": ""}, {"error_type": "E7", "user_correction": "C1", "user_reaction": "UR2", "turn": "2", "phrase": ""}]}, {"turns": {"dialogue_id": 28, "dialogue": [{"speaker": "0_Wizard", "text": "Hi! I love giant pandas, they are my favourite animal. they're also called \"big bear cat\" sometimes? how about you?"}, {"speaker": "1_Apprentice", "text": "i love pandas, mostly their colours"}, {"speaker": "0_Wizard", "text": "they're easily recognized by the distinct patches around their eyes.. a few live near me, in the toronto zoo"}, {"speaker": "1_Apprentice", "text": "wow i will love to see them, so can you tell me more"}, {"speaker": "0_Wizard", "text": "there are only 49 giant pandas living in captivity outside of China so it's very special. They love to roll around and eat bamboo, so cute!"}, {"speaker": "1_Apprentice", "text": "besides china, where can we see panda?"}, {"speaker": "0_Wizard", "text": "i saw some at the san diego zoo once. and toronto. besides that, they're in 15 other countries"}, {"speaker": "1_Apprentice", "text": "really, can you tell me one"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 1997, "dialogue": [{"speaker": "0_Wizard", "text": "Girls are so strange. I meet a girl a month ago, we hit it off, we start dating, and then two days later she randomly breaks up with me for no given reason."}, {"speaker": "1_Apprentice", "text": "Well you know what they say, there's always more fish in the sea. Perhaps you did something to upset her without realizing it."}, {"speaker": "0_Wizard", "text": "Funny you should say that, because she said we could start over a little slower about a week later but then she did the exact same thing."}, {"speaker": "1_Apprentice", "text": "Ooph, rough. Have you been in many relationships before?"}, {"speaker": "0_Wizard", "text": "Not at all, that was my first \"real\" relationship. What about you?"}, {"speaker": "1_Apprentice", "text": "I've been in a few, but they haven't lasted past a few months. I wonder if there's a psychology unique to women, do you know anything about that?"}, {"speaker": "0_Wizard", "text": "Not specifically that, but I do know that duration of courtship varies greatly depending on location, so it can be culture-related too."}, {"speaker": "1_Apprentice", "text": "Hm, that's true. Some places even have arraigned marriages where the people don't really have a choice, pretty crazy."}, {"speaker": "0_Wizard", "text": "Oh yeah, arranged marriages with the family's approval are not as common but not unheard of, especially in places like India."}, {"speaker": "1_Apprentice", "text": "There's still a long way to go with equal rights I guess, it's unfortunate, but hopefully progress is being made."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 14637, "dialogue": [{"speaker": "0_Apprentice", "text": "Do you know much about what EuroBasket?"}, {"speaker": "1_Wizard", "text": "Do you mean the European Basketball Championship?"}, {"speaker": "0_Apprentice", "text": "Yes I think that's what it stands for. What is it?"}, {"speaker": "1_Wizard", "text": "It is a basketball competition contested biannually."}, {"speaker": "0_Apprentice", "text": "Oh that sounds really cool. I love basketball. It's fascinating to watch."}, {"speaker": "1_Wizard", "text": "I prefer basketball in Israel due to the multi-tiered clubs."}, {"speaker": "0_Apprentice", "text": "I didn't know it was done differently there. I'd like to research that. It sounds interesting."}, {"speaker": "1_Wizard", "text": "Yea but I wish I could of been at thie first Euro Championship in 1935."}, {"speaker": "0_Apprentice", "text": "I would have loved that too but I wasn't even born yet. I don't even think my grandpa was at that time."}, {"speaker": "1_Wizard", "text": "Yea, Switzerland was the first host country so probably too far to of gone to anyway."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E4", "user_correction": "C1", "user_reaction": "UR1", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 8464, "dialogue": [{"speaker": "0_Apprentice", "text": "I work in a corner grocery store during the day."}, {"speaker": "1_Wizard", "text": "Does your store primarily sell food?"}, {"speaker": "0_Apprentice", "text": "Yes we sell food and household products. I recently started working there but I don't know much about grocery stores yet. Do you?"}, {"speaker": "1_Wizard", "text": "I do not. I have never worked in a grocery store before. How large is the store?"}, {"speaker": "0_Apprentice", "text": "It's an average size with a produce section, butcher and deli. Do you know when grocery stores became popular?"}, {"speaker": "1_Wizard", "text": "Wasn't it Vincent Astor who founded Astor Market in 1915? Before that I believe it was always a clerk who prepped your order from a counter."}, {"speaker": "0_Apprentice", "text": "It seems like we're going back to that old way in a sense, with online grocery ordering and preparing you can just pick up your groceries prepared by a personal shopper. Do you know much about technology in grocery stores?"}, {"speaker": "1_Wizard", "text": "As far as online ordering technology? Just that there is a delivery charge and it's convenient."}, {"speaker": "0_Apprentice", "text": "Do you know what the biggest grocery store chain is?"}, {"speaker": "1_Wizard", "text": "I don't, but I see Walmarts everywhere. I think they have something like 11,000 or more stores and are in multi countries. "}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 12911, "dialogue": [{"speaker": "0_Apprentice", "text": "Hello!  What made you decide to become a lifeguard?"}, {"speaker": "1_Wizard", "text": "Lifeguards are rescuers who ensure the safety and rescue of swimmers"}, {"speaker": "0_Apprentice", "text": "Sounds cool!  What type of education do you need to become a lifeguard?"}, {"speaker": "1_Wizard", "text": "National Lifeguard education is designed to develop an understanding of \"lifeguarding\" principles, good judgment and a mature and responsible attitude"}, {"speaker": "0_Apprentice", "text": "Okay.  How long does the process take?"}, {"speaker": "1_Wizard", "text": "It depends. Lifeguards are strong swimmers and trained in CPR/AED first aid, certified in water rescue using a variety of aids and equipment"}, {"speaker": "0_Apprentice", "text": "So it sounds like someone who wants the job has to be highly motivated."}, {"speaker": "1_Wizard", "text": "Lifeguards can be part of the emergency services system to incidents and in some communities, the lifeguard service also carries out mountain rescues, or may function as EMS."}, {"speaker": "0_Apprentice", "text": "Wow, I would never think of a lifeguard on a mountain!  Are there many EMS's that also do lifeguard work, as well?"}, {"speaker": "1_Wizard", "text": "Lifeguards can take on this responsibility upon employment, although they can also be volunteers."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR5", "turn": "", "phrase": ""}, {"error_type": "E1", "user_correction": "C1", "user_reaction": "UR1", "turn": "0", "phrase": ""}]}, {"turns": {"dialogue_id": 12952, "dialogue": [{"speaker": "0_Wizard", "text": "I love beetroot, that is  the taproot portion of the beet plant"}, {"speaker": "1_Apprentice", "text": "I am not familiar with it.  What do you do with beetroot."}, {"speaker": "0_Wizard", "text": "Most times it is grown for their edible taproots and their leaves "}, {"speaker": "1_Apprentice", "text": "do you cook it prior to eating it?"}, {"speaker": "0_Wizard", "text": "That depends on the use because Many beet products are made from other \"Beta vulgaris\" varieties"}, {"speaker": "1_Apprentice", "text": "Are they bitter?"}, {"speaker": "0_Wizard", "text": "I do not think so because beets have use as a food colouring"}, {"speaker": "1_Apprentice", "text": "Thank you for your information.  I learned something new."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 6880, "dialogue": [{"speaker": "0_Apprentice", "text": "I love comic books. They are easy to read and the stories are pretty good."}, {"speaker": "1_Wizard", "text": "This is also known as magazine. What I like about them is the art forms that are used to tell different scenes and characters  "}, {"speaker": "0_Apprentice", "text": "Indeed there are so many comic book styles, more than in writing novels."}, {"speaker": "1_Wizard", "text": "Yes, you see that they are arranged in panels with a description that looks like the heading and different narratives"}, {"speaker": "0_Apprentice", "text": "Pretty much. If you don't scroll too fast you can really be surprised by the script."}, {"speaker": "1_Wizard", "text": "Their origin is very interesting as they can be traced to 18th century Japan and 1830s Europe but  it was when they got to the USA that they became popular in the 1930s"}, {"speaker": "0_Apprentice", "text": "I am sure they were very different before the rules got standardized."}, {"speaker": "1_Wizard", "text": "The first comic in the United States was Famous Funnies and it was released in 1933"}, {"speaker": "0_Apprentice", "text": "I've never seen it but it would interesting. I wonder how much things have changed since."}, {"speaker": "1_Wizard", "text": "How a comic appears is dependent on how the company making it is and the appearance "}, {"speaker": "0_Apprentice", "text": "yes"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E8", "user_correction": "C1", "user_reaction": "UR5", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 11189, "dialogue": [{"speaker": "0_Apprentice", "text": "I just love dogs. I have a husky of my own."}, {"speaker": "1_Wizard", "text": "Do you like dogs? Their origin is pretty interesting, their closest relative is a gray wolf."}, {"speaker": "0_Apprentice", "text": "Yes, mine is part wolf, in fact. He's also a super hyper dog. Getting into everything."}, {"speaker": "1_Wizard", "text": "Wow, that is really cool! What do huskies like to do? Any wolf like instincts that you have noticed?"}, {"speaker": "0_Apprentice", "text": "Definitely the hunter instinct. Also learns very smart. They're big fans of running in general, working type dogs. Likes to herd the grandkids also."}, {"speaker": "1_Wizard", "text": "That's really cute! Your dog is pretty active and energetic, right? Do they shed a lot?"}, {"speaker": "0_Apprentice", "text": "Oh. I get enough fur off of him every other day to make a wool coat."}, {"speaker": "1_Wizard", "text": "Haha! I'm used to dogs with more of a short coat, but shed all the time. I would be curious to see what the fur looks like."}, {"speaker": "0_Apprentice", "text": "It's verse thick type fur. Almost like a polyester fiber."}, {"speaker": "1_Wizard", "text": "Do you have to get your dog groomed all the time or do you groom your own dog?"}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "E10", "user_correction": "C1", "user_reaction": "UR1", "turn": "0", "phrase": ""}]}, {"turns": {"dialogue_id": 5659, "dialogue": [{"speaker": "0_Apprentice", "text": "Nothing is more relaxing to me then art. Drawing particularly. Do you like drawing? I'm a big fan of charcoal. "}, {"speaker": "1_Wizard", "text": "I love to draw with pencils but I am not very good at it"}, {"speaker": "0_Apprentice", "text": "Art is in the eye of the beholder. If you think it looks good, It looks good. "}, {"speaker": "1_Wizard", "text": "Yes drawing has been popular throughout history - even in caves"}, {"speaker": "0_Apprentice", "text": "I wonder was it a way to communicate in caves not just for pleasure? "}, {"speaker": "1_Wizard", "text": "I am not sure but it is one of the simplest means of communicating"}, {"speaker": "0_Apprentice", "text": "Interesting. I never looked of it as a way communication. "}, {"speaker": "1_Wizard", "text": "Yes hieroglyphics are a very basic form of drawing which communicated ideas "}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 8208, "dialogue": [{"speaker": "0_Apprentice", "text": "I volunteer feeding the homeless in my spare time."}, {"speaker": "1_Wizard", "text": "That is amazing! A lot of soup kitchens are in lower-income neighborhoods and rely on volunteers like you."}, {"speaker": "0_Apprentice", "text": "How do soup kitchens obtain their food?"}, {"speaker": "1_Wizard", "text": "They usually get it from a food bank at a discounted price."}, {"speaker": "0_Apprentice", "text": "Do most soup kitchens only serve soup, or other food items as well?"}, {"speaker": "1_Wizard", "text": "Many soup kitchens only serve soup and bread, but some serve other foods."}, {"speaker": "0_Apprentice", "text": "What are the origins of the soup kitchen?"}, {"speaker": "1_Wizard", "text": "Unofficially, there have been some forms of soup kitchens around for thousands of years, but the modern conception came about in the late 18th century."}, {"speaker": "0_Apprentice", "text": "Do you know where the largest soup kitchen is located?"}, {"speaker": "1_Wizard", "text": "No, but by the late 19th century, they were in many American and European cities."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 5550, "dialogue": [{"speaker": "0_Apprentice", "text": "I love Jim Carrey hes such a talented actor, Do you know who he is? "}, {"speaker": "1_Wizard", "text": "I do!  I first saw him on the show \"In Living Color\" in 1990."}, {"speaker": "0_Apprentice", "text": "That was a great movie, I always wanted to visit him in person and get an autograph, Does Jim Carrey do autographs? "}, {"speaker": "1_Wizard", "text": "I'm not certain if he does autographs or not.  The last movie that I remember him in was \"A Christmas Carol\" in 2009."}, {"speaker": "0_Apprentice", "text": "I think he has some of the best comedy films in my opinion, What are some of his best movies? "}, {"speaker": "1_Wizard", "text": "I think some of the obvious ones are his best . . . . \"Dumb and Dumber\", \"Liar Liar\", and \"The Mask.\""}, {"speaker": "0_Apprentice", "text": "I agree those are my faves, I have all of them on DVD, Isnt he getting old now? How old is Jim Carey? "}, {"speaker": "1_Wizard", "text": "He was born on January 17, 1962, so he's 56 now."}, {"speaker": "0_Apprentice", "text": "Oh thats not too old, He looks pretty great for his age."}, {"speaker": "1_Wizard", "text": "Yes, he probably stays in great shape due to his high energy slapstick performance style."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": {"dialogue_id": 10494, "dialogue": [{"speaker": "0_Wizard", "text": "Do you like to eat fish or any type of seafood?"}, {"speaker": "1_Apprentice", "text": "I love sea food so good, love fish and oysters and stuff"}, {"speaker": "0_Wizard", "text": "I recently learned that seaweeds and microalgae is also classified as seafood! I thought it was only fish!"}, {"speaker": "1_Apprentice", "text": "Oh yea makes sense since they use seaweed in sushi"}, {"speaker": "0_Wizard", "text": "Good point! I eat a few types of fish and shellfish, but not too often."}, {"speaker": "1_Apprentice", "text": "Same but i love some fresh sea food anytime"}, {"speaker": "0_Wizard", "text": "I live near the beach and our seafood in the local restaurants is so fresh! I really should eat it more, it's high in protein!"}, {"speaker": "1_Apprentice", "text": "Yea and it tastes amazing"}, {"speaker": "0_Wizard", "text": "Thankfully sea mammals are no longer on the menu. I can't imagine eating a whale or a dolphin, but people used to!"}, {"speaker": "1_Apprentice", "text": "Yea haha seems cruel."}]}, "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}]