{"unique_id": "16_00005_sgd_test", "id": "16_00005", "turns": [{"utterance": "I want to go to a Salon which should be an Unisex one. I am now in Walnut Creek so please search for the one located here.", "response": "Blow Dry Bar is the best Salon in Walnut Creek based on my search. Do you want to go there?"}, {"utterance": "Yes, it is okay to me.", "response": "How about the appointment, shall I book it now?"}, {"utterance": "No, not now. I will ask it later. Now, I need to meet a Family counselor. Search for someone in Walnut Creek.", "response": "Got 4 Therapist details. What about your opinion to meet Andreotti Daniel who is also a best Family Counselor in Walnut Creek."}, {"utterance": "Search for someone else.", "response": "Then, I can suggest you to meet Beitler Penny. I think this Family Counselor is the better one in Walnut Creek."}, {"utterance": "No, this is also not suitable for me. Find me some other Therapists.", "response": "Okay, what about Keith-Davies Joan who is a Family Counselor in Walnut Creek. I think you can try this contact."}, {"utterance": "Get me their phone number and address.", "response": "They are located at 43 Quail Court # 203B and you can contact them by 925-937-6247."}, {"utterance": "That's nice. I want to book an appointment to this Therapist now.", "response": "What is your convenient date and time to book an appointment."}, {"utterance": "Make it on 11th of March for the time 2:15 pm.", "response": "That's okay. I need your final confirmation to book an appointment with Keith-Davies Joan on March 11th for the time 2:15 pm."}, {"utterance": "That is confirmed to proceed now.", "response": "Unfortunately I was not able to book it with Keith-Davies Joan on March 11th for that preferred time. Shall I try to get it at 2 pm instead?"}, {"utterance": "Yes, this time is also okay for me.", "response": "I have successfully booked your appointment at the new time. They will send an email to you soon with the confirmation of appointment."}, {"utterance": "Thank you so much. Now please make an another appointment for me. This is for he Salon that I have selected before. Make it at evening 4 for the same day mentioned previously.", "response": "Please confirm once again to book an appointment at the Salon Blow Dry Bar on March 11th at 4 pm."}, {"utterance": "That is confirmed. You can book it now.", "response": "I have booked it successfully."}, {"utterance": "Let me know the rating and contact number of that Salon.", "response": "They can be contacted by the phone number 925-837-2990 and they are having 4.4 rating in average."}, {"utterance": "That's nice. Thanks.", "response": "Anything else you need from me?"}, {"utterance": "Nothing for now and that's all.", "response": "Have a good day."}], "annotations": [{"turn": 11, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["actually, i apologize no need to book, i was just gathering information.", " you can book it now."], "confidence": 0.681, "turn": 11}]}