{"unique_id": "26_00116_sgd_test", "id": "26_00116", "turns": [{"utterance": "I need some assistance finding a train please.", "response": "What is your destination and when are you looking to travel? Also where will you be leaving from?"}, {"utterance": "I'll be going from Sacramento, CA to Anaheim and I'll be doing that next Tuesday.", "response": "I have a train with a 6:30 am departure and a ticket price of $121."}, {"utterance": "Yes, that's fine. I'm also interested in finding something worthwhile to do on that day.", "response": "Is there a specific type of event you're looking for, such as a music or theater activity?"}, {"utterance": "I would like to do something theater related and let's look on the 10th please.", "response": "Stage Door Repertory Theatre is presenting Jesus Christ Superstar on March 10th at 7:30 pm."}, {"utterance": "What is the ticket price please and where is the theater?", "response": "The tickets cost $45 do the location of the performance is 1045 North Armando Street."}, {"utterance": "That's a good possibility, but what else is there? Maybe a concert.", "response": "I can recommend Brown Sabbath playing at Crossroads at House of Blues Anaheim. That's at 7 pm on March 10th."}, {"utterance": "I like the sound of that one. What about some interesting attractions that are appropriate for kids? Maybe a theme park.", "response": "I have 3 options to tell you about. Disney California Adventure Park is a popular theme park."}, {"utterance": "Yes, perfect. And I'm going to require a house where I can stay, just for one person.", "response": "I have 10 houses that I can recommend. One of them is 4.2 rated and that's at 1050 West Ball Road."}, {"utterance": "May I have the telephone number and I'm also wondering if they have laundry service.", "response": "Yes they do have laundry service and the phone number is +1 714-860-4660."}, {"utterance": "Thanks, I like that.", "response": "Shall I make a reservation for you there?"}, {"utterance": "No, I don't think so.", "response": "Very well. How else may I help you today?"}, {"utterance": "I'm all set, thank you.", "response": "I'm happy to be able to help you, goodbye."}], "annotations": [{"turn": 10, "annotation": [{"error_type": "", "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["no i dont think so.", " no, i don't think so."], "confidence": 0.93, "turn": 10}]}