{"unique_id": "104_00086_sgd_train", "id": "104_00086", "turns": [{"utterance": "Could you please help in finding some interesting thing today? I love Concert events.", "response": "In which do you prefer?"}, {"utterance": "I wish to search for something around SD.", "response": "I searched and found 10 events for you. On March 1st, Alejandro Sanz event at Cal Coast Credit Union Amphitheater. it will start at 6:30 pm."}, {"utterance": "It is nice. Can you help me in finding some other events?", "response": "Bastille is very nice. on March 1st, the event is at Cal Coast Credit Union Amphitheater which will start at 8:30 pm."}, {"utterance": "It is nice. Can you help me in finding some other events? I really love Blues. I wish to have something around Vancouver, BC.", "response": "I searched and found 1 event for you. on March 1st, the event Zz Top is taking place at PNE Amphitheatre. It will start at 6 pm."}, {"utterance": "What is the contact address for the venue?", "response": "The contact address is 2901 East Hastings Street."}, {"utterance": "It is nice.", "response": "Shall I book tickets for the event?"}, {"utterance": "Nope. I don't want to book it now. I am looking to find a hotel there. I wish to book two rooms.", "response": "I searched and found 10 hotels. What is your opinion about Atrium Inn Vancouver with rating 3.7."}, {"utterance": "Whether they permit pets? What is their contact address?", "response": "Pets are permitted here. The contact address is 2889 East Hastings Street."}, {"utterance": "Do you have any other option?", "response": "What is your opinion about Auberge Vancouver Hotel with rating 4.1."}, {"utterance": "Do you have any other option? I wish to reserve 1 room.", "response": "I searched and found 8 hotels. What is your opinion about Best Western Plus Chateau Granville Hotel & Suites & Conference Ctr. with rating 4.1."}, {"utterance": "That is nice.", "response": "Shall I proceed to book the hotel?"}, {"utterance": "Yes. I wish to book a reservation on today and check out on 4th of March.", "response": "Kindly ensure that, on March 1st, 1 room has been booked at Best Western Plus Chateau Granville Hotel & Suites & Conference Ctr. at Vancouver. The check out date is March 4th."}, {"utterance": "Yes. it is good for me.", "response": "You have done the reservation."}, {"utterance": "Thank you so much.", "response": "Do you need any other help?"}, {"utterance": "Nope. Thank you so much.", "response": "Have a fantastic day."}], "annotations": [{"turn": 6, "annotation": [{"error_type": "", "comment": "not a correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i don't want to book it now."], "confidence": 0.806, "turn": 6}]}