{"unique_id": "52_00038_sgd_train", "id": "52_00038", "turns": [{"utterance": "I'm looking for a small car to pick it up at gatwick international airport", "response": "From when and until what date do you need it?"}, {"utterance": "I'll drive the car from the 9th of this month until March 14th", "response": "Just give me the time now for your rental to start"}, {"utterance": "My idea is to pick it up at 5 o\"clock in the evening", "response": "Confirm me the acquired data. You are renting a compact car from March 9th at 5 pm until march 14th. The car will be available for you at gatwick international airport"}, {"utterance": "Exactly. What kind of car is this one? How much is going to cost me?", "response": "The car has been booked, it's a nissan leaf and it's $120"}, {"utterance": "Thank you for that, now go seek a hotel room there", "response": "Do you want it to be in london?"}, {"utterance": "Absolutely", "response": "There are 10 hotels that you may actually like. What about 45 park lane? It is rated 5 star"}, {"utterance": "Skip to the next option, I only need 1 room.", "response": "There are 9 more hotels, what about abc hyde park hotel? The rating is 3 star"}, {"utterance": "No, I don't like it, go on.", "response": "I've found 1 star hotel and the name is abercorn house"}, {"utterance": "This one can be good for me", "response": "Do you want me to book a room there?"}, {"utterance": "Yes, do it for me, please", "response": "For how many days do you want it? Is check in date March 9th?"}, {"utterance": "The room is required for 2 days and check in date is the 1st", "response": "Confirm me the data before the operation is done. I am going to book 1 room in London for 2 days. The chosen hotel is Abercorn house and the check in date is March 1st"}, {"utterance": "No, correct the check in date, the right one is the 9th of this month and I'll only need it for 1 day", "response": "Confirm again then. Check in date is March 9th and you'll need the room for 1 day"}, {"utterance": "Yes, I need to know the phone number too", "response": "the reservation has been made, the number to call is +44 20 8563 8692"}, {"utterance": "Look if there's wifi signal over there and tell me the address too", "response": "Wifi signal is absent and the address is 28-30 bute gardens"}, {"utterance": "thanks a lot", "response": "May I assist you in some other procedure?"}, {"utterance": "No,that's all. Bye", "response": "Enjoy the rest of your day"}], "annotations": [{"turn": 7, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["no, i dont like that.", " no, i don't like it, go on."], "confidence": 0.683, "turn": 7}]}