{"unique_id": "69_00015_sgd_train", "id": "69_00015", "turns": [{"utterance": "I want to find some attractions I can visit.", "response": "Can you tell me where I should look for the attractions?"}, {"utterance": "I am interested about attractions in San Francisco.", "response": "You might consider visiting Alcatraz, which is a Historical Landmark."}, {"utterance": "Can you give me their phone number? Can you tell me if this place welcomes children?", "response": "If you want to call them you can at 415-561-4900. Unfortunately this place is not really good for kids."}, {"utterance": "Alright, nice. I would like to watch a movie while I am there. I usually enjoy watching Fantasy movies. I want to watch the movie at Roxie Theater, and any type of show would be fine with me.", "response": "How would you like watching Penguin Highway?"}, {"utterance": "Penguin Highway seems great.", "response": "Do you want to buy tickets for this movie?"}, {"utterance": "No, I am not interested in buying tickets at the moment.", "response": "Is there something else I can help you with?"}, {"utterance": "I would like to find a movie directed by Eric Khoo which I can watch online.", "response": "Can you tell me the kind of movie you would like to watch?"}, {"utterance": "I would enjoy watching some Drama movies.", "response": "There is 1 movie which you might enjoy watching. How would you like watching the Ramen Shop?"}, {"utterance": "Ramen Shop would be a good movie to watch.", "response": "Do you want the movie to start playing now?"}, {"utterance": "Yes, I want to start watching the movie now.", "response": "Can you please confirm that you want to watch Ramen Shop without subtitles?"}, {"utterance": "Yes, that is correct.", "response": "Your requested movie has started playing."}, {"utterance": "Thank you! That would be all!", "response": "Have a good time!"}], "annotations": [{"turn": 5, "annotation": [{"error_type": "", "comment": "always about not to want to buy tickets", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " no, i am not interested in buying tickets at the moment."], "confidence": 0.507, "turn": 5}]}