{"unique_id": "94_00047_sgd_train", "id": "94_00047", "turns": [{"utterance": "I need help looking for a bus departing from Fresno tomorrow.", "response": "I can help you with that. What is your destination?"}, {"utterance": "I'd like to go to Sacramento.", "response": "I located 6 buses. There's an Economy ticket on a bus departing at 8 am for $31."}, {"utterance": "What's the name of the bus station I'd be leaving from?", "response": "the bus departs from Fresno Station."}, {"utterance": "Ok. Are there any other buses available?", "response": "There's an Economy ticket on a bus leaving at 8:20 am for $32."}, {"utterance": "Sounds good. I need tickets for 4 people.", "response": "Ok. Just to confirm: you would like 4 Economy tickets on a bus from Fresno to Sacramento departing at 8:20 am on March 2nd."}, {"utterance": "Yes, that's perfect. What's the destination station?", "response": "I've booked your tickets. The destination station is Sacramento Valley Station."}, {"utterance": "Ok. I need to book one room there at a hotel that allows pets.", "response": "There's the Doubletree By Hilton Hotel Sacramento with a 4.1 rating."}, {"utterance": "What's the hotel's address and phone number?", "response": "The hotel is located at 2001 Point West Way and the phone number is +1 916-929-8855."}, {"utterance": "Are there any other hotels?", "response": "There's also the Hilton Sacramento Arden West with a 4.2 rating."}, {"utterance": "Ok. Any others?", "response": "How about the Holiday Inn Express Sacramento Convention Center with a 3.8 rating?"}, {"utterance": "That's perfect.", "response": "Ok. Should I proceed with a reservation?"}, {"utterance": "No, thanks. I don't want to book it right now.", "response": "Is there anything else I can help with?"}, {"utterance": "No, thank you.", "response": "Have a great day."}], "annotations": [{"turn": 11, "annotation": [{"error_type": "", "comment": "not a correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " i don't want to book it right now."], "confidence": 0.815, "turn": 11}]}