{"unique_id": "95_00043_sgd_train", "id": "95_00043", "turns": [{"utterance": "Some friends and I are heading to Vegas for a vacation. Can you help me search for a bus for 4 to get there?", "response": "Where are you departing from?"}, {"utterance": "We're leaving from Fresno.", "response": "When would you like to travel?"}, {"utterance": "Actually, I'm leaving from Sacramento and we'd like to leave on Thursday next week.", "response": "Okay, I found 10 buses that might work. One bus departs at 7:30 am, has 1 transfer and costs $63."}, {"utterance": "That sounds good, let's book that bus.", "response": "Okay, let's confirm the details: You're booking 4 tickets on the bus leaving Sacramento and heading to Las Vegas. It departs on March 7th at 7:30 am."}, {"utterance": "Yes, sounds good. What station does the bus arrive at?", "response": "Your tickets are booked. You'll arrive at Union Plaza."}, {"utterance": "And what station do I leave from?", "response": "You'll depart from Sacramento Valley Station."}, {"utterance": "Thanks. Can you also help me find a hotel room? I only need 1 room with Wifi and a 1 star hotel is fine.", "response": "I found a 1 star hotel, the Best Western Plus Las Vegas West."}, {"utterance": "Is there anything else available? What about three rooms at a 2 star hotel?", "response": "I found 4 options for you. The Hampton Inn Las Vegas/Summerlin is a nice 2 star hotel."}, {"utterance": "Is there any other hotels I might like?", "response": "The La Quinta Inn & Suites By Wyndham Las Vegas Summerlin Tech is a nice 2 star hotel."}, {"utterance": "Yes, that might work. That's all I need for now thanks.", "response": "Have a great day!"}], "annotations": [{"turn": 8, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["are you sure that there are no hotels on the west side of town?", " is there any other hotels i might like?"], "confidence": 0.553, "turn": 8}]}