[{"turns": "['USER: Can you find me some country songs?', 'SYSTEM: I found 10 songs that match your request. What about the song All On Me by Devin Dawson from the album Dark Horse?', 'USER: What other songs do you have? I want songs from the album Kuntry.', 'SYSTEM: What about the songs All The Girls Wanna Ride by the Jawga Boyz from the album Kuntry?', 'USER: What other songs do you have?', 'SYSTEM: What about the song Ridin High by Jawga Boyz from the album Kuntry?', 'USER: That sounds good.', 'SYSTEM: Do you want to play it?', 'USER: Yes, play it on the kitchen device.', 'SYSTEM: Please confirm: Playing Ridin High on the kitchen speaker.', 'USER: No, play it on my bedroom speaker.', 'SYSTEM: Please confirm: Playing Ridin High on the bedroom speaker', \"USER: Yes, that's it.\", 'SYSTEM: Playing song now.', 'USER: Thanks so much.', 'SYSTEM: Anything else I can do for you?', \"USER: No, that's all.\", 'SYSTEM: Have a great day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I would like to transfer 820 bucks to a checking account.', 'SYSTEM: Which account do you want to transfer the funds from?', 'USER: Send it to Abhinav from my checking account.', \"SYSTEM: Please confirm that you want to transfer $820 from your checking account to Abhinav's checking account.\", 'USER: Sounds perfect.', 'SYSTEM: Transfer completed successfully.', \"USER: I'd like to know the balance in my checking account.\", 'SYSTEM: The balance in your 1 checking account is $1,696.61.', 'USER: Thank you for that information.', 'SYSTEM: Would you like to initiate a transfer?', \"USER: No. I'm done. Thank you. Bye!\", 'SYSTEM: Have a great day!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want to have some fun, so can you tell me about some attractions I can visit?', 'SYSTEM: Which is the location where I should look in for attractions?', 'USER: I want to know about attraction in Paris, and more specifically I am interested in a Museum kind of attraction.', 'SYSTEM: You might enjoy visit Choco-Story Paris - Musee du Chocolat, which is a Museum.', 'USER: Can you tell me if the entrance is free at this attraction? What phone number can I use to contact them?', 'SYSTEM: Unfortunately, the entrance is not free. If you want to call them you can through 1 42 29 68 60.', \"USER: Alright, that's good, but are there some other attractions? I will have my kids with me, so I am looking for something which is child-friendly.\", 'SYSTEM: There are 9 attractions which match your request. You can consider visiting Cinematheque Francaise, which is a Museum.', 'USER: Alright, nice. I will need one room in a hotel there then.', 'SYSTEM: There are 10 hotels which you might like. Would you like staying at Ac Hotel By Marriott Paris Porte Maillot, which has a 4.3 rating?', \"USER: That's just what I want. I would like to make a room booking. I will be there on March 6th, and I will leave next Thursday.\", 'SYSTEM: Can you please confirm that you want to book 1 room at Ac Hotel By Marriott Paris Porte Maillot in Paris, and that you will go there on March 6th, and you will leave on March 7th.', 'USER: Yes, that suits me well.', 'SYSTEM: Your room has been booked.', 'USER: Can you tell me if pets are allowed there?', 'SYSTEM: The pets are allowed in the hotel.', 'USER: I appreciate it. That would be all.', 'SYSTEM: Have a good time!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: Hi there, could you get me a luxury ride for 1 to 5720 Mowry School Road please?', 'SYSTEM: Sure, please confirm your booking for a luxury ride for 1 to 5720 Mowry School Road.', 'USER: Sorry, could you change the reservation for two instead?', 'SYSTEM: Sure, please confirm your booking for a ride for 2 to 5720 Mowry School Road please?', 'USER: That is fine with me.', 'SYSTEM: Your booking has been made and is on its way.', 'USER: Thanks for your kind assistance!', 'SYSTEM: Could I further assist you in any way?', 'USER: Could you help me search for some songs?', 'SYSTEM: Sure, would you like to listen to Lookalike by Conan Gray in his album Sunset Season?', 'USER: May I know what is the genre of this song and was it released seven years back?', 'SYSTEM: This is a Pop song released in 2018.', 'USER: I see, that is the one I am looking for you. Could you play it on my TV instead?', 'SYSTEM: Sure, please confirm your request to play Lookalike on the TV.', 'USER: Sure, that is correct.', 'SYSTEM: Enjoy listening to your music.', 'USER: Thank you very much.', 'SYSTEM: Do you need further assistance?', 'USER: No, that is all, thank you!', 'SYSTEM: Sure, enjoy your trip!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want to search for events', 'SYSTEM: What are you interested in?', \"USER: I'm into Games\", 'SYSTEM: Do you prefer any city for the events?', 'USER: Look for Football games in Oakland', \"SYSTEM: Threre's a Raiders Vs Bengals game at Oakland-Alameda County Coliseum\", 'USER: That sounds great, I am interested in finding more dates for events', \"SYSTEM: There's a Raiders Vs Bengals game at Oakland-Alameda County Coliseum today\", 'USER: What time does it start?', 'SYSTEM: It starts at 7 pm', 'USER: That sounds great!', 'SYSTEM: Do you want me to buy tickets?', 'USER: Yes, please do', 'SYSTEM: How many do you need?', 'USER: I need 3 tickets', 'SYSTEM: Confirming 3 tickets for today at the Raiders Vs Bengals game in Oakland', \"USER: Yes that's right\", 'SYSTEM: Your tickets are booked', \"USER: Thanks, that's all I need\", 'SYSTEM: Have a great day!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I would like to find a one way flight. The number of bags I have to check in is zero. I would like three seats on a flight out of Seattle.', 'SYSTEM: Where do you want to go? What is the date you want to travel?', 'USER: I would like to fly out on the 3rd going to Toronto.', 'SYSTEM: I have located 5 flights for you. Do you want to fly on Alaska Airlines? The flight will leave at 11:10 am local time. It has 1 layover and the price of the ticket is $333 per passenger.', 'USER: Find something else for me.', 'SYSTEM: Do you want to fly with American Airlines? The flight will leave at 1:40 pm local time. There is 1 layover and this flight costs $328 per passenger.', 'USER: Where will the flight land? At what time will the flight get to my destination?', 'SYSTEM: The flight will arrive at 3:29 am at Toronto Pearson International Airport.', 'USER: Okay. I would like to check the balance in my savings account.', 'SYSTEM: The balance of your savings account is $7,807.23.', 'USER: Okay, thank you for that.', 'SYSTEM: Do you want to transfer some money?', 'USER: Yes, I would like to make one transfer.', 'SYSTEM: Who do you want to send your money to?', 'USER: Send the money to Yumi.', 'SYSTEM: What is the amount of money that you would like to transfer?', 'USER: I would like to transfer one thousand two hundred and ninety dollars into their savings account.', 'SYSTEM: Confirm these details for me: Transfer $1,290 from your savings account to the savings account of Yumi.', 'USER: Yes, that is right.', 'SYSTEM: The transfer is successfully begun.', 'USER: Thanks very much for your help.', 'SYSTEM: Is there anything else you need?', 'USER: No, thanks a lot for your help.', 'SYSTEM: Have a wonderful day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I would love to find a new apartment. It would be great to have 2 baths.', 'SYSTEM: And how many bedrooms would you like in this apartment?', 'USER: It really should have 2 bed rooms as well.', 'SYSTEM: Which area would you like this apartment to be in?', 'USER: I really want to have a nice apartment in Sunnyvale.', 'SYSTEM: I have found 10 nice apartments. Apricot Pit Apartments looks to be a very good property and is located at 400 East Remington Drive. The property has 2 bed rooms and 2 baths as required. The rent for this apartment is 4800 dollars per calendar month.', 'USER: Great, but can you find me some other apartments?', 'SYSTEM: Arbor Terrace Apartments is also a very good property located at 555 East El Camino Real. The property has 2 bed rooms and 2 baths as required. The rent for this apartment is 3750 dollars per calendar month.', 'USER: I really would like to find some more apartments. It should now have 3 baths. I want a furnished apartment now as well.', 'SYSTEM: Crescent Terrace Senior Apartments looks to be a very good property, located at 130 Crescent Avenue. The property has 2 bed rooms and 3 baths as required. The rent for this apartment is 4300 dollars per calendar month.', 'USER: Yes, that apartment sounds perfect.', 'SYSTEM: Would you like me to book in and schedule a visit to this location?', 'USER: No, not now thank you.', 'SYSTEM: What else can I help you with?', 'USER: Nothing more, thank you.', 'SYSTEM: Have a great day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want to find some attractive places to visit. I need your help to find the interesting one for me.', 'SYSTEM: Do you want to search for the attractive places in any particular City which is convenient to you to travel?', 'USER: Yes, find me something in SF.', 'SYSTEM: What about a Historical Landmark. Do you like Historical place? If so then you can try to visit Alcatraz which is the best place among the 10 that I have in my search list.', 'USER: Let me decide, before that I want to know whether this place is safe for Kids and also I want their contact number for my reference.', 'SYSTEM: Yes this is the safest place for children and you can contact them at any time using the phone number 415-561-4900.', 'USER: Thanks for the details. Search for some nice movies to watch at the same place.', 'SYSTEM: You can choose any one of the movie from Ad Astra, Brittany Runs a Marathon and Fiddler: A Miracle of Miracles.', 'USER: I choose Brittany Runs a Marathon.', 'SYSTEM: That is nice movie. Shall I book the tickets now?', 'USER: Do it later and I will ask you the same later.', 'SYSTEM: How can I assist you further?', 'USER: I want to watch a movie online and again search for good movies to watch online.', 'SYSTEM: This time you have any particular type of movie to search for?', 'USER: I like to watch Family movies as I need to watch it online in my place.', 'SYSTEM: What about Steel Magnolias or do you like The farewell?', 'USER: I prefer Steel Magnolias.', 'SYSTEM: Shall I play it now online for you?', 'USER: Yes, play it with subtitles in Hindi language.', 'SYSTEM: Please confirm to play the movie Steel Magnolias with subtitles in Hindi language.', 'USER: That is confirmed to proceed.', 'SYSTEM: The movie was started playing now and you can enjoy the same.', 'USER: What is the actor name?', 'SYSTEM: Daryl Hannah acted in this movie.', \"USER: That's okay. Thanks.\", 'SYSTEM: Anything else you need?', 'USER: Nothing for now and thanks for everything.', 'SYSTEM: Its my pleasure. Have a great day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want to do something. Can you help me find something to do?', 'SYSTEM: In what city do you prefer to be and what category do you want the events to be? From Sports or Music or?', 'USER: I would like to be located in Oakland.I enjoy events in category Games.', 'SYSTEM: Raiders Vs Bengals is in Oakland-Alameda County Coliseum.', 'USER: Something else is available on 14th of March?', 'SYSTEM: I found 2 options that you might like.Event is Raiders Vs Lions and have location in Oakland-Alameda County Coliseum', 'USER: Other events can you find please?', 'SYSTEM: Name of event is Raiders Vs Titans and take place at Oakland-Alameda County Coliseum.', 'USER: Tell me where it is located and what is the event category.', 'SYSTEM: Is located at 7000 Coliseum Way ans is a Football event.', 'USER: Please go to my checking account and check my balance.', 'SYSTEM: In checking account you have $8,781.25.', 'USER: Tell me please from another account.Just go to my savings account.', 'SYSTEM: In savings account you have $19,186.38.', 'USER: Ok.Thanks for help.', 'SYSTEM: You want to make a transfer?', 'USER: No, I do not want to make transfers.I want to book 1 ticket at event.', \"SYSTEM: At Raiders Vs Titans 1 tickets.The event is take place on March 14th in Oakland.I'm right?\", 'USER: No, I changed my mind.Make it two please.', 'SYSTEM: 2 tickets at event located in Oakland is that OK?', 'USER: Yes is good.Tell me when the event start?', 'SYSTEM: The booking was successful.Starts at 5 pm.Have fun at the event!', 'USER: Thank you very much!', 'SYSTEM: Can I do anything else for you?', 'USER: No.Thank you!', 'SYSTEM: Have a nice day!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Could you find me some attractions?', 'SYSTEM: Where should I search?', 'USER: Could you find me something child friendly for free in SF?', 'SYSTEM: I found 10 options. How about this nature preserve: the aquarium of the bay?', 'USER: Could you find me something else?', \"SYSTEM: How about the Coit Tower? It's a historical landmark.\", 'USER: Cool, could you find me a museum?', 'SYSTEM: You should check out this museum: the contemporary jewish museum.', 'USER: oKay, great.', 'SYSTEM: Do you need anything else?', \"USER: I'd like to find some games, one today pelase.\", \"SYSTEM: I found 3 options. There's the giants vs diamondbacks, at oracle park.\", 'USER: Sounds good to me. I want to find a house there.', 'SYSTEM: okay, i have 10 options. How about this one at 1095 market street rated 3.7?', 'USER: Sounds good.', 'SYSTEM: Would you like a reservation?', 'USER: No thanks. How about a bus heading there?', 'SYSTEM: When are you departing, march 1st? Where are you leaving from?', \"USER: Yes please, I'm leaving from sacramento.\", 'SYSTEM: How about this one leaving at 7:40 am for $22 for an economy ticket?', \"USER: Sounds good, that's all I need.\", 'SYSTEM: Have a great day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need your help finding a train please.', 'SYSTEM: Please provide more details such as where you are leaving from and where you would like to go.', 'USER: My trip will begin in Portland. March 5th is the day I would like to travel.', 'SYSTEM: Where would you like the train to take you to?', \"USER: I'm looking forward to going to Seattle, WA.\", 'SYSTEM: I found a train that costs $58. This option has a departure time of 9:10 am.', 'USER: I like that choice. Can you find any stimulation events there on the day I arrive?', 'SYSTEM: Do you have any type of event in mind?', 'USER: Yes. Drama is one of my favorites.', 'SYSTEM: Wow. You have 10 choices. My suggestion is one that a lot of people enjoy. The date is March 10th and it will begin at 5 pm. It is called Beatleconcert. It will be showing at 12th Avenue Arts.', 'USER: I will love that. Would you please also locate some attractions in the area?', 'SYSTEM: Of course. I suggest a Park known as Alki Beach Park.', 'USER: This sounds like it would not have a cost.', 'SYSTEM: There is a charge for this park.', 'USER: Sweet. There will be two of us and we will need a house in the area.', 'SYSTEM: One of 10 good homes I found is located at 1000 1st Avenue. This house has a 4.5 star rating.', 'USER: The house you find must have laundry service. Anything rated 4.2 or higher is fine. Please give me some more choices.', 'SYSTEM: Another good choice is at 1007 1st Avenue. This house is rated 4.2.', 'USER: Is there a contact number for me to call the house at?', 'SYSTEM: Yes. You can reach them at +1 206-624-4844.', 'USER: This home seems like it will suit my needs perfect.', 'SYSTEM: I can help you reserve the home if you like.', \"USER: I'm set for now but thanks for offering.\", 'SYSTEM: No problem. Take it easy.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": "['USER: Can you help me find an interesting event?', 'SYSTEM: What city should I search in? What category of events would you prefer?', \"USER: I'd like an event around Sacramento. I enjoy Concert events, especially Electronica ones.\", \"SYSTEM: There's an event called Yunger that takes place the day after tomorrow at 6:30 pm. It will be at Holy Diver.\", \"USER: What's the address for the venue?\", 'SYSTEM: The address is 1517 21st Street.', \"USER: Sounds good. That's all I wanted, thanks.\", 'SYSTEM: Have a nice day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: I need a regular cab ride to 1111 Meridian Avenue Ste 5.', 'SYSTEM: How many seats do you require?', 'USER: Just one please.', 'SYSTEM: You want a regular ride to 1111 Meridian Avenue Ste 5 for 1, correct?', 'USER: Yes thanks. How much is the total and when will it arrive?', 'SYSTEM: Your cab arrives in 6 minutes, the total is $14.87.', 'USER: Thanks for your help. Could you please find me a pop song by Martin Garrix from one years back?', 'SYSTEM: How about High on Life by Martin Garrix from the Martin Garrix Experience?', \"USER: Yes that's the one thanks.\", 'SYSTEM: Would you like me to play it?', 'USER: Yes please do.', 'SYSTEM: You want to hear High on Life on the TV, correct?', 'USER: No please cast to my bedroom speaker.', 'SYSTEM: High on Life on the bedroom speaker, correct?', 'USER: Perfect thank you!', 'SYSTEM: Enjoy your tune.', \"USER: Thanks, that's all I needed.\", 'SYSTEM: Enjoy your day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need a salon in Cupertino.', 'SYSTEM: There a 6 salons in Cupertino, including Great Clips!', 'USER: Perfect! Can you share the address with Jeremy? 20686 Homestead Road.', 'SYSTEM: Please confirm, sharing location 20686 Homestead Road with Jeremy.', 'USER: Pefecto!', 'SYSTEM: Message to Jeremy sent.', 'USER: Thanks! Can you also show me my alarms?', 'SYSTEM: You have 3 alarms, beginning with 7 am for Exercise.', 'USER: Cool. I need to add a new alarm for Cleaning at 3:45 in the afternoon.', 'SYSTEM: Please confirm, cleaning at 3:45 pm.', 'USER: Yes.', 'SYSTEM: Alarm was created.', 'USER: Thanks! That is all I need.', 'SYSTEM: Have a nice day!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need my skin checked out. Can you find me a dermatologist?', 'SYSTEM: In what city?', 'USER: In SF.', \"SYSTEM: There's a great dermatologist in San Francisco. Her name is Anne Han, M.D.\", 'USER: Actually, I also really need my eyes checked out. Can you find an ophthalmologist?', 'SYSTEM: I found 10 of those in San Francisco. A top ophthalmologist there is Alan B. Scott, M.D.', 'USER: Sounds good. Can you get me a regular cab for a group of 3 to travel to 2100 Webster Street Suite 214?', 'SYSTEM: You want a regular cab ride for 3 to 2100 Webster Street Suite 214?', \"USER: I do. What's the cost?\", \"SYSTEM: I booked your ride and it'll be here soon. It'll cost $33.10.\", 'USER: How long will I have to wait before it arrives?', 'SYSTEM: About 3 minutes.', \"USER: Thanks. You're a great help. Can you also find me a fish restaurant there?\", \"SYSTEM: Sure. I found 10 fish eateries in San Francisco. How about Akiko's Sushi Bar?\", 'USER: Sounds good. Can I reserve a table for one at there half past 6 in the evening?', \"SYSTEM: You want to book a table for 1 at Akiko's Sushi Bar in San Francisco at 6:30 pm on March 1st?\", 'USER: Actually, make it March 10th.', \"SYSTEM: You want to instead book the table at Akiko's Sushi Bar for March 10th?\", 'USER: That is correct.', 'SYSTEM: I booked the table.', 'USER: Thanks a ton!', 'SYSTEM: Can I help you out further?', 'USER: Not now. Thanks.', 'SYSTEM: Have a great day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to book an appointment for the salon.', 'SYSTEM: Okay, what is the name of the salon? And on what date would you like to book the appointment? Which time do you prefer?', 'USER: I need to go to the salon on March 3rd, preferably in the evening 5:45 slot at Linda Hair & Nails.', 'SYSTEM: Would you confirm booking an appointment at 5:45 pm on the day after tomorrow for Linda Hair & Nails?', 'USER: That would be fine.', 'SYSTEM: Would booking the appointment at 6 pm on the day after tomorrow at Linda Hair & Nails, be all right? I could not book it for 5:45.', 'USER: That would be all right.', 'SYSTEM: You have successfully booked the appointment.', 'USER: Could you tell me which city the salon is located?', 'SYSTEM: The appointment is for the salon in San Jose.', 'USER: Thank you lots! Just what I was looking for.', 'SYSTEM: Have a pleasant rest of the day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to find a room at a four star hotel in Sydney, Australia.', \"SYSTEM: I found 10 hotels you might like. Hohw about 28 Hotel Sydney? It's a nice 4 star hotel.\", 'USER: Anything else? I need three rooms.', 'SYSTEM: I found 9 other hotels matching your query. How bout 57 Hotel? It is a nice 4 star hotel.', 'USER: Anything else I might like?', 'SYSTEM: Sure, what about Adina Apartment Hotel Bondi Beach Sydney? It is another 4 star hotel.', 'USER: Okay that one sounds good.', 'SYSTEM: Do you want to reserve a room there?', 'USER: Yeah, can you help me with that?', 'SYSTEM: When do you want to check and, and how long will you be staying?', 'USER: I want to check in Sunday this week and stay for three days.', 'SYSTEM: Alright, so you would like to book 3 rooms for 3 days at Adina Apartment Hotel Bondi Beach Sydney, located in Sydney, checking on on March 3rd. Is that correct?', 'USER: Actually I want to check on on the 1st.', 'SYSTEM: Okay, so you want to reserve rooms at Adina Apartment Hotel Bondi Beach Sydney and check in March 1st, is that right?', 'USER: Yeah that sounds good.', 'SYSTEM: Your rooms were successfully booked.', \"USER: What's the cost per night?\", 'SYSTEM: It is $444 per night.', \"USER: Thanks. What attractions are around there? I'm looking for a shopping district that's good for kids.\", 'SYSTEM: You could go to Bondi Markets, which is a shopping area.', \"USER: Perfect, that's all for now.\", 'SYSTEM: Okay, enjoy your trip!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Can you find me a rental car for eight pm?', 'SYSTEM: What time do you want to pick up the car and until what date do you need it?', 'USER: I need the car in Chicago until the 9th of this month.', 'SYSTEM: From what date do you need it?', \"USER: I'd like the car on March 4th.\", \"SYSTEM: How about this nice Standard Honda Accord for pickup on next Monday? It's at O'Hare International Airport.\", 'USER: How much would the total be?', 'SYSTEM: It costs $175 in total.', 'USER: That sounds all right. Reserve the car for me.', \"SYSTEM: Please confirm some details for me. You will pick up the Standard car at O'Hare International Airport next Monday at 8 pm. You will drop off the cr on March 9th.\", 'USER: Yes, that sounds correct.', 'SYSTEM: Your car was reserved.', 'USER: Thank you for your help. That is all I need.', 'SYSTEM: Have a beautiful day!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Hello, I really need a checkup. Can you find an ENT specialist in Fremont for me?', \"SYSTEM: There's an ENT specialist in Fremont called Jason R. Van Tassel, MD. How does he sound?\", \"USER: He sounds good. I'd like to visit him.\", 'SYSTEM: On what date?', 'USER: On March 4th.', 'SYSTEM: And at what time?', 'USER: At evening 5:30.', \"SYSTEM: Okay, you'll be visiting Jason R. Van Tassel, MD at 5:30 pm on March 4th. Is that correct?\", \"USER: That's correct. What's his address?\", \"SYSTEM: I booked your appointment. He's at 2961 Summit Street.\", 'USER: Thanks. When is my free time that day?', 'SYSTEM: On what date?', 'USER: On March 3rd.', 'SYSTEM: On March 3rd, you have plenty of free time from 9:30 am to 7 pm.', 'USER: Sounds great. I also need my teeth taken care of. Can you find me a dentist in Fremont?', 'SYSTEM: I found 10 dentists in Fremont, including Centerville Dental Care.', 'USER: That one sounds good to me.', 'SYSTEM: Want to book an appointment there as well?', 'USER: I sure do.', 'SYSTEM: At what time?', 'USER: Is 2:15 in the afternoon doable?', 'SYSTEM: It is. You want to visit Centerville Dental Care at 2:15 pm on March 3rd?', 'USER: Yes, I do.', 'SYSTEM: Okay. I successfully booked your dental appointment.', 'USER: Great! Thanks. I need nothing else right now.', \"SYSTEM: Have a great day. It's a pleasure to help.\"]\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": "['USER: I am looking for some good music.', 'SYSTEM: Have you heard of Wojenka by Lao Che of the Dzieciom album?', 'USER: No. Do you have any Ariana Grande songs?', 'SYSTEM: What about Be Alright by Ariana Grande of the Dangerous Woman album?', 'USER: Never mind nothing by her either. How Ghost songs of the Meliora album?', 'SYSTEM: I have 2 songs by Meliora album by Ghost. How about Cirice?', \"USER: Yeah, that's the one.\", 'SYSTEM: Do you want me to play it for you?', 'USER: Yes play that song.', 'SYSTEM: Do you wan to hear Cirice on the TV?', 'USER: Yeah, play it on the TV.', 'SYSTEM: Okay, the song is playing.', 'USER: Cool, thanks for all your help.', 'SYSTEM: You are welcome. Bye.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want to find tickets for a round trip flight, and I want to leave today.', 'SYSTEM: Can you tell me from where you will leave, and where you want to arrive? Can you also tell me when you plan to return?', 'USER: I will be flying from Portland, and I want to arrive in SFO. I want to return from my flight on Friday next week.', 'SYSTEM: There are 5 flights which match what you want. One of the flights is Alaska Airlines which departs at 7:55 am, and when it returns it flies at 12:20 pm. The ticket of this flight costs $133.', 'USER: Can you check if there are other flights available? I need the tickets for 3 people, and I want to fly with Southwest Airlines.', 'SYSTEM: There is 1 flight which matches what you requested. The flight is with Southwest Airlines and it departs at 3:15 pm, and when it returns it flies at 11:30 pm. The ticket for this flight will cost you $117.', 'USER: This flight seems as what I want.', 'SYSTEM: Do you want to book tickets for this flight?', 'USER: I want to buy Economy tickets for this flight.', 'SYSTEM: Can you please confirm that you want to buy Economy class tickets for 3 people for the flight with Southwest Airlines which departs from Portland on March 1st at 3:15 pm to arrive in San Francisco, and it returns on March 8th at 11:30 pm?', 'USER: That suits me well.', 'SYSTEM: Your requested ticket has been booked.', 'USER: I appreciate your help. I also need to make a booking for a rental car there. I will pick the rental car at night 8.', 'SYSTEM: Will you be going at SFO International Airport? Will you be picking the car up on March 1st, and will need the car till March 8th?', 'USER: Alright, that seems nice. I want to have the car on March 6th, and I will be needing to rent the car till 7th of this month.', 'SYSTEM: Would you like to have a car which is Compact. Full-size, or something else?', 'USER: I would prefer to have a medium-sized car.', 'SYSTEM: Can you please confirm that you want to rent a Standard car which you will pick up from SFO International Airport on March 6th at 8 pm, and you will need the car till March 7th.', \"USER: Alright, that's what I want. Can you tell me how much it will cost me?\", 'SYSTEM: Your requested rental car has been booked. The renting of this car costs $29.', 'USER: I appreciate your help very much. That would be all.', 'SYSTEM: Have a good time!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: I need help locating a doctor.', 'SYSTEM: Where would you like for me to search for you a doctor, and did you need to see an Ophthalmologist, Dermatologist or another type of doctor?', 'USER: Can you please find me a Gynecologist in Vallejo?', \"SYSTEM: I have found 2 results for Gynecologist in Vallejo. Would you like to visit Bilhartz Women's Health Center, Dr. Teri Bilhartz?\", 'USER: No, what is the other one you have?', 'SYSTEM: I also have gynecologist Rima Goldman, MD in Vallejo?', 'USER: What is the address of that office?', 'SYSTEM: The address is 975 Sereno Drive.', 'USER: Yes that is the one. Can you make me an appointment on the 12th of March.', 'SYSTEM: Do you have a time preference?', 'USER: I would like an appointment for 3:45 in the afternoon please.', 'SYSTEM: I have an appointment with Rima Goldman, MD for 3:45 pm on March 12th.', 'USER: Great, that is what I want.', 'SYSTEM: I am sorry, but when I was trying to reserve that time slot I was informed that time is no longer available. Would you like to see Dr. Rima Goldman, MD on March 12th at 3:30 pm instead?', 'USER: Yes that will work.', 'SYSTEM: Okay, I have successfully booked your appointment.', 'USER: Can I get the phone number to that practice and also what is her patient rating?', 'SYSTEM: The rating for Dr. Rima is 5.0 and the phone number is 707-651-1031.', 'USER: Great, can you also book me a cab ride?', 'SYSTEM: Sure, is the cab just for you?', 'USER: No, I will need a cab for 3 people please.', 'SYSTEM: Do you know what type of ride you would like?', 'USER: Yes, I would like a pool ride.', 'SYSTEM: Okay, I have a pool ride for 3 to 975 Sereno Drive, is this correct?', 'USER: Yes that is right. How much will the ride cost?', 'SYSTEM: The total charge of this ride is $15.28 and your cab has been booked.', 'USER: Great! Thank you for everything.', 'SYSTEM: Would that be all for you today?', 'USER: Yes, that will be all. Thank you again for all of your help.', 'SYSTEM: You are welcome and I home you enjoy the rest of your day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: What is my current balance?', 'SYSTEM: Which account do you want to check?', 'USER: I want to check my checking account.', 'SYSTEM: Your checking account balance $5,703.30', 'USER: How about my savings account?', 'SYSTEM: Your savings account balance is $16,188.77', 'USER: Ok.', 'SYSTEM: Would you like to make a transfer?', 'USER: Yes.', 'SYSTEM: How much do you want to transfer?', 'USER: Transfer 850 bucks to Pranav.', \"SYSTEM: Please confirm you want to transfer $850 from your savings account to Pranav's checking account.\", 'USER: Yes.', 'SYSTEM: Transfer successful.', 'USER: What is my balance now?', 'SYSTEM: Your savings account balance is $15,338.77', 'USER: OK thank you.', 'SYSTEM: Have a good day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Help me find interesting events.', 'SYSTEM: What city and genre like Music or Sports?', 'USER: Near Stanford and I like Sports.', 'SYSTEM: At Stanford Stadium is Cardinal Vs Ducks the day after tomorrow at 6:30 pm.', 'USER: This sound good but anything else?', 'SYSTEM: Next Friday at 6 pm, I have Cardinal Vs Fighting Irish at Stanford Stadium.', 'USER: That sounds really good.', 'SYSTEM: Would you like to reserve?', 'USER: Not yet, check my balance.', 'SYSTEM: Checking or savings account?', 'USER: My checking account please.', 'SYSTEM: Your checking is $21,375.53.', 'USER: Ok, thanks for the balance.', 'SYSTEM: Have a really good day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": "['USER: I need to go on a short trip. Can you help me find four seats on a bus?', \"SYSTEM: What's the destination? When do you plan to go? Where are you leaving from?\", 'USER: I am leaving from Anaheim to a San Diego on March 8th.', \"SYSTEM: There's a bus that departs at 6 am with 0 transfers. It costs $25.\", 'USER: From which bus station will I be leaving from and where will I arrive?', 'SYSTEM: You will leave from the Anaheim Intermodal Center to the Santa Fe Depot.', 'USER: Sounds great. Please buy the tickets.', 'SYSTEM: So 4 tickets to a bus that leaves next Friday from Anaheim to San Diego at 6 am?', \"USER: Yes, that's it.\", 'SYSTEM: Your ticket was successful booked.', 'USER: Thanks a lot.', 'SYSTEM: Can I help you in anything else?', 'USER: No, thanks.', 'SYSTEM: Have an amazing day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Can you show me my alarms please', 'SYSTEM: Sure, you have 2 alarms, one at 11 am called Catch Bus', 'USER: Ok thanks for that', 'SYSTEM: Do you want to add any more?', 'USER: No thanks, but I do need to find a restaurant', 'SYSTEM: Where are you looking?', 'USER: I want to eat in Belmont', 'SYSTEM: What kind of food?', 'USER: I want some Italian!', 'SYSTEM: I found 3 Italian places in Belmont including Caprinos which you might like', 'USER: What else can you fine that is intermediate priced?', 'SYSTEM: I found 2 in Belmont including Divino Ristorante', \"USER: Yes that's good! Now let's book a rental car\", 'SYSTEM: What time do you need the car', 'USER: I want to get it at 12:30 and I wanna purchase insurance', 'SYSTEM: What kind of car? And till when do you need it?', 'USER: I need a sedan vehicle till the 9th of this month', 'SYSTEM: When do you want to start using it?', 'USER: I need it starting the 7th of March', 'SYSTEM: And where do you want to get it?', 'USER: I think the Portland Bus Station is a good place to get it', \"SYSTEM: Confirming your March 7th 12:30 pm pick up of the Sedan at Portland Bus Station and you'll be returning in on March 9th\", \"USER: Yes that's correct\", 'SYSTEM: It has been booked then', 'USER: Thanks so much, now can you share the location', \"SYSTEM: To whom? And is 968 Ralston Avenue the address you're referring to?\", 'USER: Yes please, share it with Heather', \"SYSTEM: Confirming you're sharing the address 968 Ralston Avenue to Heather\", 'USER: Confirmed, yes please', \"SYSTEM: You've share it\", \"USER: Thanks so much, that's all for now\", 'SYSTEM: Happy I could help, see ya!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: Is there a good Dermatologist in SFO?', 'SYSTEM: There are at least 10 by my count. Try Anne Han, M.D. She is a recommended Dermatologist in San Francisco.', 'USER: Who else you got?', 'SYSTEM: A Dermatologist in San Francisco? Aura Skin Spa.', 'USER: Whats their number. Do they have a rating?', 'SYSTEM: 415-788-3800. They have a 4.0.', 'USER: Just like my GPA. So I guess they are good.', 'SYSTEM: Yes. Should I see if they have an opening.', 'USER: Put that on hold.', 'SYSTEM: Ok. Whats up?', 'USER: What is the weather like over there. For March 2nd.', 'SYSTEM: 72 degrees average with the chance of rain being 15 percent.', 'USER: Great. See if they can slide me in at a quarter past 10 in the morning.', 'SYSTEM: 10:15 am at Aura Skin Spa. on MArch 2nd?', 'USER: Yes, thats the ticket. Where are they located?', 'SYSTEM: Aura Skin Spa is at 450 Sutter street #2340. But they did not have that spot. Should I try March 2nd at 10:30 Am?', 'USER: Just bag it.', 'SYSTEM: Ok. Anything else?', 'USER: No, thats all.', 'SYSTEM: Ok. Speak soon.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: I am looking for a Dermatologist in San Mateo', 'SYSTEM: I found 3 doctors. Allura Skin & Laser Center has a Dermatologist in San Mateo.', 'USER: Can you find me someone else who is a General Practitioner preferable in San Jose', 'SYSTEM: Access Health has a General Practitioner and is located in San Jose.', 'USER: That is the one I want.', 'SYSTEM: Do you want me to schedule an appointment.', 'USER: Yes, please schedule an appointment.', 'SYSTEM: What date and time would you like to go?', 'USER: How about 17:00 on Sunday this week?', 'SYSTEM: So you would like an appointment with Access Health at 5 pm on March 3rd. Is that correct?', 'USER: Yes that is correct. Can you tell me their rating and give me their phone number.', 'SYSTEM: They have a 4.0 rating. The phone number is 408-729-7690.', 'USER: Thanks, can you also order me a cab. I want a ride to 301 Old San Francisco Road Level 2. My preference is for a Pool ride.', 'SYSTEM: How many seats will you need?', 'USER: I will need two seats.', 'SYSTEM: Can you confirm that you want 2 seats for a ride to 301 Old San Francisco Road Level 2 and you prefer a Pool ride.', 'USER: That is correct.', 'SYSTEM: I booked you a cab and it is on the way.', 'USER: How long will it take the cab to reach me?', 'SYSTEM: The cab will be at your location in 5 minutes.', 'USER: Thanks for the assistance. That is all I needed.', 'SYSTEM: Enjoy the rest of your day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Hi, is there a salon I can visit?', 'SYSTEM: Which city are you looking at?', 'USER: Something in Santa Rosa is great.', 'SYSTEM: There are 9 salons you might like in Santa Rosa, how about Daredevils & Queens?', 'USER: Sounds great to me!', 'SYSTEM: Do you need an appointment there?', 'USER: Perhaps at a later time. Could you get me a 3D Play movie at 3rd Street Cinema in that area please?', 'SYSTEM: Would you like to watch The Art of Racing in the Rain?', 'USER: Are there any alternatives?', 'SYSTEM: Unfortunately no. Could I further assist you?', 'USER: Could you search for any comedy movies then?', 'SYSTEM: How about a movie titled yesterday?', 'USER: Yesterday sounds good to me. What time can I watch it?', 'SYSTEM: Are you watching it on the March 2nd?', 'USER: Yes, I am.', 'SYSTEM: There is a show at 9 pm at 3rd Street Cinema.', 'USER: May I have their address please and how much will the ticket cost?', 'SYSTEM: The tickets cost $15 and they are located at 620 3rd Street.', 'USER: I see, sounds great to me!', 'SYSTEM: Would you like me to purchase tickets for you?', 'USER: No, that is not necessary. Thanks!', 'SYSTEM: Could I further assist you then?', 'USER: Could you get me an appointment at the salon at half past 6 in the evening?', 'SYSTEM: Please confirm your appointment with Daredevils & Queens at 6:30 pm on March 2nd.', 'USER: Sounds great! What is their contact number?', 'SYSTEM: You can contact them at 707-575-5123, and your appointment has been made.', 'USER: Thank you so much, that is all I need.', 'SYSTEM: Have a great day ahead!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I will be visiting my sister soonest, can you please check the weather for me?', 'SYSTEM: On which city do you want me to check the weather?', 'USER: Check it in Washington D.C.', \"SYSTEM: Okay, the temperature on that would be 75 degrees Farenheit. And do not forget to bring an umbrella even there's just 13 percent chance of rain.\", 'USER: Thank you! Do you know some attraction there? I want to spend my free time wisely.', 'SYSTEM: How about 56 Signers of the Declaration of Independence Memorial? It is a famous nature preserve.', \"USER: That's great. I want to be close to the nature. Help me look for a cab for 3 people.\", 'SYSTEM: Please check the details; you will go to 56 Signers of the Declaration of Independence Memorial and you need a cab for 3 people. Would you like a shared ride?', 'USER: Yes, that would work for me. We are not in a hurry.', 'SYSTEM: I have booked a ride for you and its already on its way. It will arrive in 15 minutes.', \"USER: Thank you so much. You're such a big help.\", \"SYSTEM: You're welcome. Have a nice day!\"]\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Can you show me alarms please', \"SYSTEM: There's one set for 8 am called Coffee\", 'USER: OK Cool thanks. Now find me a Ramen place to eat at any price range', 'SYSTEM: Which location are we talking?', 'USER: I want a place in Santa Rosa', 'SYSTEM: I found 4 restaurants in Santa Rosa that fit including Hikuni', 'USER: Where are they located?', 'SYSTEM: They are at 4100 Montgomery Drive C', 'USER: Can you recommend another place?', \"SYSTEM: Osake is good, it's also in Santa Rosa\", \"USER: What's their rating\", 'SYSTEM: They have a average 4.5 rating which is pretty solid', 'USER: Can you recommend me another one', 'SYSTEM: How about Toyo Restaurant in Santa Rosa', 'USER: Yes that place is good', 'SYSTEM: Wanna book a table?', 'USER: No need for now thanks', 'SYSTEM: What else can I do', 'USER: Book me a car that I can pick up at 9:30 am from Benito Juarez International Airport, and I need it till the 7th', 'SYSTEM: When are you gonna get it though?', \"USER: I'll pick it up today\", 'SYSTEM: What kind of car? And do you need insurance?', 'USER: Any SUV is good, and no insurance necessary', 'SYSTEM: Confirming your SUV car with no insurance for pickup on March 1st 9:30 am and drop-off on March 7th at Benito Juarez International Airport', \"USER: Yes that's all correct\", 'SYSTEM: It has been confirmed and reserved', \"USER: What's the car name and what will it cost me daily?\", \"SYSTEM: It's a Mazda CX-5 and will be $40.00 a day\", 'USER: OK great, now share a location with Virginia, 3082 Marlow Road', 'SYSTEM: Sharing 3082 Marlow Road with Virginia yes?', \"USER: Yes please, that's right\", \"SYSTEM: It's been shared\", \"USER: OK that's it for now thanks so much for your help\", 'SYSTEM: I am glad I could be of assistance']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": "['USER: Will you find a movie?', 'SYSTEM: Which location?', 'USER: Anything in Mill Valley?', \"SYSTEM: There's 1 movie, the IT Chapter Two.\", 'USER: IT Chapter Two sounds great. Will you buy tickets?', 'SYSTEM: What showing?', 'USER: Anything at seven in the evening on March 1st. I would like three tickets.', 'SYSTEM: Any preference? 3d or imax?', 'USER: Just a regular show.', 'SYSTEM: Please confirm 3 regular tickets for IT Chapter Two on March 1st in Mill Valley at 7 pm.', 'USER: Sounds great. What genre? Address of theater?', \"SYSTEM: It's a Supernatural movie at 25 Throckmorton Avenue.\", \"USER: Thanks. That's all for now.\", 'SYSTEM: Have a wonderful day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I think I might go see a movie. Can you see what ones are playing right now?', 'SYSTEM: Sure, where at?', \"USER: Can you see what's showing in San Leandro?\", 'SYSTEM: Sure, I found 4 movies. Are you interested in Ad Astra, Angel Has Fallen, or Hobbs and Shaw?', 'USER: Nah, what else did you find?', \"SYSTEM: There's also Overcomer - how about that?\", 'USER: Overcomer sounds good.', 'SYSTEM: Ok, would you like to buy tickets?', \"USER: No, not right now. For now, can you just find some music to put on? I've heard good things about the Yours album.\", 'SYSTEM: Ok, I found 3 songs you might like. How about Blue Tacoma by Russell Dickerson from the album Yours?', 'USER: Yes, that would be perfect.', 'SYSTEM: Would you like me to put it on?', 'USER: Yes, can you?', \"SYSTEM: Sure, to confirm, you'd like to play Blue Tacoma on the Living room speakers. Is that right?\", \"USER: Yes, that's right. What year is that from again?\", \"SYSTEM: Your song is playing. It's from 2016.\", 'USER: Great, thank you.', 'SYSTEM: Sure, anything else I can do?', \"USER: No, that's all. Thanks!\", 'SYSTEM: Sure, have a good day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to buy a bus ticket for one person.', 'SYSTEM: Where are you going? Where are you leaving from?', \"USER: I'm leaving from Washington and am going to New York City.\", 'SYSTEM: What day and time do you want to leave?', \"USER: I'd like to leave at a quarter past 11 in the morning on the 3rd of this month.\", 'SYSTEM: So, you want 1 Economy bus ticket from Washington to New York leaving on March 3rd at 11:15 am? Is that correct?', \"USER: Yes, that's right.\", \"SYSTEM: Sorry, there aren't any buses available for that time. There is a bus leaving at 11:10 am for $35.\", 'USER: Yes, that will work.', 'SYSTEM: Your ticket is confirmed.', 'USER: What station does the bus leave from, and where does it arrive?', 'SYSTEM: The bus leaves from Union Station and arrives at the Port Authority Station.', \"USER: Thanks. I'm interested in tickets for events happening there.\", \"SYSTEM: Do you want events on March 3rd? Is there a particular event you're interested in? How many tickets will you need?\", \"USER: I'd like 4 tickets for the Mets Vs Pirates game on the 10th of March.\", 'SYSTEM: So you want 4 tickets for the Mets Vs Pirates game playing in New York on March 10th, is that correct?', \"USER: Yes, that's right.\", 'SYSTEM: Your tickets have been reserved. Have fun!', 'USER: Where is the game at, and when does it start?', 'SYSTEM: The game is at Citi Field at 7:30 pm.', \"USER: Thanks. That's all I need.\", 'SYSTEM: Have a nice day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to find a bus for two.', 'SYSTEM: What is departure?', 'USER: Departure is Sacramento, CA.', 'SYSTEM: When and where are you going?', 'USER: Leaving on the 7th to Vegas.', 'SYSTEM: I found 10. I have an economy ticket leaving 7:30 am and is $63.', 'USER: I would like to get an Economy extra ticket.', 'SYSTEM: I have and Economy extra leaving at 10:20 am for $78.', 'USER: Is there anything else leaving from LAX?', 'SYSTEM: I found 4. I have an economy extra leaving at 7:40 am for $45.', 'USER: What is departure station?', 'SYSTEM: Departure station is Union Station.', 'USER: I choose this one.', 'SYSTEM: Do you want ticket?', 'USER: I do but later.', 'SYSTEM: Is there anything else?', 'USER: I need to find attractions for children.', \"SYSTEM: I have 6. I have a museum called Discovery Children's Museum.\", 'USER: Yes, I want the bus tickets now.', 'SYSTEM: Confirm economy extra for 2 leaving Los Angeles to Las Vegas on March 7th at 7:40 am.', 'USER: Good, what is the arrival station?', 'SYSTEM: You are confirmed and arrival station is Union Plaza.', 'USER: I need a hotel too.', 'SYSTEM: I have a 4.3 rating at Best Western Plus Las Vegas West.', 'USER: Is there anything else?', 'SYSTEM: I have a 3.4 at Budget Suites of America.', 'USER: What is the contact?', 'SYSTEM: Phone number is +1 702-638-1800', 'USER: What is address and is it pet friendly?', 'SYSTEM: It is pet friendly and it is at 2219 North Rancho Drive.', 'USER: That is all I need.', 'SYSTEM: Have a great time.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: Get me a bus will you?', 'SYSTEM: What is your destination? When shall you depart?', 'USER: Headed to Philly on March 5th.', 'SYSTEM: Where will you take off from?', \"USER: I'm Leaving Washington.\", 'SYSTEM: 8 Options await. First up is 7:10 am with 0 stops, cost is $29.', 'USER: Sounds quite fine.', 'SYSTEM: Did you want tickets?', \"USER: I don't want to. Get a rental car there?\", 'SYSTEM: Do you want a car on March 5th?', 'USER: I need it on the 10th of this month.', 'SYSTEM: When will you return it. Do you want it in Philadelphia?', 'USER: Yes, and I will return on March 12th.', 'SYSTEM: What time of day will you pick up?', 'USER: In the morning 11.', 'SYSTEM: There is a nice Standard Altima on March 10th from 30th Street Station.', 'USER: How much is it?', \"SYSTEM: It's only $64.\", \"USER: Fine that's great.\", 'SYSTEM: Do you need more assistance?', 'USER: Yes, get it.', \"SYSTEM: Here's what I have: Pick up standard car at 11 am on March 10th, 30th Street Station and return it back there on March 12th.\", 'USER: perfection. Thanks. Good.', 'SYSTEM: Your car is set.', 'USER: I want to watch a show online.', 'SYSTEM: Which style movie?', 'USER: Give me some animation. Maybe directed by Dean DeBlois?', 'SYSTEM: Sure there is only 1. How To Train your Dragon: The Hidden World.', \"USER: I love it, let's go. Start up How To Train your Dragon: The Hidden World.\", 'SYSTEM: To be clear: Play How To Train your Dragon: The Hidden World without subtitles.', 'USER: Yes, just do it.', 'SYSTEM: Starting your show.', \"USER: Fine,that's great.\", 'SYSTEM: Any thing else?', 'USER: No, nothing now.', 'SYSTEM: Have a good time.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: My friend told me to go see this cool movie at imax. Your help setting that up for the 5th would be greatly appreciated.', \"SYSTEM: Sure. Wha't the name of the movie?\", \"USER: It's called Wild Nights.\", 'SYSTEM: And, what city do you want?', 'USER: Check out an imax in San Rafael, please.', 'SYSTEM: There is an 8:30 pm showing at the Smith Rafael Film Center.', \"USER: Okay, and what's the genre of the movie?\", 'SYSTEM: The movie is a drama.', 'USER: Nice one. Now, please order a cab for 1 person to go there.', 'SYSTEM: Do you want a Luxury or Pool or some other type of ride?', 'USER: The Luxury ride is what I want.', 'SYSTEM: Your are going to the imax address at 1118 4th Street, right?', \"USER: Yep, that's fine.\", 'SYSTEM: Do you want to confirm a Luxury cab ride for 1 passenger, going to 1118 4th Street?', \"USER: Yes, I'm ready to roll, and for how much, please?\", 'SYSTEM: Your cab ride is confirmed for a total of $19.03, and should arrive shortly.', \"USER: That's so nice of you, and I thank you.\", 'SYSTEM: Do you need more information?', \"USER: Nope, that's all folks. Appreciate that.\", 'SYSTEM: Glad to help. Enjoy your movie.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to see a dentist. Could you find one for me?', 'SYSTEM: What city do you want their office to be in.', 'USER: Sunnyvale would be the best city for me.', 'SYSTEM: Amazing Smile Dental is an option in Sunnyvale.', 'USER: Can you give me other options?', 'SYSTEM: Another office in Sunnyvale is Andrei Simel , Family & Cosmetic Dentisry.', 'USER: What else is there?', 'SYSTEM: You could try Boyer Dental Arts, which is also in Sunnyvale.', 'USER: That one sounds good!', 'SYSTEM: Are you ready to book an appointment.', 'USER: No, not yet. I just needed to find the right place.', 'SYSTEM: Glad I could help! Thank you!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need a plane. Can you find one for me? Preferably a round trip. I need to be back on the 14th of this month and want premium economy seats.', 'SYSTEM: Sure. What day are you going?', 'USER: The 12th. Also, I need tickets for four.', 'SYSTEM: What city are you going to? And which city are you departing from?', \"USER: I'm going to ATL from Las Vegas.\", \"SYSTEM: There's a Southwest Airlines plane which departs at 6:25 pm and costs $437. The flight which brings you back departs at 6:30 am.\", 'USER: What station does the plane go to? And which one does it leave from?', 'SYSTEM: The plane goes from McCarran International Airport to Hartsfield-Jackson International Airport.', 'USER: Perfect. Could you reserve some seats for me?', 'SYSTEM: 4 premium economy tickets for the Southwest Airlines flight from Las Vegas to Atlanta which leaves on March 12th at 6:25 pm, with a return flight which departs at 6:30 am on March 14th. Is that correct?', \"USER: That's right.\", 'SYSTEM: I have reserved your seats.', \"USER: Can you also find me something interesting to do while I'm there?\", 'SYSTEM: Sure. What kind of activity are you looking for? A music concert? A sports game? Or something else?', \"USER: I'd love to see a concert on the 13th of this month.\", 'SYSTEM: How about going to see Emmylou Harris at Atlanta Symphony Orchestra?', \"USER: Awesome. Thanks for your help, I don't need anything else.\", 'SYSTEM: Enjoy your day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: Find me a doctor', 'SYSTEM: Where do you prefer?', 'USER: I prefer SF', 'SYSTEM: Which type of doctor do you want?', 'USER: look for a General Practitioner', 'SYSTEM: There are 10 results. Would you like to make an appointment with Abazari Mina MD, a general practitioner in San Francisco', 'USER: Fine any other doctor in San Jose and should be Dermatologist', 'SYSTEM: What about Advanced Dermatology & Skin Surgery, George Hsieh, M.D. in San Jose. He is a dermatologist', 'USER: Get me the address. What about their rating?', 'SYSTEM: The address is 4155 Moorpark Avenue #3. The rating is 3.9', \"USER: Yes that's perfect\", 'SYSTEM: Can i make an appointment', 'USER: No Not now. What about the weather there on March 4th', 'SYSTEM: The average temperature is 75 degrees Fahrenheit and 19 percent chance of rain', 'USER: Okay. Make an appointment on that day at twelve in the afternoon', 'SYSTEM: Please confirm this: Scheduling appointment with Advanced Dermatology & Skin Surgery, George Hsieh, M.D. at 12 pm on March 4th', \"USER: That's perfect. What is their phone number?\", 'SYSTEM: Sorry booking unsuccessful. Do you need anything else?', 'USER: Make the appointment at 11:00', 'SYSTEM: Please confirm this: Scheduling appointment with Advanced Dermatology & Skin Surgery, George Hsieh, M.D. at 11 am on March 4th', 'USER: Yes perfect. What is their phone number', 'SYSTEM: Appointment booked successfully. Phone number is 408-217-1905', \"USER: Thank you so much. That's all for now\", 'SYSTEM: Have a nice day']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I will be visiting London, UK and I am looking for a house to rent.', 'SYSTEM: There is a house with a 4.3 rating located at 1 Addington Street available for rent.', 'USER: That location would be perfect.', 'SYSTEM: Are you interested in reserving this house for your trip?', 'USER: Yes, I would like to rent this house.', 'SYSTEM: What will be your dates of stay and will there be more than one person in your group?', 'USER: There will be three people in the group and we will be arriving on Saturday this week and leaving on March 13th.', 'SYSTEM: Please confirm there will be 3 people arriving in London tomorrow and leaving on March 13th.', 'USER: Yes, that is correct.', 'SYSTEM: I have booked the house for you.', 'USER: Do they offer laundry service?', 'SYSTEM: Yes, this house does have a laundry service.', 'USER: I appreciate your assistance!', 'SYSTEM: Do you need any further assistance?', 'USER: That will be all at the moment.', 'SYSTEM: Have a wonderful day! Good -bye!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: At what time i can watch it?', 'SYSTEM: Which movie you like to watch and what about your location?', 'USER: Could you find movies shown in Campbell and i like to watch Curse of La Llorona.', 'SYSTEM: On what date you want to watch?', 'USER: I like to watch on 7th of march at Pruneyard Cinemas.', 'SYSTEM: I searched 1 showtime for the movie and the show is at 9:30 pm in Pruneyard Dine-In Cinemas.', 'USER: This is cool.', 'SYSTEM: Are you like to buy tickets?', 'USER: No, i will not purchase now and i need to get a cab to go there', 'SYSTEM: Will you be going to 1875 South Bascom Avenue? what number of people in cab?', 'USER: Fine and it is for 1 people', 'SYSTEM: You require shared ride?', 'USER: The shared ride is fine', 'SYSTEM: Please give confirmation details: You need to go to 1875 South Bascom Avenue on shared ride for 1 people', 'USER: Fine and how much it costs?', 'SYSTEM: Your ride is booked and cab will reach you soon. it costs $6.10', 'USER: What is the duration of the ride?', 'SYSTEM: The duration of ride is about 12 minutes.', 'USER: Thank you very much for your help.', 'SYSTEM: Any more help you need?', 'USER: No, thanks a lot for the help.', 'SYSTEM: Have a wonderful day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want you to find me a bus. I want to leave from Portland, and my destination is Seattle. The date when I plan to leave is 1st of March.', 'SYSTEM: There are 8 buses which match what you want. One of the buses has 0 transfers and departs at 8:40 am. The ticket for this bus costs $34.', 'USER: Is there some other bus you can recommend?', 'SYSTEM: Another bus which has 0 transfers leaves at 9:30 am. The ticket for this bus costs $31.', 'USER: This seems nice. Now I would like you to find me something interesting to do there on 12th of March. I enjoy Sports events, and more specifically I want to attend a Baseball event.', 'SYSTEM: How would you like attending the match of Mariners Vs Rangers which will happen at T-Mobile Park?', 'USER: Is there some other event you can suggest?', 'SYSTEM: Another event I can suggest is the match of Mariners Vs Rays at T-Mobile Park.', 'USER: Can you find some other event?', 'SYSTEM: I apologize, but there are no other events which match your request. Is there something else I can help you with?', 'USER: Could you please try to search again for Basketball events?', 'SYSTEM: There are 2 events which you might like. One of the events is the match of Seattle Vs Atlanta and it will happen at Alaska Airlines Arena.', 'USER: Can you tell me the start time of the event, and the location of the venue?', 'SYSTEM: The address of the venue is 3870 Montlake Boulevard Northeast, and the event should start at 5:30 pm.', 'USER: That seems nice to me. Is there some attraction there which you can suggest? More specifically I am looking for some garden which welcomes children.', 'SYSTEM: You might consider Gas Works Park, which is a Park.', 'USER: Can you give me their phone number? Could you tell me if the entrance at this attraction is free?', 'SYSTEM: I am glad to say that the entry at this attraction is free. If you want to call them you can at 206-684-4075.', 'USER: Alright, fine. Now I also need to find a house for 2 people to stay in, and which has a rating of 3.3.', 'SYSTEM: A good house I can recommend has a rating of 3.3, and can be found at 1000 1st Avenue.', 'USER: This house seems as what I want. That would be all.', 'SYSTEM: I am glad to help you. Good bye!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to search for a hotel for my upcoming travel', 'SYSTEM: In what location do you need to find a hotel?', 'USER: I need to find a hotel in London, UK as I will be visiting there soon', 'SYSTEM: 45 Park Lane is a 5 star hotel matching your preferences', 'USER: Great. I also need to reserve a rental car while there from next Thursday at approximately 2 o\"clock in the afternoon, and I\\'d prefer a Compact car', 'SYSTEM: How long would like you to reserve the rental car for?', 'USER: I actually would like to reserve a Standard car instead and I would like it until next Friday next week', 'SYSTEM: There are 5 options that may suit your needs. There is a great Standard car available on March 7th from Gatwick International Airport. The car is an Accord.', 'USER: Great, that works!', 'SYSTEM: Would you like to go ahead and book this rental car?', \"USER: Sure, I'd like to go ahead and reserve this car.\", 'SYSTEM: To confirm then, your reservation is from 2 pm on March 7th, returning on March 8th. The car is a Standard car which is available from Gatwick International Airport', 'USER: Sure, that;s perfect!', 'SYSTEM: Your reservation has been successfully confirmed', 'USER: Can you tell me the final amount for this reservation?', 'SYSTEM: The complete price for the rental is $32', \"USER: Great, thanks for everything. That's it for me!\", 'SYSTEM: Enjoy your day!']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need to find some music to listen to.', 'SYSTEM: What songs would you like to hear?', 'USER: I want to hear Knock Knock please.', 'SYSTEM: You want Knock Knock cast to the TV, correct?', 'USER: Yes that is correct, is this a song from 2017?', 'SYSTEM: No it is from 2014. Enjoy your tune.', 'USER: Thanks, I also need to transfer some cash.', 'SYSTEM: Which account would you like to transfer from, checking or savings? How much do you need to transfer and where do you want it transferred to?', 'USER: Send 350 dollars to Amir from checking.', 'SYSTEM: You want $350 sent to Amir from your checking to their checking, correct?', \"USER: Yes that's correct.\", 'SYSTEM: Your cash has been transferred.', 'USER: I need to find a romantic movie by George Sidney to watch online.', 'SYSTEM: Do you want to watch Viva Las vegas.', 'USER: Is there anything else you can find?', 'SYSTEM: I cannot not find any more of your preference. Can I do anything else for you?', 'USER: Yes please find a funny movie by Neil Burger please.', 'SYSTEM: How about the Upside?', 'USER: The Upside is great thanks.', 'SYSTEM: Do you want me to play the movie?', 'USER: Not at this time thanks.', 'SYSTEM: What else can I do for you?', 'USER: Nothing, that is all thank you.', 'SYSTEM: Okay, have a good day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I need an apartment with one bed rooms', 'SYSTEM: In which area?', \"USER: I'd like to find it in San Jose\", 'SYSTEM: There are 10 apartments, one of these is 888 Golden Saratoga-Cupertino Apartment Homes, located at 1546 Maurice Lane. It has 1 bed rooms and 1 baths. The rent per month is $1,600', 'USER: Could you show me more results?', 'SYSTEM: At 947 Branham Lane # C there is Almaden Garden Apartments: it has 1 bed rooms and 1 baths and it costs $1,850 per month', 'USER: Are animals allowed?', 'SYSTEM: Yes, animals are allowed.', 'USER: Is the apartment already furnished?', 'SYSTEM: No, it is not furnished.', \"USER: Ok, It's perfect! I would like to see the apartment on the 9th of this month\", 'SYSTEM: I book a visit to Almaden Garden Apartments on March 9th: do you confirm?', 'USER: No, I prefer on 8th of March.', 'SYSTEM: I book a visit to Almaden Garden Apartments next Friday: do you confirm?', \"USER: Yes, It's perfect. Can you find the phone number?\", 'SYSTEM: Phone number is 408-265-4808. Your visit to the apartment has been booked.', \"USER: Thank you, It's all.\", 'SYSTEM: Have a nice day']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I would like to check if I have any events on my calendar next Monday.', 'SYSTEM: I was able to pull up 2 events you have going on. One of those events is an Apartment viewing at 3 pm.', 'USER: Alright. Is there anything I have going on next Tuesday?', 'SYSTEM: Looks like you have 3 events going on that day. One of which is an Appointment at Fremont Barber Shop at 6:30 pm.', 'USER: Anything else going on?', 'SYSTEM: Yes, there as an Appointment with Arts Of Dentistry at 1:30 pm.', 'USER: Okay, sounds like a plan. What time blocks do I have nothing going on?', \"SYSTEM: Looks like you've got 3 time slots open on the calendar. One of which is from 8 am to 1:30 pm.\", 'USER: Great, thank you. That should do it for now.', 'SYSTEM: Perfect. Take care.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": "['USER: Find me a movie that stars Annemarie Lawless and is directed by Iain Softley.', 'SYSTEM: Search revealed 1 result which is Hackers and it has a rating of 6.2.', 'USER: That works for me. Find me a Country Concert to attend on the 14th of this month.', 'SYSTEM: What city do you want to hear it in?', 'USER: Find something in SFO.', 'SYSTEM: Okkervil River is playing at The Chapel at 7 pm on March 14th.', 'USER: What is their physical address.', 'SYSTEM: You can visit them at 777 Valencia Street.', 'USER: That is perfect.', 'SYSTEM: Shall I get you concert tickets now?', \"USER: No, don't buy anything for me.\", 'SYSTEM: Do you need more help?', 'USER: No, not right now. Thanks.', 'SYSTEM: Have a good day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": ": ['USER: What time can I watch it at Opera Plaza?', 'SYSTEM: What is the name of the movie that you want to watch? Also, what date do you want to watch it?', 'USER: I want to watch Gloria Bell next Monday.', 'SYSTEM: Where are you located?', 'USER: Search in San Francisco.', \"SYSTEM: I found one showing at 9:30 pm at the Landmark's Opera Plaza Cinema.\", 'USER: Sounds good.', 'SYSTEM: Do you want to buy tickets?', 'USER: No, not now. Can you find me a cab there?', 'SYSTEM: Do you want a cab to 601 Van Ness Avenue?', 'USER: Yes, that is correct.', 'SYSTEM: What type of ride would you like? Pool, Luxury, or something else? Also, how many seats do you need?', \"USER: I'd like a Regular ride for one.\", 'SYSTEM: Please confirm that you desire a 1 seat Regular ride to 601 Van Ness Avenue.', \"USER: Yes, that's right. How long will the cab be? How much will it be?\", 'SYSTEM: I have booked your ride. The cab will arrive in 6 minutes and will cost you $14.21.', 'USER: Thank you very much for your help.', 'SYSTEM: Is there anything else?', 'USER: No. Thank you.', 'SYSTEM: My pleasure. Have a good day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}, {"turns": " ['USER: I want a 3d movie to watch.', 'SYSTEM: What is your location.', 'USER: Can you search in San Jose?', 'SYSTEM: I have 7 movies. How about Breakthrough, How to Train Your Dragon: The Hidden World or Little?', 'USER: Find something else. Can you show what is on in Union City?', 'SYSTEM: I have 4 movies: After, Hellboy or Missing Link?', 'USER: Find something else, please.', 'SYSTEM: What about Pet Sematary?', 'USER: Pet Sematary is perfect. What time is it on? I want to watch at Century Union Landing.', 'SYSTEM: When would you like to watch it?', 'USER: I want to see it this Saturday.', 'SYSTEM: There is a show at 5 pm at Century 25 Union Landing & XD.', 'USER: That sounds good.', 'SYSTEM: Have a nice day.']\n", "annotations": [{"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}, {"error_type": "", "user_correction": "C2", "user_reaction": "", "turn": "", "phrase": ""}]}]