{"unique_id": "MUL2079.json_multiwoz_train", "id": "MUL2079.json", "turns": [{"utterance": "I need a cheap place to stay, what would you recommend?", "response": "I have about 10 different options. Do you prefer a hotel or guesthouse?"}, {"utterance": "It doesnt matter. I need free parking and prefer a place with 4 stars.", "response": "The Alexander Bed and Breakfast is in the centre of town, has 4 stars, is cheap, and has free parking and internet. Would this work for you?"}, {"utterance": "Yes, this will work for me. Please send me the address, postcode and reference number.", "response": "Absolutely. The Address is: 56 saint barnabas road cb12de and I can give you the reference number after we book it."}, {"utterance": "What type of hotel is this?", "response": "It is a guesthouse."}, {"utterance": "And what type of hotel is that?", "response": "A guesthouse is a type of hotel, thus it is a guesthouse type."}, {"utterance": "I'd like some information on a train next.", "response": "Where will you be departing from?"}, {"utterance": "I will be departing from Kings Lynn, and traveling to Cambridge.", "response": "There are many trains to your destination what time would you like to leave?"}, {"utterance": "The train should arrive by 16:45 and should leave on wednesday.", "response": "The TR2452 arrives in Cambridge leaves at 15:11 and arrives at 15.58. Would you like to book it?"}, {"utterance": "No, thanks! How long is the travel time?", "response": "The travel time is 47 minutes and is 9.80 pounds. Can I give you more information about this train or book you a seat?"}, {"utterance": "No thank you. That is all I need today.", "response": "Thank you and have a great trip."}], "annotations": [{"turn": 1, "annotation": [{"error_type": null, "comment": "just a response to a systems question", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["that doesnt really matter.", " it doesnt matter."], "confidence": 0.773, "turn": 1}]}