{"unique_id": "MUL2635.json_multiwoz_train", "id": "MUL2635.json", "turns": [{"utterance": "Hello, i'm looking for a cheap hotel in the cambridge area close to local attractions. I don't need internet or parking. Can you help?", "response": "All the lodging I have found offers internet and parking. Would that be ok?"}, {"utterance": "That is perfect, I was looking for free parking as it was.", "response": "Is there a particular part of Cambridge you are hoping to stay in?"}, {"utterance": "I'm looking for a place in the cheap price range with free parking.", "response": "I think the Allenbell would be a good fit. Would you like a reservation?"}, {"utterance": "Does it also have free wifi?", "response": "Yes it does have Wifi. Would you like me to book you a room?"}, {"utterance": "Yes, book one night please. What is the star rating by the way? Also what parks are in the west area?", "response": "its a 4-star. from which day should i book?"}, {"utterance": "Actually, Im not quite ready to book yet. But I am looking for parks in the west part of town. What are my options there?", "response": "I don't show any parks in the west. Would you like to try another attraction?"}, {"utterance": "Can you look for a nice museum instead?", "response": "There's 7 museums in the west and I highly recommend the cafe jello gallery. Would you like more information?"}, {"utterance": "I'd like the postcode and phone number of that gallery please.", "response": "The cafe jello gallery is at 13 magdalene street, postcode cb30af. Phone number 01223312112"}, {"utterance": "Can you book me a taxi as well?", "response": "Sure, what time would you like to leave and where from?"}, {"utterance": "I want to leave the museum by 23:00.", "response": "Can you specify your destination?"}, {"utterance": "I want to go from the Allenbell to the Cafe Jello Gallery. I want to leave the museum by 23:00.", "response": "Booking completed! The booked car type is a yellow skoda and your contact number is 07590574334. Can I help you with anything else?"}, {"utterance": "Nope, that should be all for today, thanks!", "response": "no problem. I have changed your booking. Your new taxi would be a black volkswagen and its contact number is 07276925880. Is that everything?"}, {"utterance": "Thank you that's all i need!", "response": "You're welcome. Have a good time!"}], "annotations": [{"turn": 5, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "E1", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " actually, im not quite ready to book yet."], "confidence": 0.925, "turn": 5}]}