{"unique_id": "MUL2656.json_multiwoz_train", "id": "MUL2656.json", "turns": [{"utterance": "I am looking for a place to stay.", "response": "Sure. Do you have a preference as to location, price, or amenities?"}, {"utterance": "I would like free parking and wifi for sure. Preferably on the west side with 4 stars, too.", "response": "I'd suggest Finches Bed and Breakfast. It's a guesthouse in the west area with free internet and parking."}, {"utterance": "That sounds wonderful. Could you reserve our rooms? We'll be a party of 8, and we'd like to arrive on Sunday. I think we'll be staying 4 nights.", "response": "I have booked Finches Bed & Breakfast for you starting Sunday for 4 nights for 8 people. Your reference number is H7WHFPQT . Is there anything I may assist with?"}, {"utterance": "Thank you, yes, I'd like to also find a nice park to visit while I'm in town. Can you see if there is one near my hotel?", "response": "Unfortunately, I could not find a park in the west. Can I try a different area?"}, {"utterance": "No, but can you try to find a museum in the west please?", "response": "Sure, I'd like to suggest the cafe jello gallery. Is that everything?"}, {"utterance": "May I please get their address and phone number?", "response": "The Cafe Jello Gallery is at cafe jello gallery, 13 magdalene street and their phone number is 01223312112. What else can I do for you?"}, {"utterance": "No, you've been so helpful. Thank you so much! Have a great night.", "response": "You're welcome, have a great day as well."}], "corrections": [{"phrase": ["are you sure that there are no hotels on the west side of town?", " can you see if there is one near my hotel?"], "confidence": 0.628, "turn": 3}], "annotations": [{"turn": 3, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}]}