{"unique_id": "PMUL0029.json_multiwoz_train", "id": "PMUL0029.json", "turns": [{"utterance": "I am looking for a place to stay", "response": "I will definitely be able to help you with that. Did you want a hotel or a guest house?"}, {"utterance": "I'm looking for a guesthouse with free parking and free wifi.", "response": "There are a lot of guesthouses that meet that criteria. Do you want to stay in a particular area?"}, {"utterance": "No, I don't care about the location. I do want a 4 star place though.", "response": "The acorn guest house has a 4 star rating and is in the moderate price range. It is in the north area. Would you like to reserve a room?"}, {"utterance": "Yes. Where is a good expensive restaurant in the West area of town?", "response": "There are nine expensive restaurants in the west, is there a particular type of food that you are interested in?"}, {"utterance": "Can you give me some examples of the type of cuisine that is available?", "response": "There's british, european, indian, and thai."}, {"utterance": "What's the address, postcode and phone number of the thai restaurant?", "response": "Sala Thong serves Thai food and is located at 35 Newnham Road, Newnham cb39ey. Their phone number is 01223323178. Can I help with a booking?"}, {"utterance": "Yes can you please book that for me?", "response": "What day and time would you like me to reserve the restaurant for?"}, {"utterance": "let's book it for wednesday please.", "response": "How many people will the booking be for and what time would you prefer the booking to be at?"}, {"utterance": "I think we're jumping way ahead of ourselves here. Let's start afresh. Please get me the address to the acorn and then we can proceed with getting a taxi", "response": "The address to acorn is 154 chesterton road."}, {"utterance": "Thank you! Good bye.", "response": "Thank you for calling Cambridge TownInfo centre. It was a pleasure to help you."}], "annotations": [{"turn": 2, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "E2", "comment": "", "user_correction": "C1", "user_reaction": "UR1"}]}, {"turn": 7, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["id really like a 4 star.", " i do want a 4 star place though."], "confidence": 0.627, "turn": 2}, {"phrase": ["actually, i apologize no need to book, i was just gathering information", "let's book it for wednesday please."], "confidence": 0.557, "turn": 7}]}