{"unique_id": "PMUL0172.json_multiwoz_train", "id": "PMUL0172.json", "turns": [{"utterance": "I will be staying in Cambridge. I need a hotel with wifi.", "response": "What about a and b guest house? It's in the East."}, {"utterance": "I need something in the centre.", "response": "There are 7 hotels which area do you prefer?"}, {"utterance": "The north part of town", "response": "I ran a search in the north, there's 12 choices. Lets make sure were on the same page, is this the area that you want? Also hotel or Guesthouse?"}, {"utterance": "Sorry, I've been all over the place. To be clear, I need a hotel with free wifi and parking that is in the centre.", "response": "Shall I choose a hotel for you, or do you have a preference? 4 hotels have free parking and internet in that area."}, {"utterance": "yes please recommend one. the booking is needed for saturday. 3 nights, 6 people", "response": "May I recommend alexander bed and breakfast. While it is a cheap guesthouse in the centre of town, it has a 4 star rating and also included internet and parking"}, {"utterance": "Ok great. Can you book a room for 6 people and 3 nights starting from Saturday.", "response": "Booking was successful. Reference number is : QK6KCZQA"}, {"utterance": "Great, thank you. Im also in need of an Indian restaurant in the cheap price range. Can you find me one?", "response": "We have several. What part of town are you thinking?"}, {"utterance": "Any will do, what ever you recommend.", "response": "Royal Spice is located in the north. It's one of my personal favorites. Would you like me to make reservations for you?"}, {"utterance": "I certainly want to try it then. Please book for 6 people at 11:30 on Saturday.", "response": "You have been booked at the Royal Spice. Your reference number is WSPAI5JJ . Can I be of further assistance today?"}, {"utterance": "Thank you . I am all set.", "response": "Great! And you're welcome, have a great day!"}], "annotations": [{"turn": 6, "annotation": [{"error_type": null, "comment": "not a correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}, {"turn": 4, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["i would prefer in bombay.", " im also in need of an indian restaurant in the cheap price range."], "confidence": 0.634, "turn": 6}, {"phrase": ["actually, i apologize no need to book, i was just gathering information", "the booking is needed for saturday."], "confidence": 0.591, "turn": 4}]}