{"unique_id": "PMUL0241.json_multiwoz_train", "id": "PMUL0241.json", "turns": [{"utterance": "I'm looking for a Belgian food restaurant in the centre. Can you help me?", "response": "There are no Belgian places in Centre at this time. Would you like to try a different cuisine or area?"}, {"utterance": "Yes. Please try European food in the Centre.", "response": "we dont have a place that matches those qualities. can you try something else?"}, {"utterance": "What restaurants are located in the centre?", "response": "There are many can I get a price range you are looking for?"}, {"utterance": "I am not concerned with price.", "response": "Can I interest you in a moderately priced restaurant called Yippee Noodle Bar, an Asian Oriental restaurant in the city centre?"}, {"utterance": "Yes that would be fine. Please make reservations for 8 people at 11:15 on wednesday.", "response": "I have booked you for 8 people at 11:15 on Wednesday at Yippee Noodle Bar. Your reference number is: TCLMEX5I"}, {"utterance": "I'm also wanting to stay at the Alpha-Milton Guest House. Can you help with that?", "response": "Sure thing would you like a reservation?"}, {"utterance": "Yes. Three nights, from Wednesday. 8 people.", "response": "Good news, the booking of the hotel was successful, and the Reference number is : V3PB9S6V ."}, {"utterance": "Thank you. I also need a taxi two commute between the hotel and restaurant.", "response": "Ok great and what time do you prefer?"}, {"utterance": "I need to arrive at the restaurant in time for our reservation. Wouldn't want to miss my booked time.", "response": "Okay, was there a specific time you were looking for?"}, {"utterance": "Our reservations are for 11:15.", "response": "I have booked you a taxi. The contact number is 07375849542 and it will be a grey Volvo. Is there anything else I can help you with today?"}, {"utterance": "No thanks. That does it. Have a good night. Bye.", "response": "Enjoy your visit! Let us know if we can be of any further assistance."}], "annotations": [{"turn": 3, "annotation": [{"error_type": null, "comment": "the system asks the user about the preferred price range (no correction)", "user_correction": "C2", "user_reaction": ""}, {"error_type": "E2", "comment": "", "user_correction": "C1", "user_reaction": "UR1"}]}], "corrections": [{"phrase": ["i dont care about price.", " i am not concerned with price."], "confidence": 0.885, "turn": 3}]}