{"unique_id": "PMUL0366.json_multiwoz_train", "id": "PMUL0366.json", "turns": [{"utterance": "I need a place to eat in the centre of town.", "response": "There are a lot of restaurants to choose from in the centre, what type of food do you want to eat?"}, {"utterance": "Can you please search for indian food.", "response": "I have many choices in the city center. Are you looking for something expensive or cheap?"}, {"utterance": "I want something expensive.", "response": "How about Curry Garden on Regent Street?"}, {"utterance": "That would be fine. I would like reservations on wednesday for 3 people at 18:15.", "response": "The curry garden will be expecting your party on Wednesday at 18:15. Your reference is 925W0ZE2 . Is there anything else I can do for you today?"}, {"utterance": "Yes. I also need a 4 star hotel.", "response": "There are 21 4 star options. Do you need internet or parking?"}, {"utterance": "Parking doesn't matter, but I want it to be in the same area as the restaurant.", "response": "There are two 4 star choices in the centre. A cheap guesthouse as well as an expensive hotel. Would you like to book one today?"}, {"utterance": "I'll like a hotel with free internet", "response": "I have two results for you. Do you prefer a guesthouse or a hotel"}, {"utterance": "Either will do - which place do you think is better?", "response": "I would recommend University arms hotel. Would you like me to make reservations for you?"}, {"utterance": "Does it have free parking? Also I need to know if they have free internet. The address and the type of hotel it is, got it?", "response": "It does have free parking. It is a hotel. The address is regent street, post code cb21ad. Would you like me to make a reservation?"}, {"utterance": "Yes, please make a reservation for 3 people.", "response": "when will you be arriving and how many rooms?"}, {"utterance": "I actually dont need a booking at this time. I have everything I need. Thank you, goodbye!", "response": "Glad to be of help. Have a nice day."}], "annotations": [{"turn": 10, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["actually, i apologize no need to book, i was just gathering information.", " i actually dont need a booking at this time."], "confidence": 0.674, "turn": 10}]}