{"unique_id": "PMUL0479.json_multiwoz_train", "id": "PMUL0479.json", "turns": [{"utterance": "Hello, I am looking to find a restaurant that is in the centre. I would prefer something in the expensive price range.", "response": "I can help you with that. Do you have any cuisine preferences?"}, {"utterance": "Yes, I would like to eat Chinese food.", "response": "Oh I have some great options for you. I have a total of 4 restaurants, how about trying th Ugly Duckling?"}, {"utterance": "Yes that is good please make a booking for 8 people at 14:15 on sunday.", "response": "Booking was successful. The table will be reserved for 15 minutes. Your reference number is 076ZN8YF"}, {"utterance": "I need a place to stay that has free parking and is in the expensive price range.", "response": "I found 33 hotels that match that criteria. Is there a particular side of town you prefer so I can make a recommendation?"}, {"utterance": "It doesnt matter. I would like 4 stars and fee wifi though.", "response": "The huntingdon marriott hotel is a 4 star hotel"}, {"utterance": "That sounds great! Does it have free parking and free wifi?", "response": "Yes it has both, would you like me to book you?"}, {"utterance": "Yes please, I need rooms for 8 people starting Sunday for 3 nights.", "response": "Booking was successful. Reference number is : TBICSA49 . Is there anything else I can assist you with?"}, {"utterance": "I need a taxi from the hotel to the restaurant by 14:15. Please provide the car type and contact number", "response": "I will be happy to book that for you. Where is your destination?"}, {"utterance": "I need it to go between the hotel and restaurant, please.", "response": "I need to know where you are going?"}, {"utterance": "TO THE RESTAURANT! JUST BOOK IT< YOU HAVE ALL OF MY INFO! thank you", "response": "Your taxi booking has been completed! The car type is a red Audi, Contact number 07964587638. Can I assist with anything else?"}, {"utterance": "No, that is it for now. Thank you so much.", "response": "Thank you and enjoy your stay!"}], "annotations": [{"turn": 4, "annotation": [{"error_type": null, "comment": "just a response to a systems question", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["that doesnt really matter.", " it doesnt matter."], "confidence": 0.773, "turn": 4}]}