{"unique_id": "PMUL1468.json_multiwoz_train", "id": "PMUL1468.json", "turns": [{"utterance": "Hello, a friend recommend I try out Camboats while I'm in town. Can you tell me more about it?", "response": "camboats is a boat in the east. Do you need a phone number?"}, {"utterance": "Yes, please, and also the address.", "response": "The phone number for Camboats is 01223902112 and the address is The Plough, Green End, Fen Ditton. Can I help you with anything else?"}, {"utterance": "Can you tell me the entrance fee?", "response": "I'm sorry. I don't have any information on the entrance fee. I'm not sure if they have one or not."}, {"utterance": "Okay, don't worry about it. Just please find me a train that arrives in cambridge by 13:30", "response": "TR5219 leaves from london kings cross at 05:17 arriving at Cambridge on Friday at 06:08. Would you like me to book a seat?"}, {"utterance": "you didn't even ask where i'm leaving. or what time. youre not very helpful Help Desk", "response": "I think there was a bad connection or a line crossed on that last sentence. I have the arrival time as 13:30, I just need the day."}, {"utterance": "I will be traveling on Thursday.", "response": "I have a train on Thursday that arrives by 12:08. Will that do for you?"}, {"utterance": "Yes, that would be fine. I'll need tickets for 7 people.", "response": "Done! The total is 165.20 Pounds, payable at the station. Your reference number is 1AGJWGQ4 . Can I help you with anything else?"}, {"utterance": "No, thank you. I have everything I need right now. Goodbye.", "response": "I am glad to help you. Have a good day."}], "corrections": [{"phrase": ["youre not very helpful help desk.", " youre not very helpful help desk"], "confidence": 0.927, "turn": 4}], "annotations": [{"turn": 4, "annotation": [{"error_type": "E3", "comment": "systems wants to book a train without asking for the day and departure stations", "user_correction": "C1", "user_reaction": "UR4"}, {"error_type": "E5", "comment": "", "user_correction": "C1", "user_reaction": "UR3"}, {"error_type": "E3", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}]}]}