{"unique_id": "PMUL1625.json_multiwoz_train", "id": "PMUL1625.json", "turns": [{"utterance": "I'm looking for a train that leaves on monday after 16:15. Any suggestions?", "response": "Where are you departing from and what is your destination?"}, {"utterance": "I'm leaving Cambridge and headed to Ely.", "response": "There is a train to Ely that leaves at 17:50 on Monday. Would you like me to book it?"}, {"utterance": "No, I just need the train ID and arrival time.", "response": "Sure the train id is TR4294 and the arrival time is 18:07."}, {"utterance": "I am also looking for a guesthouse with a rating of 4 stars.", "response": "I have several guesthouses with 4 star ratings. Is there a particular area you'd like to be in?"}, {"utterance": "It does not matter but I would like free parking.", "response": "What price range would you like?"}, {"utterance": "Price range is not important, just the four stars.", "response": "What area of town would you like?"}, {"utterance": "As long as it has free parking, that's all I really need. Can you recommend one and tell me a little about it?", "response": "I have 5 guesthouses with free parking. I recommend the Acorn Guest House in 154 Chesterton Road, postcode cb41da."}, {"utterance": "Does it have free internet?", "response": "Yes, it has free internet. Would you like me to book it for you?"}, {"utterance": "No, just the area and postcode please.", "response": "it is in the north area and the post code is cb41da. would you like to make a booking?"}, {"utterance": "No, thanks. Im not ready to book at this time.", "response": "Can i help you with anything else today?"}, {"utterance": "Nope. That's all. Goodbye.", "response": "Thank for calling today. Goodbye!"}], "annotations": [{"turn": 9, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "E2", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}, {"error_type": "E3", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " im not ready to book at this time."], "confidence": 0.937, "turn": 9}]}