{"unique_id": "PMUL1941.json_multiwoz_train", "id": "PMUL1941.json", "turns": [{"utterance": "I'm hoping to book a train from bishops stortford to cambridge. Please list all times for that route.", "response": "There's a total of 70 trains. Is there a particular time of day you would like to travel?"}, {"utterance": "I need to leave Wednesday and arrive after 11:15.", "response": "Thanks for that information. What time you would like to leave?"}, {"utterance": "I would like to leave after 11:15.", "response": "Unfortunately there are no trains meeting your criteria. Would you like me to look up another departure and arrival time?"}, {"utterance": "no, i want that day and time please", "response": "The TR0516 leaves Cambridge at 11:29 on Wednesday. Will that work for you?"}, {"utterance": "Well, I need to know the arrival time first.", "response": "Arrival time is 12:07 does that work for you?"}, {"utterance": "Yeah, that works. Can you recommend a 0 star hotel for me?", "response": "Yes I have two guesthouses and 1 hotel in that category do you have a preferred area?"}, {"utterance": "I'd like it to be in the centre please.", "response": "In the town centre there is one guesthouse and one hotel with 0 stars. Would you like the hotel or the guesthouse?"}, {"utterance": "it doesnt really matter. Moderately priced located in the centre. I need phone number, hotel type and if they have free parking or not", "response": "i suggest cityroomz. its a hotel in the moderate price range. their phone number is 01223327978"}, {"utterance": "Does it have free parking?", "response": "Yes, they do have free parking at this hotel."}, {"utterance": "Great, thank you. That is all that I need.", "response": "You're welcome, have a great day!"}], "annotations": [{"turn": 7, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["that doesnt really matter.", " it doesnt really matter."], "confidence": 0.871, "turn": 7}]}