{"unique_id": "PMUL2676.json_multiwoz_train", "id": "PMUL2676.json", "turns": [{"utterance": "I would like to find a cheap hotel to stay at where there is free parking. Do you have any suggestions?", "response": "The cambridge belfry fits the bill, would you like me to book you a room?"}, {"utterance": "Do they have free parking? are they rated 3 stars?", "response": "Yes, they do have free parking and they have 4 stars."}, {"utterance": "Did you have something that fits with 3 stars?", "response": "I hovw no listing for a 3 star hotel,would you like too try another area ?"}, {"utterance": "What about a 4 star hotel?", "response": "The Cambridge Belfry is a 4 star hotel in the cheap price range and is on the west side. They offer free Wifi and parking. Would you like a reservation?"}, {"utterance": "Yes,please book for 5 people for 5 nights starting on Thursday.", "response": "I am unable to book for Tuesday."}, {"utterance": "I would like to book for Thursday, not Tuesday.", "response": "I am sorry, I can't make that reservation either."}, {"utterance": "Is Monday available?", "response": "As it turns out, Thursday just opened up. I was able to book it for you, here is your reference number, UGU8T7UB ."}, {"utterance": "Thanks! Can you also help me find a college to visit in town?", "response": "There are 18 options. Was there a part of town you would like to visit?"}, {"utterance": "Can you suggest one for me?", "response": "I would recommend christ's college in Saint Andrew's street in the centre of town."}, {"utterance": "What is the entrance fee and postcode there?", "response": "Entry is free. The postcode is cb23bu. May I help with anything else?"}, {"utterance": "Thank you so much. Good bye", "response": "Okay, goodbye and enjoy your time in town"}], "annotations": [{"turn": 5, "annotation": [{"error_type": "E4", "comment": "the system clearly got the slot wrong; user was asking for Tuesday, system responds with Thursday", "user_correction": "C1", "user_reaction": "UR3"}, {"error_type": "E3", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}, {"error_type": "E1", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}]}, {"turn": 1, "annotation": [{"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["actually, i apologize no need to book, i was just gathering information.", " i would like to book for thursday, not tuesday."], "confidence": 0.6, "turn": 5}, {"phrase": ["i'd really like a 4 star", "are they rated 3 stars?"], "confidence": 0.526, "turn": 1}]}