{"unique_id": "PMUL3235.json_multiwoz_train", "id": "PMUL3235.json", "turns": [{"utterance": "My cousin told me about a place called the fez club.", "response": "The fez club is a nightclub located at 8 market passage in the centre area. To enter the club it will cost you 5 pounds."}, {"utterance": "Can I get the postcode, address, and phone number for it? I also am looking for a place to eat.", "response": "Here's the information: cb23hx, 8 market passage and 01223519224. What kind of food would you like?"}, {"utterance": "anything is good as long as it is in the centre", "response": "Well, the city centre has a lot of places to eat. Do you have a price range in mind?"}, {"utterance": "I would like something moderately priced.", "response": "I have many options including Asian, British, Chinese, Italian and European food. Anything interest you?"}, {"utterance": "I've never had British food. Let's try that. Can you tell me some info on that one?", "response": "Well I personally like The Oak Bistro which is located on 6th Lensfield Road."}, {"utterance": "Can you book that for me?", "response": "I'd be happy too. Do you know when you'd like to eat?"}, {"utterance": "Let's say 17:30. Is there a reservation available at that time?", "response": "It looks like they have an opening. Can you tell me how many people will be in your party?"}, {"utterance": "On second thought, Im not ready to book yet. I need to talk to my wife. Can you just get me the post code for Oak Bistro?", "response": "Yes, it is cb23hx. What else can I help you with today?"}, {"utterance": "Great thank you. That will be all. Goodbye", "response": "Have a nice day."}], "annotations": [{"turn": 7, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "E2", "comment": "", "user_correction": "C1", "user_reaction": "UR1"}]}], "corrections": [{"phrase": ["im not ready to book just yet.", " on second thought, im not ready to book yet."], "confidence": 0.907, "turn": 7}]}