{"unique_id": "PMUL3484.json_multiwoz_train", "id": "PMUL3484.json", "turns": [{"utterance": "I am looking for a hotel named alyesbray lodge guest house.", "response": "i have their info, what would you like to know?"}, {"utterance": "I would like to book a reservation for it. Can you help me with that?", "response": "I sure can. First, I will need to know when you want your stay to begin and how many days you'll be staying. Also, how many people will be staying?"}, {"utterance": "We will be arriving on Sunday and will stay for 5 nights.", "response": "Can you tell me how many guests will be staying in the room?"}, {"utterance": "There will be 8 guests.", "response": "Booking was successful. Your reference number is 4UFN3SWC . Will that be all for today?"}, {"utterance": "that is it thank you.", "response": "You have a nice day then!"}, {"utterance": "Can you actually look up a restaurant for me as well?", "response": "sure thing what's the area and or name?"}, {"utterance": "It's a place called Don Pasquale Pizzeria.", "response": "A very nice place in the centre. Need a reservation?"}, {"utterance": "Yes, I do. Ill need it booked for the same day, same people, and wed like to eat at 19:00.", "response": "Booking was successful. The table will be reserved for 15 minutes. Reference number is : GVM0PAM2 ."}, {"utterance": "Great. One more thing. Can you book a taxi between the two places? I'd like to arrive at the restaurant in time for my reservation.", "response": "Contact number 07404031593. You are in a Red Skoda."}, {"utterance": "Thank you so much that was all I needed.", "response": "Alright, hope you enjoy the rest of your day."}], "corrections": [{"phrase": ["actually, i apologize no need to book, i was just gathering information.", " ill need it booked for the same day, same people, and wed like to eat at 19:00."], "confidence": 0.543, "turn": 7}], "annotations": [{"turn": 7, "annotation": [{"error_type": null, "comment": "no correction", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}]}