{"unique_id": "PMUL3845.json_multiwoz_train", "id": "PMUL3845.json", "turns": [{"utterance": "i need a place to stay", "response": "Okay! What part of town would you like to stay in?"}, {"utterance": "I'd prefer something in the North, a 4 star hotel with free wifi if possible.", "response": "There are no 4 start hotels in the north with free wifi."}, {"utterance": "would you like to book something without free wifi, or in another area.", "response": "There are no 4 star hotels in the north are with free internet. Is there anything else I can help you with?"}, {"utterance": "What about a guesthouse with 4 stars in the north?", "response": "Yes, I see several guesthouses available! They are all in the moderate price range; does parking matter to you?"}, {"utterance": "The parking does not matter.", "response": "Yes, I would recommend Avalon. It is at 62 Gilbert Road, postcode cb43pd."}, {"utterance": "Can you tell me the phone number?", "response": "Sure, the phone number is 01223353071."}, {"utterance": "Can you also help me find an indian place to eat.", "response": "Is there a certain area or price range you would like?"}, {"utterance": "I'm sorry, I meant to ask for help finding something fun to do in town in the north side of town. I don't need a restaurant after all.", "response": "do you have a type in mind?"}, {"utterance": "can I get a boat?", "response": "riverboat georgina is in the north. Would this work?"}, {"utterance": "find me its entrance fee", "response": "Yes, I would have to give them a quick call. How many people and what day?"}, {"utterance": "Im not ready to book it. I would just like to know the entrance fee.", "response": "I'm sorry. The entrance fee for the Riverboat Georgina is unknown. Would you like the phone number?"}, {"utterance": "no thanks that will be all then", "response": "I am glad that I can help. Have a nice stay."}], "annotations": [{"turn": 10, "annotation": [{"error_type": null, "comment": "the user just informs the system that he is not ready to book (unrequested)", "user_correction": "C2", "user_reaction": ""}, {"error_type": "E3", "comment": "", "user_correction": "C1", "user_reaction": "UR2"}, {"error_type": "E2", "comment": "", "user_correction": "C1", "user_reaction": "UR1"}]}, {"turn": 2, "annotation": []}], "corrections": [{"phrase": ["im not ready to book just yet.", " im not ready to book it."], "confidence": 0.861, "turn": 10}, {"phrase": ["actually, i apologize no need to book, i was just gathering information", "would you like to book something without free wifi, or in another area."], "confidence": 0.561, "turn": 2}]}