{"unique_id": "PMUL3951.json_multiwoz_train", "id": "PMUL3951.json", "turns": [{"utterance": "Please find me a train from cambridge to stansted airport", "response": "Sure, I can do that but first I need a little more information. What day would you like to travel as well as departure and arrival times?"}, {"utterance": "Saturday leaving Cambridge anytime after 20:00 please", "response": "TR3128 will leave at 20:40 and arrive by 21:08. Do you need more information or would you like to book tickets?"}, {"utterance": "Can you book me 6 tickets please?", "response": "You're all set. Total for tickets is 48.48 GBP payable at the station. Reference number is JD6SA21J ."}, {"utterance": "I am also looking for The Riverside Brasserie.", "response": "riverside brasserie is a modern european restaurant in the centre. Its address is Doubletree by Hilton Cambridge Granta Place Mill Lane and postcode is cb21rt. Want to book it?"}, {"utterance": "Yes, I would like to book it and get a reference number.", "response": "Unfortunately, I cannot book it at this time."}, {"utterance": "Can you try for Saturday at 13:00?", "response": "How many people will be dining?"}, {"utterance": "6 people will be dining", "response": "Your booking was successful. Your reference number is 3VX3AOKS ."}, {"utterance": "Thanks for everything you have been great!", "response": "Thank you is there anything else today?"}, {"utterance": "No that is all I needed. Thank you ever so kindly.", "response": "Wonderful. I'm glad I could help. Have a great day. Goodbye."}], "annotations": [{"turn": 4, "annotation": [{"error_type": null, "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["actually, i apologize no need to book, i was just gathering information.", " yes, i would like to book it and get a reference number."], "confidence": 0.624, "turn": 4}]}