{"unique_id": "PMUL4273.json_multiwoz_train", "id": "PMUL4273.json", "turns": [{"utterance": "I'm looking for a train that goes to Cambridge and arrives by 08:45.", "response": "I found 231 trains that fit your request. Where will you be departing from?"}, {"utterance": "I will be departing from Birmingham New Street on Tuesday.", "response": "TR0254 Leaves at 05:40, would you like me to book that for you?"}, {"utterance": "No thank you. Please tell me about the ticket pricing and time of travel", "response": "The price is 75.10 pounds and it is a 163 minutes ride. Can I help you with anything else?"}, {"utterance": "Please book 6 tickets and send me the reference number.", "response": "Booking was successful, the total fee is 450.6GBP payable at the station . Reference number is : G368B2VI. Can I help with anything else today?"}, {"utterance": "Yes please. I need a 3 star hotel that offers free wifi", "response": "I found two expensive hotels, one in the centre and one in the south of town. Do you have a preference?"}, {"utterance": "I would like to stay in the centre of town please.", "response": "What price range and what star rating are you looking for ?"}, {"utterance": "I would prefer a 3 star rating, price range isnt important.", "response": "Okay there are two options, the gonville hotel and the lensfield hotel"}, {"utterance": "I want the hotel located in the centre, as I stated before.", "response": "The Gonville Hotel is in the centre of town. Would you like me to book a room or is there anything i can assist you with?"}, {"utterance": "please just send me their postcode. thank you", "response": "The postcode is cb11ly."}, {"utterance": "Thank you for all your help.", "response": "You are quite welcome. Is there anything else I can assist you with?"}, {"utterance": "That is all that I need.", "response": "Thank you for using the Cambridge TownInfo Centre. Have a great day!"}], "annotations": [{"turn": 6, "annotation": [{"error_type": "E2", "comment": "the sytem ignores that the user already asked for a hotel with 4-star rating", "user_correction": "C1", "user_reaction": "UR2"}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}, {"error_type": "", "comment": "", "user_correction": "C2", "user_reaction": ""}]}], "corrections": [{"phrase": ["id really like a 4 star.", " i would prefer a 3 star rating, price range isnt important."], "confidence": 0.709, "turn": 6}]}